{
    "pink primrose": [
        "Leaves are more rounded and less elongated than those of a Mexican petunia",
        "Oval-shaped leaves with a slightly serrated edge",
        "Taller and more slender stems",
        "Usually grows close to the ground or in clumps",
        "delicate, light pink petals"
    ],
    "hard-leaved pocket orchid": [
        "flowers often in shades of pink, white, or purple",
        "orchid-specific flower shape with bilateral symmetry and a prominent lip (labellum)",
        "Presence of a prominent lip or labellum with intricate patterns",
        "**Flower Symmetry**: Zygomorphic (bilateral) symmetry in flowers.",
        "Distinct sepals and petals arrangement typically in a triangular pattern"
    ],
    "canterbury bells": [
        "Typically a shorter plant compared to morning glory, which often have vine-like growth",
        "Bell-shaped blossoms",
        "Bell-shaped blooms",
        "bell-shaped flowers",
        "Bell-shaped flowers"
    ],
    "sweet pea": [
        "Flowers typically in shades of pink, purple, or white",
        "pale pink, white, or greenish color",
        "flower colors ranging from white, pink, red, purple, to blue",
        "pastel flower colors",
        "Brightly colored, delicate flowers often with a sweet fragrance"
    ],
    "english marigold": [
        "Central disc that may appear darker in color",
        "bright orange or yellow color",
        "A more consistent deep orange or yellow color",
        "Bright orange or yellow coloration",
        "Daisy-like flower shape"
    ],
    "tiger lily": [
        "More bell-shaped or trumpet-like flower structure",
        "Orange petals with black spots",
        "Orange petals with dark spots",
        "Distinctive orange color with black spots",
        "elongated petals that are often orange with dark spots"
    ],
    "moon orchid": [
        "white or pale color with potential touches of yellow or purple",
        "white or light-colored petals with potential purple or yellow spots",
        "Often found in white or pastel colors",
        "white or pale-colored petals with a yellow center",
        "white or pale yellow petals"
    ],
    "bird of paradise": [
        "Brightly colored flowers with orange and blue petals",
        "Large, bold, and vivid orange and blue petals",
        "Distinctive bright orange and blue petals",
        "Pointed petals that resemble bird plumage",
        "Bright orange and blue-purple petals"
    ],
    "monkshood": [
        "Blue, purple, or white flower color",
        "Dark purple or blue color of flowers",
        "Deep blue or purple coloration of the flowers",
        "deep blue or purple flower color",
        "Deep blue or purple color"
    ],
    "globe thistle": [
        "more open, airy flower structure",
        "A bud shape that is more elongated and tapering rather than spherical",
        "Spherical, ball-shaped flower heads",
        "Spherical flower head",
        "Single, prominent flower per stem"
    ],
    "snapdragon": [
        "Brightly colored petals in various hues (often pink, red, yellow, white, or purple)",
        "stem structure: Snapdragons often have sturdy, upright stems, while sweet peas have more slender, vining stems.",
        "Symmetrical, often brightly colored blooms",
        "Typically bright and varied colors (e.g., red, pink, yellow, white)",
        "Distinctive \"dragon mouth\" appearance of flowers"
    ],
    "colt's foot": [
        "Yellow flowers with a dandelion-like appearance",
        "Flower stalk: Colt's foot flower stalks appear before the leaves and are scaly, whereas dandelion stalks are smooth.",
        "yellow, dandelion-like flowers",
        "Flower color: Both flowers are yellow, but colt's foot flowers tend to be a paler yellow compared to the brighter yellow of dandelions.",
        "**Flower Color**: Coltsfoot flowers are yellow, whereas oxeye daisy flowers typically have white petals with a yellow center."
    ],
    "king protea": [
        "overall flower structure resembling a giant blossom rather than a flat, circular disk",
        "Overall dome or cup-shaped appearance",
        "Large, bowl-shaped flower head",
        "large, bowl-shaped flower head",
        "Large, round flower head"
    ],
    "spear thistle": [
        "Brightly colored petals (often in shades of pink, purple, red, or white)",
        "Thistle-like appearance",
        "Habitat: Spear thistles are often found in pastures, meadows, and roadsides, whereas thorn apples are typically found in disturbed soils, such as fields and waste areas.",
        "Typically found in wild, uncultivated areas",
        "Purple flower head"
    ],
    "yellow iris": [
        "Flowers have a delicate, ruffled appearance",
        "beardless or bearded falls: Some irises have distinct beard-like structures on the falls, which sunflowers lack.",
        "Rhizomes: Iris flowers often grow from thickened, horizontal underground stems called rhizomes, which can sometimes be visible at the soil surface.",
        "The foliage is long and strap-like.",
        "Foliage: Iris leaves are usually long, erect, and blade-like, similar to swords or fans."
    ],
    "globe-flower": [
        "Lobed, deeply cut leaves resembling buttercup leaves",
        "Leaves that are deeply lobed and resemble buttercup leaves",
        "Bright yellow or golden color",
        "Yellow or golden color",
        "Bright yellow or orange coloration"
    ],
    "purple coneflower": [
        "Pinkish-purple petals",
        "Pink or purplish petals",
        "Pink to purple petals",
        "Purple or pink petals (typical of purple coneflower)",
        "Purple or pink petals"
    ],
    "peruvian lily": [
        "usually found in shades of pink, white, yellow, orange, and red",
        "often bicolored petals with contrasting spots or stripes",
        "typically available in a wide range of vibrant colors including pink, orange, purple, red, yellow, and white",
        "Absence of a large central bract (which is typically seen in Siam tulips)",
        "Brightly colored petals often in shades of pink, red, orange, or yellow"
    ],
    "balloon flower": [
        "Five-pointed star-shaped flowers",
        "Large, single, bell-shaped flowers with five petals",
        "star-shaped, blue or purple flowers",
        "Leaves with a slightly serrated edge and narrow shape",
        "Narrow, toothed leaves"
    ],
    "giant white arum lily": [
        "Single, large, trumpet-shaped white flower",
        "Large, white, trumpet-shaped bloom",
        "Large, trumpet-shaped white flower",
        "Generally white to very pale color in the flower",
        "Broad, dark green, heart-shaped leaves"
    ],
    "fire lily": [
        "Funnel or trumpet-shaped flowers",
        "tubular or trumpet-shaped flowers",
        "Petals with recurved or reflexed tips (bending backward)",
        "Flowers with a star-like or funnel shape",
        "Blossoms that have a slightly flame-like appearance"
    ],
    "pincushion flower": [
        "Typically available in shades of blue, purple, pink, or white",
        "Usually purples, pinks, or blues in color",
        "Broad, often waxy petals",
        "Often found in shades of blue, lavender, or white",
        "Mostly seen in shades of lavender, blue, and pink"
    ],
    "fritillary": [
        "bell-shaped flowers",
        "Bell-shaped flowers",
        "Fritillaries (flowers) have a checkered or mottled pattern on the petals ",
        "Distinctive checkered or patterned petals",
        "Bell-shaped or nodding flowers"
    ],
    "red ginger": [
        "Pyramidal or conical flower shape",
        "Bright red, cone-shaped flower spikes",
        "Cone-shaped flower head",
        "Tropical, lush surrounding environment",
        "Bright red, cone-shaped flower heads"
    ],
    "grape hyacinth": [
        "Bell-shaped or urn-shaped flowers",
        "Flowers arranged in a dense spike",
        "Flowers arranged along a central stalk",
        "Flowers arranged tightly along a single stalk",
        "Cone-shaped flower clusters"
    ],
    "corn poppy": [
        "Red or bright-colored petals (often red with black centers)",
        "Petal shape: Corn poppy petals are more rounded, whereas Californian poppy petals tend to be more elongated and delicate.",
        "Clear red petals",
        "often found in fields and meadows",
        "bright red petals"
    ],
    "prince of wales feathers": [
        "Brightly colored, clustered flowers",
        "trumpet-shaped flowers",
        "multiple small blooms",
        "Brightly colored flowers (orange, blue, white)",
        "Tall, stiff flower spikes with flowers opening from bottom to top"
    ],
    "stemless gentian": [
        "Grows close to the ground, often in alpine or mountainous areas",
        "Habitat: Stemless gentians often grow in mountainous or alpine regions, frequently in rocky or sandy soils.",
        "Alpine, rocky, or grassland habitat",
        "Typically found in alpine and subalpine regions",
        "typically found in alpine or subalpine regions"
    ],
    "artichoke": [
        "Thistle-like appearance when in bloom",
        "Absence of brightly colored petals typical of cape flowers",
        "Thistle-like appearance",
        "delicate, poppy-like blooms",
        "Large, edible flower buds"
    ],
    "sweet william": [
        "Vibrant colors, often with a darker \"eye\" in the center",
        "Varied and vibrant colors (often bi-colored or multi-toned)",
        "Sweet William flowers come in a variety of colors including red, pink, white, and bicolor.",
        "Often bright, patterned petals",
        "petal patterns (sweet william has distinct, often bi-colored patterns)"
    ],
    "carnation": [
        "Petal shape (rounded and dense for carnations)",
        "Frilly and ruffled petal edges",
        "Frilled or ruffled petal edges",
        "Number of petals (carnations have more layers of petals)",
        "ruffled and frilled petals"
    ],
    "garden phlox": [
        "Flowers commonly in shades of pink, white, or purple",
        "Flowers in shades of pink, purple, white, or red",
        "Typically vibrant pink, purple, or white colors",
        "Color variety limited to white, pink, red, purple, blue, or lavender",
        "Variety of colors including pink, white, red, and purple"
    ],
    "love in the mist": [
        "Typically blue or white petals (though other colors can occur)",
        "Star-shaped or spiky petals",
        "Typically blue, white, or purple flowers",
        "Blue, white, or purple flowers",
        "star-shaped flower with numerous stamens"
    ],
    "mexican aster": [
        "Brightly colored petals, often in shades of pink, purple, red, or white with a yellow center",
        "Brightly colored petals, often pink, purple, or white",
        "Color: Mexican asters typically come in shades of pink, purple, and white, while gazanias are more vibrant with colors like orange, yellow, and red.",
        "Usually smaller, daisy-like flowers",
        "daisy-like flower shape"
    ],
    "alpine sea holly": [
        "Flower color: Alpine sea holly flowers are often blue or purple, while globe thistle flowers tend to be a consistent shade of blue or purple.",
        "Flower head: The flower head of an alpine sea holly is generally more cylindrical or oval, whereas a globe thistle typically has a round, globe-like flower head.",
        "Stems: Alpine sea holly often has thinner, more rigid stems, while sunflower stems are thicker and can grow quite tall.",
        "spiky, blue or purple bracts",
        "Flower shape: Alpine sea holly has spiky, thistle-like flowers, whereas sunflowers have large, round, disc-like flower heads."
    ],
    "ruby-lipped cattleya": [
        "Flower coloration mostly in shades of pink, white, and purple",
        "orchid shape",
        "prominent, large, and fragrant flowers",
        "single large flower per stem",
        "vibrant colors often including pink, purple, and white"
    ],
    "cape flower": [
        "Petals with a more delicate and elongated shape",
        "Multiple stems with flowers per plant (Cape flowers often grow in clumps)",
        "Bright, vibrant colors such as pink, purple, or red",
        "typically more delicate and ornate overall appearance",
        "Typically lighter and more airy appearance compared to roses"
    ],
    "great masterwort": [
        "Umbel-shaped flower head",
        "Pink or white bracts surrounding the flower head",
        "Flowers are usually shades of white, pink, or red with a central cluster of smaller florets",
        "Pink, white, or greenish colored flowers",
        "Compound umbels (clusters of small flowers) as opposed to a single flower head"
    ],
    "siam tulip": [
        "Typically found in tropical climates, often in wetlands",
        "Plant grows on land, not in water",
        "Pink to purple bracts (upper leaves)",
        "Aquatic environment, growing in ponds or lakes",
        "Typically smaller, solitary flowers"
    ],
    "lenten rose": [
        "Flowers with a nodding habit, typically facing downwards",
        "Bloom Time: Lenten roses (Helleborus) typically bloom in late winter to early spring, while Japanese anemones usually bloom in late summer to autumn.",
        "Multiple flowers per stem",
        "No tubular, bell-shaped flowers (which are characteristic of foxgloves)",
        "large, nodding flowers"
    ],
    "barbeton daisy": [
        "Brightly colored flowers (often red, pink, orange, or yellow)",
        "Bright, vibrant petals (often red, pink, orange, or yellow)",
        "Solid, bright colors such as red, orange, pink, or yellow",
        "Bright and vibrant colors (typically red, pink, yellow, or orange for Barberton daisy)",
        "Brightly colored petals (often red, pink, orange, or white)"
    ],
    "daffodil": [
        "Linear or strap-shaped leaves",
        "Bloom typically in early spring or late winter",
        "Grown typically in well-drained soil, often in gardens or meadows, not water-based environments",
        "slender, elongated leaves",
        "Linear, strap-like leaves"
    ],
    "sword lily": [
        "gladiolus-style flower spikes",
        "Typically large and brightly colored flowers",
        "typically larger, more prominent blooms",
        "Multiple blooms arranged along the spike",
        "Blooms are tubular or funnel-shaped"
    ],
    "poinsettia": [
        "Seasonal appearance, often seen around winter holidays",
        "Green foliage surrounding the colorful bracts",
        "Brightly colored bracts (often red, but can be white, pink, or other colors)",
        "Frequently grown indoors during winter, especially around Christmas",
        "Common association with holiday decorations, especially Christmas"
    ],
    "bolero deep blue": [
        "**Flower Color**: Bolero Deep Blue typically has deep blue or purple flowers, while Silverbush often has white or light-colored flowers.",
        "flower shape: Bolero deep blue typically has a rose-like, fuller shape whereas Morning glory has a trumpet-like shape.",
        "Lack of prominent central stamens (as in globe-flowers)",
        "color consistency: Bolero deep blue maintains a consistent rich deep blue shade, whereas Morning glory colors can vary even within a single bloom, often showing gradients.",
        "deep blue or purple petals"
    ],
    "wallflower": [
        "Typically bright orange or yellow flowers",
        "Color variations (wallflowers commonly come in shades of yellow, orange, purple, and red, whereas buttercups are typically bright yellow)",
        "Typically bright colors such as yellow, orange, red, or purple",
        "Bright, often yellow or orange flowers",
        "Clusters of bright, vibrant flowers (often in shades of yellow, orange, or red)"
    ],
    "marigold": [
        "Compact, rounded flower heads",
        "Marigold flower heads are generally more spherical and compact than wallflowers",
        "Bushy, globe-like flower head",
        "Plant's height and overall bushy appearance",
        "Bright, yellow or orange flowers"
    ],
    "buttercup": [
        "Bright yellow coloration",
        "Typically smaller and more compact growth habit",
        "Cup-shaped flower structure",
        "Typically smaller and simpler flower structure",
        "Petal color (Buttercups are usually bright yellow, while Marigolds can range from yellow to orange and even red)"
    ],
    "oxeye daisy": [
        "Round, flat flower shape",
        "More oval-shaped petals",
        "flowers can be double or semi-double, with multiple layers of petals",
        "Petals are typically more rounded and uniform",
        "Longer, narrower petals"
    ],
    "common dandelion": [
        "Bright yellow flower head",
        "bright yellow single flower head",
        "Yellow, single composite flower head",
        "Bright yellow flower heads comprised of numerous tiny florets",
        "Yellow, composite flower head made of many small florets"
    ],
    "petunia": [
        "trumpet-shaped flowers with ruffled edges",
        "Often seen in garden beds or hanging baskets",
        "Wavy or slightly ruffled petals",
        "Rounded or funnel-shaped flowers",
        "sticky or hairy leaves and stems"
    ],
    "wild pansy": [
        "less central disc; the center of a wild pansy is small and often dark",
        "Rounded, short stems",
        "Tri-color petals, typically violet, white, and yellow",
        "Flower colors such as purple, yellow, and white",
        "Smaller size and more delicate appearance compared to pocket orchids"
    ],
    "primula": [
        "Flower shape: Primulas typically have more symmetrical, star or bell-shaped flowers, while geraniums have more irregular, bilateral symmetrical flowers.",
        "Flower colors typically range in shades of white, yellow, pink, red, blue, and purple",
        "Flowers often have five petals",
        "Shorter stems compared to windflowers",
        "Flowers typically have five petals"
    ],
    "sunflower": [
        "central brown or dark disk (disk florets)",
        "Large, dark central disk (floret arrangement)",
        "Disk color is usually brown or green",
        "large, round flower head",
        "Large, round flower head"
    ],
    "pelargonium": [
        "Rounded, lobed or slightly serrated leaves",
        "Rounded or lobed leaves",
        "Solitary flowers on individual stems",
        "Rounded, lobed leaves",
        "Rounded or kidney-shaped leaves with serrated edges"
    ],
    "bishop of llandaff": [
        "Part of the Dahlia family",
        "Part of the dahlia family, typically displaying more pointed petals",
        "Dahlia-type bloom shape",
        "dahlia-shaped blooms (multi-layered petals)",
        "Dahlia flower structure"
    ],
    "gaura": [
        "Leaves that are narrow and lance-shaped",
        "four petals per flower",
        "Long, thin flower stems",
        "Four petals on flowers",
        "Narrow, lance-shaped leaves"
    ],
    "geranium": [
        "absence of long, narrow leaves typically seen in Mexican Petunias",
        "Typically bright colors such as pink, red, or white",
        "Flower colors typically in shades of red, pink, white, or purple",
        "often bright colored (red, pink, purple, white)",
        "Geranium flowers typically have a slightly asymmetrical petal arrangement"
    ],
    "orange dahlia": [
        "Symmetrical flower head without a distinct central disk",
        "Foliage with broad, pointed leaves ",
        "Dark green, toothed leaves ",
        "Thick, upright green stems",
        "Dense, rounded flower heads"
    ],
    "pink-yellow dahlia": [
        "lush, smooth green foliage",
        "Dark green, deeply lobed leaves",
        "Leaf shape: Dahlia leaves are usually broader and more oval, whereas blanket flowers have narrower and more lance-shaped leaves.",
        "Leaves that are more oval-shaped and less lobed",
        "Decorative, ornamental garden plant appearance"
    ],
    "cautleya spicata": [
        "bright red and yellow petals",
        "Flower color often including shades of red, yellow, or orange",
        "Flowers typically vary in shades of red, orange, or yellow",
        "Brightly colored bracts that partially cover the flowers",
        "Reddish bracts around the flowers"
    ],
    "japanese anemone": [
        "petal shape (Japanese anemones generally have oval or rounded petals, while corn poppies have more papery and crinkled petals)",
        "growth habit (Japanese anemones grow in clumps or clusters, often on long stems, whereas corn poppies grow individually or in smaller groups closer to the ground)",
        "petal count (Japanese anemones tend to have more petals, usually 5-20, whereas corn poppies typically have 4 petals)",
        "Broad, flat petals",
        "flower height (Japanese anemones generally grow taller and more upright, while corn poppies are shorter and more delicate)"
    ],
    "black-eyed susan": [
        "Dark brown or black center (disk florets)",
        "Dark brown or black central disk",
        "Central dark brown or black cone in the middle",
        "Petal shape: narrower and more elongated",
        "dark, round center (often dark brown or black)"
    ],
    "silverbush": [
        "Flowers with five petals (simple structure)",
        "Flower color and shape",
        "Small, tubular flowers, usually white or lavender",
        "Five-petaled flowers",
        "Flowers typically white or light-colored"
    ],
    "californian poppy": [
        "Simple, cup-shaped flowers",
        "Central conical or flat-topped disk",
        "Cup-shaped flowers",
        "Delicate, cup-shaped flowers",
        "Larger, white or creamy yellow petals"
    ],
    "osteospermum": [
        "Flower disc can range in color (purple, blue, white, yellow)",
        "Petals that can be a variety of colors (including purple, pink, white, or yellow)",
        "Variety of petal colors (often white, purple, or pink)",
        "Dark central disc (often purple or blue) ",
        "Leaves are typically narrow and elongated"
    ],
    "spring crocus": [
        "Leaf structure: Spring crocus leaves are narrow and grass-like, often with a central white stripe. Siam tulip leaves are broader and more lance-shaped.",
        "Flowers come in various colors including purple, white, yellow, and striped",
        "Color: Spring crocuses are often found in shades of purple, white, or yellow, while tiger lilies typically have a bright orange color with dark spots.",
        "Absence of a trumpet-shaped corona at the center",
        "Flower height: Spring crocus flowers are generally shorter (around 4-6 inches). Siam tulip flowers are taller, reaching up to 2 feet."
    ],
    "bearded iris": [
        "Large, showy flowers with multiple petals",
        "Flowers are often larger and more flamboyant in appearance",
        "Petticoat-like shape of the blooms",
        "Often has a floral scent varying from sweet to spicy",
        "Wide range of colors, not exclusively yellow"
    ],
    "windflower": [
        "Star-shaped flower heads",
        "windflowers have a more natural, woodland appearance",
        "often found in woodland or meadows",
        "Grows on land, typically in woodlands or meadows",
        "windflower generally has smaller, more delicate flowers"
    ],
    "tree poppy": [
        "White petals (tree poppies typically have white petals)",
        "White petals",
        "Large, papery flowers",
        "Large, crinkled petals",
        "Larger flowers (typically around 3-4 inches in diameter)"
    ],
    "gazania": [
        "Central dark brown or black dome-shaped disk",
        "Dark, central disk (can be black or dark brown)",
        "Central disk that is typically yellow or orange but can vary",
        "Central disk size and appearance",
        "Bright yellow or orange petals"
    ],
    "azalea": [
        "Flowers often appear in shades of pink, red, white, or purple",
        "Usually comes in shades of pink, red, purple, and white",
        "Tubular or funnel-shaped blossoms",
        "large, bowl- or star-shaped flowers",
        "Five-petaled flowers"
    ],
    "water lily": [
        "often white or pink flowers",
        "Flowers with multiple petals radiating outward, often in white, pink, or yellow",
        "Flowers often sitting on the water surface",
        "Varied and bright colors such as white, pink, yellow, or blue",
        "flowers with colors like white, pink, or yellow"
    ],
    "rose": [
        "distinct, strong fragrance (although this cannot be observed through a photo, it often relates to the overall appearance of the rose)",
        "Color variety (roses come in a wide range of colors, while silverbush typically has white or light-colored flowers)",
        "typically lacks the strong fragrance found in traditional roses",
        "classic rose shape",
        "Flower size (roses tend to have larger blooms)"
    ],
    "thorn apple": [
        "Large, trumpet-shaped white or purple flowers",
        "white or light purple blooms",
        "white or purple trumpet-shaped flowers",
        "typically white or pale-colored flowers",
        "Star-shaped white or light purple flowers"
    ],
    "morning glory": [
        "Varied flower colors such as blue, purple, pink, or white",
        "Color variations typically in blue, purple, pink, or white petals",
        "Purple, blue, pink, or white blossoms",
        "Solid, vibrant colors (often blue, purple, or pink)",
        "vibrant colors such as blue, purple, or pink"
    ],
    "passion flower": [
        "typically seen with vine-like growth habit",
        "color patterns with typically purple, blue, or white hues",
        "flowers come in various colors, often with a combination of whites, purples, and blues",
        "Leaves are typically lobed with a deep green color",
        "Usually a vibrant mix of colors, often including purple, blue, white, and pink "
    ],
    "lotus lotus": [
        "Flowers typically pink, white, or yellow",
        "Flowers commonly pink or white with a prominent central yellow part",
        "typically pink or white petals",
        "Flower colors typically include shades of pink, white, or yellow",
        "Petals ranging from pink to white"
    ],
    "toad lily": [
        "Star-like flower shape",
        "Larger, rounder and more prominent blooms",
        "Bell-shaped, tubular flowers",
        "Star or bell-shaped flowers",
        "Tepal arrangement with six distinct tepals"
    ],
    "anthurium": [
        "Often found with a single flower per stem",
        "Smaller, more compact flower structure",
        "Lack of layered petals",
        "Arrow-shaped leaves",
        "Glossy, brightly colored spathes (often red)"
    ],
    "frangipani": [
        "Multiple colors (often white, yellow, pink, or red)",
        "Typically, white, yellow, or pink coloration",
        "Broad, elliptic leaves with a smooth or slightly undulated edge",
        "creamy white, pink, or yellow petals",
        "less vibrant colors (often white, pink, or purple)"
    ],
    "clematis": [
        "Overall shape of the flower: Clematis flowers typically have a star or bell shape, while hibiscus flowers are more trumpet-shaped.",
        "star-shaped, large flowers",
        "Large, showy petals often with a broad, open shape",
        "Size of blossoms: Hibiscus flowers are generally larger, often between 4 to 12 inches in diameter, whereas clematis flowers are usually smaller, often between 2 to 6 inches in diameter.",
        "Use in decor: Clematis is often used in garden trellises and outdoor settings, whereas poinsettias are popular as indoor holiday plants during the winter season."
    ],
    "hibiscus": [
        "large, trumpet-shaped flowers",
        "Large, trumpet-shaped flowers",
        "Bright, vibrant colors (such as red, pink, yellow, or white)",
        "Typically larger blooms, often 4 to 10 inches in diameter",
        "Floral color commonly seen in red, pink, yellow, or white"
    ],
    "columbine": [
        "Five backward-pointing petal spurs",
        "flower shape",
        "Five petal-like sepals",
        "Commonly found in woodland or mountainous areas",
        "Nodding (downward-facing) flowers"
    ],
    "desert-rose": [
        "vibrant pink, red, or white flowers with a tubular shape",
        "Bright pink or red flowers with five petals",
        "bright, tubular flowers often in shades of pink or red",
        "Blooms in bright colors, often pink or red",
        "cluster of bright, tubular flowers typically in pink, red, or white"
    ],
    "tree mallow": [
        "Flower color: Tree mallow flowers are typically pink, mauve, or white, whereas Mexican petunia flowers are often purple or blue.",
        "Frequently blooms in clusters with a variety of colors, typically pink, purple, or mauve",
        "Flower color often pink or purple",
        "Five-petaled flowers, often in shades of pink, purple, or white",
        "Flowers in shades of pink, purple, or white"
    ],
    "magnolia": [
        "Flower structure (magnolia flowers are tulip-shaped or star-shaped; daffodils have trumpet-shaped central coronas with outer perianth segments)",
        "Color range (magnolia flowers can be white, pink, purple, or yellow; daffodils are usually yellow or white)",
        "Typically white, pink, or purple blooms",
        "Bloom orientation (magnolias generally have upright flowers; daffodils' flowers nod or face slightly downward)",
        "Color variation: Magnolias commonly have white, pink, or purple flowers, whereas lotus flowers are often pink or white."
    ],
    "cyclamen": [
        "season of bloom (cyclamen often bloom in winter)",
        "Flower shape (nodding or reflexed petals)",
        "Reflexed petals (bent backward towards the stem)",
        "flowers with reflexed petals (bent backward)",
        "Typically blooms in the fall or winter"
    ],
    "watercress": [
        "Flower type",
        "bright yellow flowers with five shiny petals (for buttercup)",
        "Absence of large, showy flowers",
        "Clustered bright flowers, usually in red, pink, purple, or white",
        "absence of a water body in the immediate vicinity (for buttercup)"
    ],
    "canna lily": [
        "Flowers may have a crinkled or ruffled appearance",
        "Flowers with asymmetrical petals and a ruffled appearance",
        "flowers with overlapping petals and a more tropical appearance",
        "Brightly colored flowers, often in shades ranging from red to orange, yellow, or pink",
        "Brightly colored, large, open flowers with multiple, often wavy or irregular petals"
    ],
    "hippeastrum": [
        "Flower color patterns",
        "Typically blooms in winter or early spring when grown indoors",
        "Typically blooms indoors during winter or early spring",
        "Flower color variations",
        "large trumpet-shaped flowers"
    ],
    "bee balm": [
        "Bright pink, red, or purple blooms",
        "Spiky, elongated flower shapes",
        "Typically red, pink, or purple flowers",
        "Flowers bloom at the top of the stems in multiple whorls",
        "striking, often brightly colored central rosette of leaves"
    ],
    "ball moss": [
        "Lacks bright, vibrant flowers (compared to sweet pea)",
        "Lack of vibrant, prominently displayed flowers",
        "absence of large petals",
        "Lack of vibrant flowers",
        "Lack of a central floral stem"
    ],
    "foxglove": [
        "tubular or bell-shaped flowers",
        "Tubular or bell-shaped flowers",
        "tubular, bell-shaped flowers",
        "Tubular, bell-shaped flowers",
        "bell-shaped flowers"
    ],
    "bougainvillea": [
        "Small, tubular white or yellow flowers inside the bracts",
        "Smaller, true flowers inside the bracts",
        "Oval or heart-shaped leaves with a pointed end",
        "Leaves are usually ovate, green, and slightly hairy",
        "Smaller, true flowers that are usually white and at the center of the bracts"
    ],
    "camellia": [
        "blooms usually appear in late winter to early spring",
        "Typically bloom in the late winter to early spring",
        "Compact size, often seen as shrubs or small trees",
        "Flowers typically bloom in winter or early spring",
        "shrub form with dense foliage"
    ],
    "mallow": [
        "Central column of fused stamens (staminal column)",
        "Prominent central stamen column in the flowers",
        "presence of a prominent central boss (group of stamens) in the flower",
        "Five distinct petals often forming a characteristic funnel shape",
        "Possible presence of small, round seedpods around the base of the flower"
    ],
    "mexican petunia": [
        "Long, narrow, lance-shaped leaves",
        "long, narrow, lance-shaped leaves",
        "Generally found in warmer, humid climates",
        "typically grows in a shrub-like or bushy form",
        "Herbaceous plant with woody stems"
    ],
    "bromelia": [
        "Brightly colored bracts, often red, pink, or orange",
        "flowers bloom at night and have a fragrant scent",
        "presence of water-holding central cups",
        "vibrant central rosette",
        "flowers growing directly from the rosette"
    ],
    "blanket flower": [
        "Central disc with red or dark brown color",
        "Central disc (flower head) is more dome-shaped and can have a mixture of red, orange, and yellow hues",
        "Often a vibrant, two-toned color pattern",
        "Central disc is typically dark red or brownish",
        "Shorter, more compact flower shape"
    ],
    "trumpet creeper": [
        "Orange or red flower color",
        "Typically orange to red flower color",
        "Orange to red flower color",
        "Orange to red flowers",
        "orange or reddish color of flowers"
    ],
    "blackberry lily": [
        "Star-like flower shape",
        "star-shaped flowers (blackberry lily)",
        "Six petals each with a distinct shape",
        "Six petals",
        "Star-shaped flowers with six petals"
    ]
}