{
    "Abyssinian": [
        "More contrast in coat pattern with a wild appearance",
        "long tail",
        "Ticked tabby pattern",
        "Sleek and graceful appearance",
        "Rosetted or marbled coat patterns",
        "Short, ticked coat",
        "Sleek, short coat with a ticked pattern",
        "large pointed ears",
        "Tail with a tapered end",
        "Thick fur coat",
        "Graceful and elegant body"
    ],
    "Bengal": [
        "Wrinkled appearance",
        "Muscular build",
        "More muscular and athletic build",
        "Pointed ears",
        "sleek, muscular build",
        "smaller size compared to a dog",
        "Prominent cheekbones",
        "Sleek, muscular body",
        "Strong, muscular body",
        "Sleek and lean body build",
        "Rounded ears",
        "Larger size compared to a chihuahua",
        "Short, shiny coat",
        "Hairless skin",
        "short, sleek coat with a distinctive spotted or marbled pattern",
        "Large ears",
        "muscular body and slender build",
        "Pointed ears with rounded tips",
        "Rosetted spots or horizontal stripes",
        "Overall golden or brownish hue"
    ],
    "Birman": [
        "A Birman generally displays a calm, serene demeanor, while a boxer often has a more energetic and playful appearance.",
        "A Birman has a long, silky coat, whereas a boxer has short, smooth fur.",
        "A Birman is a cat with a slender, graceful body, compared to a boxer's muscular, robust canine build.",
        "slender physique compared to the Keeshond's more robust and fluffy appearance",
        "Birmans have a bushy tail, whereas boxers have a shorter, more straight tail.",
        "Birmans have distinctive blue eyes, while boxers have dark brown eyes.",
        "Birmans typically have a pointed color pattern, with darker fur on the face, ears, paws, and tail, unlike boxers who usually have a solid or brindle coat with possible white markings.",
        "typically larger size compared to a Pomeranian",
        "Stocky and muscular body"
    ],
    "Bombay": [
        "Medium-sized, rounded ears",
        "Large, pointed ears",
        "Rounded head and short muzzle (Bombay)",
        "rounded head with a short muzzle",
        "Round head",
        "Round, copper or gold eyes (Bombay)",
        "Heavy bone structure (Newfoundland)",
        "Light-colored body with darker points (ears, face, paws, tail)",
        "Sharp, pointed ears",
        "Rounded head with a shorter nose",
        "Long, wedge-shaped head",
        "Wide-set, round eyes, typically gold or copper",
        "tail shape",
        "Sleek, short black coat (Bombay)",
        "Copper or gold eyes",
        "bright, round, copper or gold eyes",
        "copper or gold eye color",
        "Muscular and medium-sized body",
        "Black coat",
        "Short, glossy coat"
    ],
    "British Shorthair": [
        "**German Shorthaired Pointer**:",
        "Typically medium to large size but smaller compared to an American Bulldog",
        "Calm and reserved demeanor in appearance",
        "Longer legs and more pronounced muscles",
        "Dog-like body structure",
        "Medium to long, silky fur",
        "Generally calm and reserved demeanor in photos",
        "Shorter legs",
        "Short nose",
        "Sturdy, muscular build",
        "Short, dense coat with a plush feel"
    ],
    "Egyptian Mau": [
        "Spotted coat",
        "spotted coat",
        "Smaller, cat-like body",
        "Ears: Egyptian Maus generally have large, pointed ears, whereas German Shorthaired Pointers have medium to large, floppy ears.",
        "Slender, agile frame",
        "Whisker Pads: Egyptian Maus have pronounced whisker pads.",
        "Large ears set wide apart",
        "Slender, agile body",
        "a muscular, medium-sized body",
        "Ears are relatively large and pointed",
        "Slightly longer hind legs",
        "Stocky, muscular body",
        "Spotted coat pattern",
        "Behavior: Egyptian Maus are often poised and can exhibit a unique 'tiptoe' walking gait that is distinct compared to the gait of a German Shorthaired Pointer.",
        "Solid or classic tabby coat patterns rather than spotted",
        "Slightly longer hind legs compared to front legs",
        "Banding on legs and tail",
        "Longer hind legs compared to the front legs",
        "Longer tail relative to body size"
    ],
    "Maine Coon": [
        "Graceful, feline posture and movement",
        "Full, fluffy coat",
        "high cheekbones",
        "Sleek, flexible body typical of a cat",
        "strong, muscular build"
    ],
    "Persian": [
        "Pointed ears",
        "flat face",
        "Stocky build with short legs",
        "Small size",
        "absence of a snout",
        "smaller size",
        "rounded face",
        "Short nose",
        "short nose",
        "Cat-like paw structure"
    ],
    "Ragdoll": [
        "Smaller size and build compared to a dog",
        "Tail: Ragdolls have a long, fluffy tail, whereas Newfoundlands have a thick, bushy tail often carried low. ",
        "Facial structure: Ragdolls have a more delicate and feline facial structure with a distinct nose shape, whereas Newfoundlands have a robust canine face.",
        "Body shape: Ragdolls have a long, lean, and flexible body, contrasting with the Newfoundland’s broad, bulky, and muscular build.",
        "Size: Ragdolls are much smaller compared to the large Newfoundland dogs.",
        "Larger and more muscular body",
        "Color patterns: Ragdolls come in various color patterns like colorpoint, mitted, and bicolor, while Newfoundlands are typically solid black, brown, grey, or Landseer (black and white).",
        "Larger size and muscular build",
        "typically cropped or naturally floppy ears",
        "muscular, stocky build",
        "Facial structure: Ragdolls have a more wedge-shaped face with a soft expression, while Bombays have a more rounded face with a shorter muzzle.",
        "tendency to lie limp when picked up",
        "Body structure: Ragdolls have a more muscular and semi-longer body, whereas Bombays have a more compact and muscular build.",
        "Fur texture: Ragdolls generally have soft, semi-long fur, while Newfoundlands have dense, water-resistant, and often longer fur."
    ],
    "Russian Blue": [
        "Whisker pads giving a slightly smiling expression ",
        "Relatively reserved or shy demeanor in photos",
        "More likely to be on elevated surfaces (like furniture) ",
        "Cat-like facial features"
    ],
    "Siamese": [
        "Prominent, triangular-shaped head with large ears",
        "erect, large ears",
        "Prominent, large ears",
        "large, pointed ears",
        "Large, pointed ears",
        "triangular head with large ears",
        "short, sleek coat",
        "Short, sleek coat",
        "darker points on the ears, face, paws, and tail",
        "darker points on ears, face, paws, and tail",
        "sleek and agile appearance",
        "Vocal and sociable behavior",
        "triangular-shaped head",
        "wedge-shaped head",
        "Triangular face shape",
        "Muscular and athletic build",
        "Short, fine coat with minimal shedding",
        "short, fine coat",
        "Short, fine coat",
        "triangular head shape"
    ],
    "Sphynx": [
        "Large ears",
        "Large, bat-like ears",
        "Slender build: Sphynx cats have a lean, muscular frame, unlike the stockier build of pugs.",
        "Tail: A Sphynx cat has a long, thin, tapering tail, compared to the proportionally shorter, thicker tail of an American Pit Bull Terrier.",
        "Prominent, large ears",
        "Prominent ears: Sphynx cats have large, bat-like ears which are more prominent in comparison to the smaller, folded ears of pugs.",
        "Size: Sphynx cats are generally much smaller in stature compared to Boxers, which are medium to large-sized dogs.",
        "Tail: Sphynx cats have long, tapered tails, whereas Boxers have shorter tails that are often docked.",
        "Large, pointed ears",
        "Lack of fur or very short fur",
        "Cat-like facial features (such as whiskers and cat eyes)",
        "Whisker pads: Sphynx cats have pronounced whisker pads, whereas pugs typically do not.",
        "Hairlessness: Sphynx cats are distinctly hairless, while pugs have a short, fur-covered coat.",
        "Ear shape: Sphynx cats have large, bat-like ears, while Boxers have smaller, rounded ears that may be cropped.",
        "Ear Size: Sphynx cats have large ears in proportion to their head, compared to the smaller, proportional ears of American Pit Bull Terriers.",
        "Hairlessness: Sphynx cats are known for their lack of fur, whereas Boxers have a short, tight-fitting coat of fur.",
        "Long, whip-like tail",
        "Skin color may be pink or have spots, whereas a Russian Blue has a solid blue-gray coat",
        "Hairlessness or very fine, short coat",
        "Hairlessness: Sphynx cats are known for their lack of fur, while American Pit Bull Terriers have a coat of short fur."
    ],
    "american bulldog": [
        "Tail: American Bulldogs usually have a thicker, longer tail that tapers, while Staffordshire Bull Terriers often have a shorter tail.",
        "Body: American Bulldogs tend to have a stockier and more robust build.",
        "Muzzle: The American Bulldog has a longer and more prominent muzzle, while Staffordshire Bull Terriers have a shorter muzzle.",
        "Coat: Both breeds have a short coat, but American Bulldogs may have a more varied coat pattern, whereas Staffordshire Bull Terriers often have a more uniform coat.",
        "Size: American Bulldogs are generally larger and more muscular.",
        "Tail type: American Bulldogs typically have a straight, tapered tail, whereas Saint Bernards often have a bushy tail.",
        "Ears: American Bulldogs often have ears that are semi-pricked, while Staffordshire Bull Terriers typically have smaller, rose-shaped or half-pricked ears.",
        "Head Shape: American Bulldogs have a broader and more pronounced head.",
        "Short, sleek coat",
        "Drooping lips",
        "wider, more prominent head",
        "Often has a slightly undershot jaw",
        "generally larger size",
        "**Short coat:** American Bulldogs have a short and smooth coat, whereas Samoyeds have a long, fluffy coat.",
        "Typically a larger size",
        "more upright posture",
        "**Coat color:** American Bulldogs usually have a solid white or predominantly white coat sometimes mixed with patches of brown, brindle, or black. Samoyeds typically have a pure white or white and biscuit coat.",
        "Longer snout",
        "Strong, stocky legs",
        "Bulkier head"
    ],
    "american pit bull terrier": [
        "Coat: Both breeds have short coats, but the texture and sheen might slightly differ, with Pit Bulls often having a sleeker coat.",
        "Slender, elegant build",
        "Height: American Pit Bull Terriers usually stand taller (about 17-21 inches) compared to the Staffordshire Bull Terriers (about 14-16 inches).",
        "Less pronounced snout length compared to beagles",
        "Thick, fluffy, white coat",
        "Generally solid or brindle coat colors, often with white markings ",
        "Short, smooth coat that is often brindle or solid-colored",
        "Size: American Pit Bull Terriers are generally larger and taller than Staffordshire Bull Terriers.",
        "shorter coat",
        "Body: American Pit Bull Terriers have a leaner and more athletic build, while Staffordshire Bull Terriers are often more muscular and stocky.",
        "Bushy tail that curls over the back",
        "Tail: American Pit Bull Terriers have a longer, thinner tail, whereas Staffordshire Bull Terriers have a shorter, thicker tail.",
        "Solid color or brindle coat pattern",
        "Stockier stature",
        "Generally more energetic and alert demeanor",
        "Short and smooth coat",
        "Non-curled tail",
        "Snout: American Pit Bull Terriers tend to have a longer snout compared to the shorter, more compact snout of Staffordshire Bull Terriers.",
        "Tail that is thick at the base and tapers to a point",
        "Tail shape and length"
    ],
    "basset hound": [
        "Speckled or \"belton\" coat pattern",
        "Long body",
        "Long, droopy ears",
        "long, droopy ears",
        "Leaner, more elongated body compared to the boxer's muscular, stocky build",
        "Long body in proportion to height"
    ],
    "beagle": [
        "Long, fluffy coat",
        "Large, sturdy body",
        "Long, droopy ears",
        "long, droopy ears",
        "More compact and muscular body compared to a boxer's lean and tall frame",
        "sturdier build",
        "More muscular build",
        "Distinct hound-like appearance",
        "Fox-like appearance",
        "Leaner body structure",
        "Longer legs",
        "More athletic build",
        "Curly tail that tends to arch over the back",
        "short, smooth fur",
        "Smaller size",
        "more prominent chest",
        "shorter legs",
        "Compact, muscular body",
        "Longer ears",
        "longer ears"
    ],
    "boxer": [
        "Shorter coat",
        "Erect or semi-erect ears (typically cropped)",
        "a smaller, more compact body",
        "typically docked tail (though not always)",
        "Erect or cropped ears (often seen in boxers)",
        "Long, thick fur",
        "Full, bushy tail",
        "Sturdy, medium-sized body",
        "Taller stature",
        "Docked tail (in some regions)",
        "Short, tight coat",
        "Muscular and athletic build",
        "Tapered, docked tail (though it can vary)",
        "docked tail (often seen in boxers)",
        "Proportionately longer legs",
        "larger size",
        "Shorter, docked tail (in some cases)",
        "Pronounced chest and strong legs"
    ],
    "chihuahua": [
        "Smooth or long fur coat (different from the typically sleek coat of a Siamese cat)",
        "Proportionally larger head compared to body",
        "Short, smooth coat (though some chihuahuas have long hair, it's typically finer)",
        "Short, smooth coat (although some Chihuahuas have long hair)",
        "tendency to appear \"shivery\" or delicate",
        "Lack of pronounced muzzle",
        "lighter overall build",
        "short coat (though they can have long coats too)"
    ],
    "english cocker spaniel": [
        "Longer ears",
        "Longer body in proportion to height",
        "Feathered ears that hang lower",
        "Solid color or parti-color coat patterns, often with roan markings",
        "Larger size",
        "Long, wavy fur",
        "generally solid coat colors or roan patterns",
        "more compact body",
        "Generally larger size",
        "Feathery fur on legs and belly",
        "Smaller stature",
        "longer, wavy ears",
        "Longer, wavy ears",
        "Feathered coat",
        "Longer, more flowing fur",
        "More elevated stance",
        "Feathering on legs and tail",
        "Longer, wavy or curly fur",
        "Feathering on legs and ears",
        "Stocky, compact build"
    ],
    "english setter": [
        "Overall build: English Setters exhibit a leaner, more athletic build compared to the robust, muscular build of Saint Bernards.",
        "Size: English Setters are generally smaller and lighter compared to the much larger Saint Bernards.",
        "Head and facial structure: English Setters have a more refined and elongated head structure, while Saint Bernards have a broader, more massive head with a pronounced muzzle.",
        "Large and robust build",
        "Longer, drooping ears",
        "longer coat",
        "longer, more athletic build",
        "long, droopy ears",
        "leaner body",
        "longer, feathered coat"
    ],
    "german shorthaired": [
        "**British Shorthair**:",
        "Presence of a dog in the photo (German shorthaired is a dog breed, while Russian Blue is a cat breed)",
        "**Prominent cheekbones and a defined jawline**",
        "**Large, bat-like ears**"
    ],
    "great pyrenees": [
        "Ears: Great Pyrenees have medium-sized, rounded ears that tend to be flat against the head, whereas Ragdolls have pointed, upright ears.",
        "Coloring: Great Pyrenees are generally white or predominantly white with some patches, while Ragdolls have color point patterns with distinct markings on their face, ears, paws, and tail.",
        "Tail: Great Pyrenees have a thick, bushy tail, whereas Ragdolls have a long, fluffy tail.",
        "more slender body build",
        "Less defined musculature compared to a pit bull",
        "Predominantly white fur, potentially with patches of yellow, badger, or gray",
        "Body Shape: Great Pyrenees have a sturdy, muscular build, while Ragdolls have a more slender, elongated body.",
        "Muzzle: Great Pyrenees have a more pronounced, longer muzzle compared to the shorter, more refined muzzle of a Ragdoll.",
        "More prominent, muscular build",
        "More slender and graceful build",
        "Strong, muscular build",
        "Silky coat of medium length",
        "Fluffy, bushy tail often carried low or straight with slight curve",
        "Broad head with a gentle expression",
        "solid, muscular build",
        "Broad head with a relatively flat skull",
        "Broader head",
        "Eye Shape: Great Pyrenees typically have dark, almond-shaped eyes, while Ragdolls usually have large, oval-shaped blue eyes.",
        "Soft, rounded ears that can sometimes be feathered",
        "Dark eyes with almond shape"
    ],
    "havanese": [
        "lacks the long ears and droopy appearance of a basset hound",
        "Less pronounced drooping ears compared to the English Cocker Spaniel",
        "large, muscular body",
        "long, shaggy coat",
        "Tail curled over the back, covered in long hair",
        "Long, flowing hair around the ears and face",
        "long, silky coat",
        "Long, silky coat",
        "Tail carried over the back but less fluffy compared to a Pomeranian's",
        "longer ears that hang down, covered in long fur",
        "Sturdier build",
        "Distinctive \"teddy bear\" appearance with a friendly expression",
        "Longer, silky hair",
        "Rounded ears with hair that often falls over them",
        "Sturdier and slightly larger build",
        "Tail often docked (in regions where this practice is legal)",
        "Plumed tail that curls over the back",
        "Larger size",
        "Dropped ears",
        "Longer muzzle"
    ],
    "japanese chin": [
        "Long, silky coat, often in black and white or red and white",
        "More \"pushed-in\" face",
        "Longer, silky coat that often looks more voluminous ",
        "Distinctive markings on the face, usually black and white or red and white",
        "Often a lively, alert expression"
    ],
    "keeshond": [
        "A keeshond has a fox-like face with a dark muzzle; a Ragdoll has a more rounded face.",
        "A keeshond has a curled, bushy tail that usually rests on its back; a Ragdoll has a long, fluffy tail.",
        "Small size",
        "Compact and sturdy body",
        "Tail: Keeshonds often have a tightly curled tail that rests on their back, whereas Samoyeds have a fluffy tail that curls less tightly.",
        "Compact body structure",
        "Smaller size",
        "fox-like face",
        "Fox-like face",
        "Coat color: Keeshonds have a distinctive grey, black, and cream-colored coat, whereas Samoyeds are typically pure white."
    ],
    "leonberger": [
        "Coat Color: Leonbergers typically have a brown or tan coat with black markings, especially around the face, while Great Pyrenees usually have a completely white or mostly white coat.",
        "Coat color: Leonbergers typically have a golden to reddish-brown coat, while Saint Bernards often have a white coat with red, black, or brindle spots.",
        "pointed, upright ears",
        "face: black mask on the face",
        "Distinct facial features of a dog",
        "Mask: Leonbergers usually have a distinct black mask around the face, whereas Saint Bernards may not have this feature or only have partial dark markings.",
        "Head shape: Leonbergers have a more rectangular head shape, while Saint Bernards have a broader, rounder head.",
        "Ear shape: Leonbergers have medium-sized, pendant ears that lie close to the head, while Saint Bernards have more rounded ears.",
        "Droopy, triangular ears",
        "Black mask around the face",
        "Black mask on the face",
        "Coat texture: Leonbergers have a dense, water-resistant double coat, while Saint Bernards have a thick, dense coat that can be either smooth or rough.",
        "Rectangular body shape",
        "face shape (Leonbergers have a more elongated face)",
        "Tail: Leonbergers have a tail that is usually carried low with a slight curve, while Saint Bernards have a tail that is thicker and may be carried more upward.",
        "Overall Appearance: Leonbergers generally have a more balanced and symmetrical appearance, whereas the Great Pyrenees often appear more rugged and rustic.",
        "Ears: Leonberger ears are medium-sized, triangular, and hang close to the head, whereas Great Pyrenees have smaller ears that are often carried more forward.",
        "Facial mask, often darker",
        "dog-like facial features",
        "Size: Both breeds are large, but the Leonberger is typically slightly larger and heavier compared to the Great Pyrenees."
    ],
    "miniature pinscher": [
        "Coat: Miniature Pinschers have a smooth, short, and glossy coat, typically in black, chocolate, or red, whereas Beagles have a denser, short coat in tricolor or bicolor patterns.",
        "**Color**: Miniature pinschers often come in colors such as black and tan, chocolate and tan, or solid red, while American pit bull terriers can be found in a variety of colors and patterns.",
        "**Tail**: Miniature pinschers typically have a docked tail that is quite short, while pit bull terriers usually have a thicker, medium-length tail.",
        "**Size**: Miniature pinschers are significantly smaller, usually weighing 8-12 pounds, while American pit bull terriers weigh between 30-60 pounds.",
        "**Proportions**: Miniature pinschers have a more slender and sleek body, while pit bulls are more muscular and stocky.",
        "**Facial Expression**: Miniature pinschers often have a keen and alert expression, reflecting their high energy levels and curiosity, while pit bull terriers have a more earnest and strong expression.",
        "**Ears**: Miniature pinschers often have cropped ears that stand erect or natural ears that fold over, while American pit bull terriers can have natural ears that are either cropped or left in their natural state.",
        "fur coat",
        "Proportionally longer legs compared to a cat",
        "**Head Shape**: Miniature pinschers have a more narrow and elongated head, while American pit bull terriers have a broader and more robust head.",
        "Expression: Miniature Pinschers often have a more alert, intense expression, while Beagles have a softer, more relaxed expression.",
        "**Coat**: Both breeds have short coats, but the miniature pinscher's coat is very smooth and glossy.",
        "short, sleek coat"
    ],
    "newfoundland": [
        "Overall dog-like appearance with a muscular build, contrasting a Persian cat's smaller, more delicate frame",
        "Droopy jowls and facial expression compared to a cat's more defined features",
        "Similar appearance to a miniature black panther",
        "Large size",
        "Large size, generally much larger than any cat",
        "Large, bushy tail",
        "Larger and more robust frame",
        "larger size",
        "Copper or gold eyes that are strikingly large and round",
        "Thick, double coat",
        "Large, robust body",
        "Gentle and soft expression in the eyes",
        "Drooping ears, often covered with long hair",
        "Droopy ears",
        "Smooth, glossy fur",
        "Proportionally longer and broader body",
        "Large, muscular body",
        "Large body size",
        "Broad head and strong neck",
        "Broad, muscular build"
    ],
    "pomeranian": [
        "Longer snout",
        "dense, fluffy coat",
        "absence of feline features (e.g., whiskers, cat-like eyes)",
        "fluffy, dense coat",
        "Fluffy, dense coat",
        "Rounded ears",
        "Shorter snout",
        "shorter snout",
        "typically a canine collar",
        "fluffy coat",
        "erect ears with more fur"
    ],
    "pug": [
        "Smooth, fine coat",
        "Smooth coat",
        "Curly tail",
        "a short, curly tail",
        "short, smooth fur"
    ],
    "saint bernard": [
        "Shorter coat varieties: Saint Bernards can have both short and long coat varieties, whereas Leonbergers typically have a long, straight, and dense double coat.",
        "Droopy jowls: Saint Bernards have more pronounced, droopy jowls compared to Leonbergers.",
        "Distinctive coat colors: Saint Bernards often have a white base coat with patches of brown, red, or brindle, especially on the back and sides.",
        "Coat color: Saint Bernards usually have a tricolor or bicolor coat with shades of white, brown, and black, while Great Pyrenees are often solid white or have very few markings.",
        "Ears: Saint Bernards have medium-sized, rounded ears that droop close to the head.",
        "Ears: Saint Bernards have medium-sized, high-set, and floppy ears.",
        "Barrel-like chest",
        "Droopy ears",
        "more narrow muzzle compared to the broader snout of a Newfoundland",
        "short or long coat but typically with distinct patches of color",
        "Short snout",
        "Barrel-shaped chest",
        "broad, powerful head with pronounced stop",
        "Stockier build compared to the sleeker samoyed",
        "Distinctive facial markings: Saint Bernards often have a dark mask or markings around their eyes and muzzle.",
        "Large, robust, and muscular body",
        "broad, squared muzzle",
        "Broad head",
        "Droopy eyes: Saint Bernards often have a more pronounced \"droopy\" appearance around their eyes.",
        "Long, bushy tail"
    ],
    "samoyed": [],
    "scottish terrier": [
        "a distinctive, wiry coat",
        "Long, wiry coat",
        "Wiry, coarse coat",
        "Compact, robust body shape",
        "Pointed ears"
    ],
    "shiba inu": [
        "presence of a snout and whiskers (Sphynx cats have a more defined and slender facial structure)",
        "overall build (Shiba Inus are more robust compared to the slender physique of a Sphynx cat)",
        "Pointed ears",
        "medium build with a sturdy and strong physique",
        "shorter, denser coat",
        "erect, triangular ears",
        "Erect, triangular ears",
        "larger, more robust build",
        "face shape (Shiba Inu has a fox-like face with triangular eyes)",
        "furry coat",
        "erect ears",
        "typically exhibit a fox-like appearance",
        "Distinctive markings (often with contrasting colors on the face, chest, and legs)",
        "Fox-like appearance",
        "compact, muscular body",
        "ears (Shiba Inu has small, erect, triangular ears)",
        "thick double coat with a soft undercoat"
    ],
    "staffordshire bull terrier": [],
    "wheaten terrier": [
        "Happy and friendly expression",
        "Friendly, alert expression",
        "A double coat, which may be either wavy or curly",
        "longer snout",
        "Dark, expressive eyes",
        "distinct beard and eyebrows",
        "Beard and mustache-like facial hair",
        "larger size",
        "Tendencies of being smaller and more compact",
        "Lack of undercoat (single coat, unlike the double coat of Havanese)"
    ],
    "yorkshire terrier": [
        "Silky, long coat",
        "Silky, shiny coat",
        "Silky, straight, and fine coat",
        "silky, long hair",
        "Long, silky coat",
        "Longer muzzle and facial hair",
        "Smaller, more delicate frame",
        "Long, silky, straight coat",
        "Round, dark eyes",
        "Coarser hair on the head and muzzle",
        "Erect, V-shaped ears",
        "tan and blue or black coat",
        "Sturdier build with a square profile",
        "Small size"
    ]
}