{
    "Abyssinian": [
        "Sleek and graceful appearance",
        "Rosetted or marbled coat patterns",
        "More contrast in coat pattern with a wild appearance",
        "long tail",
        "Tail with a tapered end",
        "Ticked tabby pattern",
        "Short, ticked coat",
        "Graceful and elegant body",
        "Short, sleek fur",
        "large pointed ears",
        "Sleek, short coat with a ticked pattern",
        "Prominent cheekbones",
        "Sleek, slender body"
    ],
    "Bengal": [
        "Pointed ears",
        "Wrinkled appearance",
        "Prominent cheekbones",
        "sleek, muscular build",
        "Muscular build",
        "More muscular and athletic build",
        "Pointed ears with rounded tips",
        "short, sleek coat with a distinctive spotted or marbled pattern",
        "smaller size compared to a dog",
        "Short, shiny coat",
        "Rosetted spots or horizontal stripes",
        "Rounded ears",
        "Sleek, muscular body",
        "Hairless skin",
        "Large ears",
        "Overall golden or brownish hue",
        "Strong, muscular body",
        "Markings on the legs and tail, including spots or bands",
        "Larger size compared to a chihuahua",
        "Distinctive coat pattern with spots or rosettes"
    ],
    "Birman": [
        "A Birman generally displays a calm, serene demeanor, while a boxer often has a more energetic and playful appearance.",
        "A Birman is a cat with a slender, graceful body, compared to a boxer's muscular, robust canine build.",
        "A Birman has a long, silky coat, whereas a boxer has short, smooth fur.",
        "slender physique compared to the Keeshond's more robust and fluffy appearance",
        "Birmans have a bushy tail, whereas boxers have a shorter, more straight tail.",
        "Birmans have distinctive blue eyes, while boxers have dark brown eyes.",
        "typically larger size compared to a Pomeranian",
        "Stocky and muscular body",
        "Birmans typically have a pointed color pattern, with darker fur on the face, ears, paws, and tail, unlike boxers who usually have a solid or brindle coat with possible white markings.",
        "lack of the double coat seen in Keeshonds",
        "overall feline anatomy rather than canine"
    ],
    "Bombay": [
        "Rounded head and short muzzle (Bombay)",
        "Medium-sized, rounded ears",
        "Heavy bone structure (Newfoundland)",
        "Large, pointed ears",
        "rounded head with a short muzzle",
        "Sharp, pointed ears",
        "Short, glossy coat",
        "Light-colored body with darker points (ears, face, paws, tail)",
        "Sleek, short black coat (Bombay)",
        "tail shape",
        "Black coat",
        "Boxer is a dog breed, typically recognized by its sturdy, medium-sized frame and expressive face.",
        "Absence of a fluffy tail and mane",
        "Round, copper or gold eyes (Bombay)",
        "Long, wedge-shaped head",
        "Round head",
        "Long, thin tail",
        "copper or gold eye color",
        "paw structure",
        "Large, muscular body (Newfoundland)"
    ],
    "British Shorthair": [
        "**German Shorthaired Pointer**:",
        "Typically medium to large size but smaller compared to an American Bulldog",
        "Longer legs and more pronounced muscles",
        "Calm and reserved demeanor in appearance",
        "Medium to long, silky fur",
        "Shorter legs",
        "Dog-like body structure",
        "Tail short and thick but tapering at the end",
        "Sturdy, muscular build",
        "Short, dense coat with a plush feel",
        "Generally calm and reserved demeanor in photos",
        "Short legs",
        "A strong and muscular build",
        "Short nose",
        "Dense, plush coat",
        "Dense, plush coat ",
        "Large, round eyes, often copper or gold in color"
    ],
    "Egyptian Mau": [
        "spotted coat",
        "Spotted coat",
        "Ears: Egyptian Maus generally have large, pointed ears, whereas German Shorthaired Pointers have medium to large, floppy ears.",
        "**Coat Pattern**: Egyptian Maus typically have a spotted coat pattern with distinctive, small to medium-sized spots. The Maine Coon's coat can be a variety of patterns but is often seen in tabby and has a full, long-haired appearance.",
        "Ears are relatively large and pointed",
        "Whisker Pads: Egyptian Maus have pronounced whisker pads.",
        "Smaller, cat-like body",
        "Large ears set wide apart",
        "Generally lighter coat color with silver, bronze, or smoke tones"
    ],
    "Maine Coon": [
        "Full, fluffy coat",
        "Graceful, feline posture and movement",
        "high cheekbones",
        "Sleek, flexible body typical of a cat",
        "Pointed, tufted ears",
        "Pointed ears with tufts of fur at the tips",
        "High cheekbones and a square muzzle"
    ],
    "Persian": [
        "Pointed ears",
        "absence of a snout"
    ],
    "Ragdoll": [
        "Smaller size and build compared to a dog",
        "Tail: Ragdolls have a long, fluffy tail, whereas Newfoundlands have a thick, bushy tail often carried low. ",
        "Facial structure: Ragdolls have a more delicate and feline facial structure with a distinct nose shape, whereas Newfoundlands have a robust canine face.",
        "Size: Ragdolls are much smaller compared to the large Newfoundland dogs.",
        "Larger and more muscular body",
        "Body shape: Ragdolls have a long, lean, and flexible body, contrasting with the Newfoundland’s broad, bulky, and muscular build.",
        "Color patterns: Ragdolls come in various color patterns like colorpoint, mitted, and bicolor, while Newfoundlands are typically solid black, brown, grey, or Landseer (black and white).",
        "Larger size and muscular build",
        "typically cropped or naturally floppy ears",
        "Facial structure: Ragdolls have a more wedge-shaped face with a soft expression, while Bombays have a more rounded face with a shorter muzzle.",
        "Slightly flattened nose",
        "muscular, stocky build",
        "Ears: Ragdolls have smaller, triangular, and pointed ears while Newfoundlands have larger, rounded, and hanging ears.",
        "Fur texture: Ragdolls generally have soft, semi-long fur, while Newfoundlands have dense, water-resistant, and often longer fur."
    ],
    "Russian Blue": [
        "More likely to be on elevated surfaces (like furniture) ",
        "Behavior typical of cats, such as climbing or perching"
    ],
    "Siamese": [
        "erect, large ears",
        "Prominent, triangular-shaped head with large ears",
        "Prominent, large ears",
        "large, pointed ears",
        "Large, pointed ears",
        "triangular head with large ears",
        "darker points on the ears, face, paws, and tail",
        "darker points on ears, face, paws, and tail",
        "triangular-shaped head",
        "Vocal and sociable behavior",
        "Triangular face shape",
        "Short, sleek coat",
        "short, sleek coat",
        "sleek and agile appearance",
        "Color point pattern: Both breeds can have color points, but Siamese cats generally have a more defined pattern with darker colors on the ears, face, paws, and tail.",
        "wedge-shaped head",
        "triangular head shape",
        "Light-colored body with darker points (ears, face, paws, and tail)"
    ],
    "Sphynx": [
        "Large ears",
        "Large, bat-like ears",
        "Prominent, large ears",
        "Large, pointed ears",
        "Prominent ears: Sphynx cats have large, bat-like ears which are more prominent in comparison to the smaller, folded ears of pugs.",
        "Lack of fur or very short fur",
        "Elongated, slender body",
        "Cat-like facial features (such as whiskers and cat eyes)",
        "Tail: A Sphynx cat has a long, thin, tapering tail, compared to the proportionally shorter, thicker tail of an American Pit Bull Terrier.",
        "Long, whip-like tail",
        "Slender build: Sphynx cats have a lean, muscular frame, unlike the stockier build of pugs.",
        "Size: Sphynx cats are generally much smaller in stature compared to Boxers, which are medium to large-sized dogs.",
        "Lack of fur",
        "Absence of a bushy tail",
        "Tail: Sphynx cats have long, tapered tails, whereas Boxers have shorter tails that are often docked."
    ],
    "american bulldog": [
        "Tail: American Bulldogs usually have a thicker, longer tail that tapers, while Staffordshire Bull Terriers often have a shorter tail.",
        "Tail type: American Bulldogs typically have a straight, tapered tail, whereas Saint Bernards often have a bushy tail.",
        "Muzzle: The American Bulldog has a longer and more prominent muzzle, while Staffordshire Bull Terriers have a shorter muzzle.",
        "Body: American Bulldogs tend to have a stockier and more robust build.",
        "Coat: Both breeds have a short coat, but American Bulldogs may have a more varied coat pattern, whereas Staffordshire Bull Terriers often have a more uniform coat.",
        "Size: American Bulldogs are generally larger and more muscular.",
        "**Coat color:** American Bulldogs usually have a solid white or predominantly white coat sometimes mixed with patches of brown, brindle, or black. Samoyeds typically have a pure white or white and biscuit coat.",
        "Short, sleek coat",
        "**Short coat:** American Bulldogs have a short and smooth coat, whereas Samoyeds have a long, fluffy coat.",
        "Ears: American Bulldogs often have ears that are semi-pricked, while Staffordshire Bull Terriers typically have smaller, rose-shaped or half-pricked ears.",
        "Head Shape: American Bulldogs have a broader and more pronounced head.",
        "**Tail:** American Bulldogs have a thick, low-set tail that may have a slight curve, while Samoyeds have a heavily furred tail that usually curls over their back.",
        "more upright posture",
        "generally larger size",
        "Typically a larger size",
        "wider, more prominent head",
        "short and smooth coat",
        "Strong, stocky legs",
        "Slender and more elongated body",
        "Long and thin tail"
    ],
    "american pit bull terrier": [
        "Slender, elegant build",
        "Thick, fluffy, white coat",
        "Generally solid or brindle coat colors, often with white markings ",
        "Coat: Both breeds have short coats, but the texture and sheen might slightly differ, with Pit Bulls often having a sleeker coat.",
        "Short, smooth coat that is often brindle or solid-colored",
        "Less pronounced snout length compared to beagles",
        "Solid color or brindle coat pattern",
        "shorter coat",
        "Generally more energetic and alert demeanor",
        "Height: American Pit Bull Terriers usually stand taller (about 17-21 inches) compared to the Staffordshire Bull Terriers (about 14-16 inches).",
        "Short and smooth coat",
        "Ear shape and positioning",
        "Nose shape",
        "Short coat",
        "Body: American Pit Bull Terriers have a leaner and more athletic build, while Staffordshire Bull Terriers are often more muscular and stocky.",
        "Stockier stature",
        "Tail shape and length",
        "Short, smooth coat"
    ],
    "basset hound": [
        "Speckled or \"belton\" coat pattern"
    ],
    "beagle": [
        "Long, fluffy coat",
        "long, droopy ears",
        "Long, droopy ears",
        "Large, sturdy body",
        "Distinct hound-like appearance",
        "More compact and muscular body compared to a boxer's lean and tall frame",
        "Fox-like appearance",
        "Droopy eyes",
        "more prominent chest",
        "More muscular build",
        "short, smooth fur",
        "Short and smooth fur",
        "sturdier build",
        "Leaner body structure",
        "Long ears",
        "longer ears",
        "Longer ears",
        "Short, smooth coat",
        "Longer snout",
        "Larger, floppy ears"
    ],
    "boxer": [
        "a smaller, more compact body",
        "Shorter coat",
        "Erect or semi-erect ears (typically cropped)",
        "Erect or cropped ears (often seen in boxers)",
        "Long, thick fur",
        "Sturdy, medium-sized body",
        "typically docked tail (though not always)",
        "Round face",
        "square-shaped head",
        "Taller stature",
        "expressive, almond-shaped eyes",
        "Full, bushy tail",
        "Muscular and athletic build",
        "Expressive eyes with a soulful gaze",
        "Narrower and longer muzzle",
        "Generally short muzzle",
        "Short, tight coat",
        "Upright ears (sometimes cropped)",
        "Pronounced chest and strong legs",
        "distinctive facial markings, often with a \"mask\" or blaze"
    ],
    "chihuahua": [
        "Smooth or long fur coat (different from the typically sleek coat of a Siamese cat)",
        "Short, smooth coat (although some Chihuahuas have long hair)",
        "Short, smooth coat (though some chihuahuas have long hair, it's typically finer)",
        "tendency to appear \"shivery\" or delicate",
        "smooth or long coat",
        "Lack of pronounced muzzle",
        "Proportionally larger head compared to body",
        "lighter overall build",
        "short coat (though they can have long coats too)",
        "short or long coat, often smooth",
        "small and delicate frame",
        "Absence of whiskers (or less pronounced compared to a cat)",
        "Erect, large ears"
    ],
    "english cocker spaniel": [
        "Longer ears",
        "Feathered ears that hang lower",
        "Long, wavy fur",
        "Larger size",
        "Longer, more flowing fur",
        "more compact body",
        "Feathered coat",
        "Feathery fur on legs and belly",
        "generally solid coat colors or roan patterns",
        "Generally larger size",
        "Solid color or parti-color coat patterns, often with roan markings",
        "Stocky, compact build",
        "Smaller stature",
        "Longer, wavy ears",
        "longer, wavy ears",
        "Longer body in proportion to height",
        "Longer, wavy or curly fur",
        "Feathering on legs and ears",
        "Longer, wavy or curly coat",
        "Wavy or curly fur"
    ],
    "english setter": [
        "Overall build: English Setters exhibit a leaner, more athletic build compared to the robust, muscular build of Saint Bernards.",
        "Size: English Setters are generally smaller and lighter compared to the much larger Saint Bernards.",
        "Head and facial structure: English Setters have a more refined and elongated head structure, while Saint Bernards have a broader, more massive head with a pronounced muzzle.",
        "Large and robust build",
        "longer, more athletic build",
        "leaner body",
        "Coat: English Setters often have long, silky coats with feathered ears, legs, and tail, while Saint Bernards have dense, thick coats.",
        "longer coat",
        "Longer, drooping ears",
        "Size: English Setters are typically larger than English Cocker Spaniels.",
        "Ears: English Setters have long, low-set ears that are feathered, whereas Saint Bernards have medium-sized, flapped ears without significant feathering.",
        "Long, slender body proportioned more like a dog",
        "Overall body structure: English Setters have a more slender, athletic build, whereas Leonbergers are larger and more robust with a powerful build.",
        "Muzzle: English Setters have a more refined, narrow muzzle, while Leonbergers have a broader and more robust muzzle.",
        "longer legs",
        "long, droopy ears",
        "Elegant and lean body structure"
    ],
    "german shorthaired": [
        "**British Shorthair**:",
        "Presence of a dog in the photo (German shorthaired is a dog breed, while Russian Blue is a cat breed)",
        "**Large, bat-like ears**",
        "**Large, expressive eyes, usually brown**"
    ],
    "great pyrenees": [
        "Coloring: Great Pyrenees are generally white or predominantly white with some patches, while Ragdolls have color point patterns with distinct markings on their face, ears, paws, and tail.",
        "Tail: Great Pyrenees have a thick, bushy tail, whereas Ragdolls have a long, fluffy tail.",
        "Ears: Great Pyrenees have medium-sized, rounded ears that tend to be flat against the head, whereas Ragdolls have pointed, upright ears.",
        "Body Shape: Great Pyrenees have a sturdy, muscular build, while Ragdolls have a more slender, elongated body.",
        "Predominantly white fur, potentially with patches of yellow, badger, or gray",
        "more slender body build",
        "Less defined musculature compared to a pit bull",
        "Muzzle: Great Pyrenees have a more pronounced, longer muzzle compared to the shorter, more refined muzzle of a Ragdoll.",
        "More prominent, muscular build",
        "Broad head with a relatively flat skull",
        "Fluffy, bushy tail often carried low or straight with slight curve",
        "solid, muscular build",
        "Strong, muscular build",
        "Silky coat of medium length",
        "More slender and graceful build",
        "Broader head",
        "Eye Shape: Great Pyrenees typically have dark, almond-shaped eyes, while Ragdolls usually have large, oval-shaped blue eyes.",
        "lack of a pronounced black mask or markings",
        "Broad head with a gentle expression",
        "smaller, more angular head"
    ],
    "havanese": [
        "Long, flowing hair around the ears and face",
        "Tail curled over the back, covered in long hair",
        "large, muscular body",
        "Less pronounced drooping ears compared to the English Cocker Spaniel",
        "long, shaggy coat",
        "Tail carried over the back but less fluffy compared to a Pomeranian's",
        "longer ears that hang down, covered in long fur",
        "Sturdier build",
        "lacks the long ears and droopy appearance of a basset hound",
        "Longer, silky hair",
        "Rounded ears with hair that often falls over them",
        "Sturdier and slightly larger build",
        "Plumed tail that curls over the back",
        "Long, silky coat",
        "long, silky coat",
        "Larger size",
        "Broad, sturdy build",
        "Longer muzzle",
        "Distinctive \"teddy bear\" appearance with a friendly expression",
        "Dropped ears"
    ],
    "japanese chin": [
        "Longer, silky coat that often looks more voluminous ",
        "Long, silky coat, often in black and white or red and white",
        "Small frame",
        "Long, flowing, and silky coat",
        "Overall Body Shape: Japanese Chins have a more delicate, elegant appearance while Keeshonds are more robust and sturdy.",
        "Flat face with an upturned nose",
        "Often a lively, alert expression",
        "More \"pushed-in\" face",
        "feathered, plumed tail carried over the back",
        "Distinctive flat face and broad skull"
    ],
    "keeshond": [
        "A keeshond has a fox-like face with a dark muzzle; a Ragdoll has a more rounded face.",
        "Compact and sturdy body",
        "Small size",
        "Fox-like face",
        "fox-like face",
        "A silky, straight coat",
        "Pointed ears",
        "Black and white or red and white fur colors",
        "Compact body structure"
    ],
    "leonberger": [
        "Coat Color: Leonbergers typically have a brown or tan coat with black markings, especially around the face, while Great Pyrenees usually have a completely white or mostly white coat.",
        "pointed, upright ears",
        "Droopy, triangular ears",
        "Distinct facial features of a dog",
        "face: black mask on the face",
        "Head shape: Leonbergers have a more rectangular head shape, while Saint Bernards have a broader, rounder head.",
        "Coat color: Leonbergers typically have a golden to reddish-brown coat, while Saint Bernards often have a white coat with red, black, or brindle spots.",
        "face shape (Leonbergers have a more elongated face)",
        "Mask: Leonbergers usually have a distinct black mask around the face, whereas Saint Bernards may not have this feature or only have partial dark markings.",
        "Ear shape: Leonbergers have medium-sized, pendant ears that lie close to the head, while Saint Bernards have more rounded ears.",
        "Tail: Leonbergers have a tail that is usually carried low with a slight curve, while Saint Bernards have a tail that is thicker and may be carried more upward.",
        "Black mask around the face",
        "Black mask on the face",
        "Rectangular body shape",
        "Coat texture: Leonbergers have a dense, water-resistant double coat, while Saint Bernards have a thick, dense coat that can be either smooth or rough."
    ],
    "miniature pinscher": [
        "Coat: Miniature Pinschers have a smooth, short, and glossy coat, typically in black, chocolate, or red, whereas Beagles have a denser, short coat in tricolor or bicolor patterns.",
        "**Color**: Miniature pinschers often come in colors such as black and tan, chocolate and tan, or solid red, while American pit bull terriers can be found in a variety of colors and patterns.",
        "**Tail**: Miniature pinschers typically have a docked tail that is quite short, while pit bull terriers usually have a thicker, medium-length tail.",
        "**Size**: Miniature pinschers are significantly smaller, usually weighing 8-12 pounds, while American pit bull terriers weigh between 30-60 pounds.",
        "**Proportions**: Miniature pinschers have a more slender and sleek body, while pit bulls are more muscular and stocky.",
        "**Facial Expression**: Miniature pinschers often have a keen and alert expression, reflecting their high energy levels and curiosity, while pit bull terriers have a more earnest and strong expression.",
        "fur coat",
        "Proportionally longer legs compared to a cat",
        "**Ears**: Miniature pinschers often have cropped ears that stand erect or natural ears that fold over, while American pit bull terriers can have natural ears that are either cropped or left in their natural state.",
        "**Head Shape**: Miniature pinschers have a more narrow and elongated head, while American pit bull terriers have a broader and more robust head.",
        "Expression: Miniature Pinschers often have a more alert, intense expression, while Beagles have a softer, more relaxed expression.",
        "short, sleek coat",
        "overall size (typically larger than a Sphynx cat)",
        "alert and slightly intense expression"
    ],
    "newfoundland": [
        "Overall dog-like appearance with a muscular build, contrasting a Persian cat's smaller, more delicate frame",
        "Droopy jowls and facial expression compared to a cat's more defined features",
        "Similar appearance to a miniature black panther",
        "Large size, generally much larger than any cat",
        "Large size",
        "Larger and more robust frame",
        "Copper or gold eyes that are strikingly large and round",
        "Large, robust body",
        "Proportionally longer and broader body",
        "Large, bushy tail",
        "Smooth, glossy fur",
        "larger size",
        "Gentle and soft expression in the eyes",
        "Generally calm and gentle expression",
        "Large, muscular body",
        "Droopy ears",
        "Gentle and calm expression",
        "Thick, double coat",
        "Drooping ears, often covered with long hair",
        "Thick, water-resistant double coat of fur"
    ],
    "pomeranian": [
        "Longer snout",
        "dense, fluffy coat",
        "Fluffy, dense coat",
        "fluffy, dense coat",
        "shorter snout",
        "Shorter snout",
        "Rounded ears",
        "fluffy coat",
        "erect ears with more fur",
        "absence of feline features (e.g., whiskers, cat-like eyes)",
        "typically a canine collar",
        "rounded, fox-like face",
        "Fluffy double coat and mane-like fur",
        "Fluffier coat",
        "Prominent mane around neck and chest",
        "Variety of coat colors, often solid or with distinct patterning"
    ],
    "pug": [
        "Smooth, fine coat",
        "Smooth coat"
    ],
    "saint bernard": [
        "Shorter coat varieties: Saint Bernards can have both short and long coat varieties, whereas Leonbergers typically have a long, straight, and dense double coat.",
        "Distinctive coat colors: Saint Bernards often have a white base coat with patches of brown, red, or brindle, especially on the back and sides.",
        "Droopy jowls: Saint Bernards have more pronounced, droopy jowls compared to Leonbergers.",
        "Ears: Saint Bernards have medium-sized, high-set, and floppy ears.",
        "Coat color: Saint Bernards usually have a tricolor or bicolor coat with shades of white, brown, and black, while Great Pyrenees are often solid white or have very few markings.",
        "more narrow muzzle compared to the broader snout of a Newfoundland",
        "Barrel-like chest",
        "Ears: Saint Bernards have medium-sized, rounded ears that droop close to the head.",
        "Barrel-shaped chest",
        "Short snout",
        "broad, squared muzzle",
        "short or long coat but typically with distinct patches of color",
        "Stockier build compared to the sleeker samoyed",
        "broad, powerful head with pronounced stop",
        "Droopy ears",
        "Broad head",
        "Longer and thicker coat",
        "Distinctive facial markings: Saint Bernards often have a dark mask or markings around their eyes and muzzle.",
        "Large, robust, and muscular body",
        "Ears that are set high and hang close to the head"
    ],
    "samoyed": [],
    "scottish terrier": [
        "a distinctive, wiry coat",
        "Long, wiry coat",
        "Pointed ears",
        "Compact, robust body shape",
        "Wiry, coarse coat"
    ],
    "shiba inu": [
        "presence of a snout and whiskers (Sphynx cats have a more defined and slender facial structure)",
        "overall build (Shiba Inus are more robust compared to the slender physique of a Sphynx cat)",
        "Pointed ears",
        "medium build with a sturdy and strong physique",
        "shorter, denser coat",
        "Erect, triangular ears",
        "erect, triangular ears",
        "face shape (Shiba Inu has a fox-like face with triangular eyes)",
        "furry coat",
        "thick double coat with a soft undercoat",
        "erect ears",
        "ears (Shiba Inu has small, erect, triangular ears)",
        "compact, muscular body",
        "Distinctive markings (often with contrasting colors on the face, chest, and legs)",
        "larger, more robust build",
        "Double coat (thick and plush undercoat with stiff outer coat)",
        "Fox-like appearance",
        "Thick double coat",
        "thick double coat",
        "upright, triangular ears"
    ],
    "staffordshire bull terrier": [
        "Stockier, more muscular build",
        "tapered tail (pugs usually have a curled tail)",
        "Muscular and stocky build",
        "Erect ears (sometimes semi-pricked)",
        "short, erect ears",
        "erect or semi-erect ears (pugs have floppy ears)",
        "Muscular, stocky build",
        "Short, stocky tail",
        "relatively longer muzzle (pugs have a short, flat muzzle)"
    ],
    "wheaten terrier": [
        "larger size",
        "A double coat, which may be either wavy or curly",
        "Medium size",
        "Lack of undercoat (single coat, unlike the double coat of Havanese)",
        "Tendencies of being smaller and more compact",
        "Tail held up and usually docked (shortened) in some regions",
        "Medium size, typically 30-40 pounds (13.6-18.1 kg)",
        "canine body structure",
        "Friendly, alert expression",
        "overall sturdier build",
        "Size: Wheaten terriers are generally medium-sized dogs, while Keeshonds tend to be slightly larger and more robust.",
        "longer snout",
        "Happy and friendly expression",
        "medium to large size with a sturdy build",
        "Medium-sized body",
        "Soft, silky coat",
        "Medium size and sturdy build",
        "Longer muzzle",
        "Energetic and alert posture",
        "Rectangular body shape"
    ],
    "yorkshire terrier": [
        "Silky, long coat",
        "Silky, shiny coat",
        "Small, V-shaped ears",
        "Smaller, more delicate frame",
        "Silky, straight, and fine coat",
        "Round, dark eyes",
        "silky, long hair",
        "Erect, V-shaped ears",
        "Small size",
        "tan and blue or black coat"
    ]
}