{
    "Abyssinian": [
        "More contrast in coat pattern with a wild appearance",
        "Sleek and graceful appearance",
        "long tail",
        "Ticked tabby pattern",
        "Short, ticked coat",
        "Sleek, short coat with a ticked pattern",
        "Rosetted or marbled coat patterns"
    ],
    "Bengal": [
        "Pointed ears",
        "Wrinkled appearance",
        "Prominent cheekbones",
        "Pointed ears with rounded tips",
        "sleek, muscular build",
        "Muscular build",
        "More muscular and athletic build",
        "Rosetted spots or horizontal stripes",
        "smaller size compared to a dog",
        "Rounded ears",
        "short, sleek coat with a distinctive spotted or marbled pattern",
        "Hairless skin",
        "Large ears",
        "Short, shiny coat",
        "Larger size compared to a chihuahua",
        "Sleek, muscular body",
        "Wild-looking facial markings, including a pronounced M shape on the forehead",
        "Strong, muscular body",
        "Overall golden or brownish hue",
        "Distinctive coat pattern with spots or rosettes"
    ],
    "Birman": [
        "A Birman generally displays a calm, serene demeanor, while a boxer often has a more energetic and playful appearance.",
        "A Birman has a long, silky coat, whereas a boxer has short, smooth fur.",
        "A Birman is a cat with a slender, graceful body, compared to a boxer's muscular, robust canine build.",
        "slender physique compared to the Keeshond's more robust and fluffy appearance",
        "Birmans have a bushy tail, whereas boxers have a shorter, more straight tail.",
        "Birmans have distinctive blue eyes, while boxers have dark brown eyes.",
        "typically larger size compared to a Pomeranian",
        "Stocky and muscular body",
        "Birmans typically have a pointed color pattern, with darker fur on the face, ears, paws, and tail, unlike boxers who usually have a solid or brindle coat with possible white markings.",
        "lack of the double coat seen in Keeshonds",
        "Less pronounced, softer facial features compared to the sharper angles of a Siamese’s face",
        "overall feline anatomy rather than canine",
        "Pointed ears",
        "More muscular and stocky body build compared to the slender Siamese",
        "Facial features (Birmans have a more rounded face, whereas Maine Coons have a squarer muzzle and more prominent cheekbones)"
    ],
    "Bombay": [
        "Rounded head and short muzzle (Bombay)",
        "Medium-sized, rounded ears",
        "rounded head with a short muzzle",
        "Heavy bone structure (Newfoundland)",
        "Large, pointed ears",
        "Light-colored body with darker points (ears, face, paws, tail)",
        "Round head",
        "Sharp, pointed ears",
        "paw structure",
        "Sleek, short black coat (Bombay)",
        "Short, glossy coat",
        "Round, copper or gold eyes (Bombay)",
        "Rounded head with a shorter nose",
        "copper or gold eye color",
        "Long, wedge-shaped head",
        "Black nose and paw pads",
        "Boxer is a dog breed, typically recognized by its sturdy, medium-sized frame and expressive face.",
        "Wide-set, round eyes, typically gold or copper",
        "Large, muscular body (Newfoundland)",
        "Black coat"
    ],
    "British Shorthair": [
        "**German Shorthaired Pointer**:",
        "Typically medium to large size but smaller compared to an American Bulldog",
        "Longer legs and more pronounced muscles",
        "Calm and reserved demeanor in appearance",
        "Shorter legs",
        "Dog-like body structure",
        "Short legs",
        "Sturdy, muscular build",
        "Generally calm and reserved demeanor in photos",
        "Medium to long, silky fur",
        "Short nose",
        "A strong and muscular build",
        "Tail short and thick but tapering at the end",
        "Short, dense coat with a plush feel"
    ],
    "Egyptian Mau": [
        "**Coat Pattern**: Egyptian Maus typically have a spotted coat pattern with distinctive, small to medium-sized spots. The Maine Coon's coat can be a variety of patterns but is often seen in tabby and has a full, long-haired appearance.",
        "Spotted coat",
        "spotted coat",
        "Distinctive spotted coat pattern",
        "Spotted coat pattern",
        "Silhouette: Egyptian Maus have a more lithe, sleek silhouette compared to the robust, muscular build of a German Shorthaired Pointer.",
        "**Coat Length**: Egyptian Maus have short, sleek, and shiny coats, whereas Maine Coons have long, thick, and sometimes shaggy fur.",
        "**Tail**: The Maine Coon has a long, bushy tail, whereas the Egyptian Mau has a medium-length, relatively thin tail often with rings or a dark tip.",
        "Solid or classic tabby coat patterns rather than spotted",
        "Spotted Coat: Egyptian Mau has a distinct spotted coat pattern, while a German Shorthaired Pointer typically has a solid or speckled coat."
    ],
    "Maine Coon": [
        "Full, fluffy coat",
        "Graceful, feline posture and movement",
        "Sleek, flexible body typical of a cat",
        "high cheekbones"
    ],
    "Persian": [
        "Pointed ears",
        "calm and laid-back demeanor",
        "Calm and relaxed demeanor in appearance",
        "Round, large eyes",
        "Graceful, feline body shape",
        "absence of a snout",
        "Pronounced cheeks"
    ],
    "Ragdoll": [
        "Smaller size and build compared to a dog",
        "Tail: Ragdolls have a long, fluffy tail, whereas Newfoundlands have a thick, bushy tail often carried low. ",
        "Size: Ragdolls are much smaller compared to the large Newfoundland dogs.",
        "Facial structure: Ragdolls have a more delicate and feline facial structure with a distinct nose shape, whereas Newfoundlands have a robust canine face.",
        "Larger and more muscular body",
        "Body shape: Ragdolls have a long, lean, and flexible body, contrasting with the Newfoundland’s broad, bulky, and muscular build.",
        "Larger size and muscular build",
        "Color patterns: Ragdolls come in various color patterns like colorpoint, mitted, and bicolor, while Newfoundlands are typically solid black, brown, grey, or Landseer (black and white).",
        "typically cropped or naturally floppy ears",
        "muscular, stocky build",
        "Facial structure: Ragdolls have a more wedge-shaped face with a soft expression, while Bombays have a more rounded face with a shorter muzzle.",
        "Body structure: Ragdolls have a more muscular and semi-longer body, whereas Bombays have a more compact and muscular build.",
        "Slightly flattened nose",
        "Fur texture: Ragdolls generally have soft, semi-long fur, while Newfoundlands have dense, water-resistant, and often longer fur.",
        "No snout (flat-faced)",
        "tendency to lie limp when picked up"
    ],
    "Russian Blue": [
        "Whisker pads giving a slightly smiling expression ",
        "More likely to be on elevated surfaces (like furniture) ",
        "Cat-like facial features"
    ],
    "Siamese": [
        "Prominent, triangular-shaped head with large ears",
        "erect, large ears",
        "Prominent, large ears",
        "large, pointed ears",
        "Large, pointed ears",
        "triangular head with large ears",
        "darker points on the ears, face, paws, and tail",
        "darker points on ears, face, paws, and tail",
        "Short, sleek coat",
        "short, sleek coat",
        "sleek and agile appearance",
        "Vocal and sociable behavior",
        "triangular-shaped head",
        "wedge-shaped head",
        "Color point pattern: Both breeds can have color points, but Siamese cats generally have a more defined pattern with darker colors on the ears, face, paws, and tail.",
        "Muscular and athletic build",
        "Short, fine coat with minimal shedding",
        "graceful and elegant posture",
        "short, fine coat",
        "Short, fine coat"
    ],
    "Sphynx": [
        "Large ears",
        "Prominent, large ears",
        "Large, bat-like ears",
        "Slender build: Sphynx cats have a lean, muscular frame, unlike the stockier build of pugs.",
        "Tail: A Sphynx cat has a long, thin, tapering tail, compared to the proportionally shorter, thicker tail of an American Pit Bull Terrier.",
        "Lack of fur or very short fur",
        "Prominent ears: Sphynx cats have large, bat-like ears which are more prominent in comparison to the smaller, folded ears of pugs.",
        "Large, pointed ears",
        "Size: Sphynx cats are generally much smaller in stature compared to Boxers, which are medium to large-sized dogs.",
        "Skin color may be pink or have spots, whereas a Russian Blue has a solid blue-gray coat",
        "Cat-like facial features (such as whiskers and cat eyes)",
        "Long, whip-like tail",
        "Hairlessness: Sphynx cats are distinctly hairless, while pugs have a short, fur-covered coat.",
        "Tail: Sphynx cats have long, tapered tails, whereas Boxers have shorter tails that are often docked.",
        "Elongated, slender body",
        "Hairlessness: Sphynx cats are known for their lack of fur, whereas Boxers have a short, tight-fitting coat of fur.",
        "Absence of a bushy tail",
        "Hairlessness or very fine, short coat",
        "Whisker pads: Sphynx cats have pronounced whisker pads, whereas pugs typically do not.",
        "Lack of fur"
    ],
    "american bulldog": [
        "Tail: American Bulldogs usually have a thicker, longer tail that tapers, while Staffordshire Bull Terriers often have a shorter tail.",
        "Tail type: American Bulldogs typically have a straight, tapered tail, whereas Saint Bernards often have a bushy tail.",
        "Muzzle: The American Bulldog has a longer and more prominent muzzle, while Staffordshire Bull Terriers have a shorter muzzle.",
        "Body: American Bulldogs tend to have a stockier and more robust build.",
        "Coat: Both breeds have a short coat, but American Bulldogs may have a more varied coat pattern, whereas Staffordshire Bull Terriers often have a more uniform coat.",
        "Size: American Bulldogs are generally larger and more muscular.",
        "**Coat color:** American Bulldogs usually have a solid white or predominantly white coat sometimes mixed with patches of brown, brindle, or black. Samoyeds typically have a pure white or white and biscuit coat.",
        "Ears: American Bulldogs often have ears that are semi-pricked, while Staffordshire Bull Terriers typically have smaller, rose-shaped or half-pricked ears.",
        "**Short coat:** American Bulldogs have a short and smooth coat, whereas Samoyeds have a long, fluffy coat.",
        "Short, sleek coat",
        "Head Shape: American Bulldogs have a broader and more pronounced head.",
        "**Tail:** American Bulldogs have a thick, low-set tail that may have a slight curve, while Samoyeds have a heavily furred tail that usually curls over their back.",
        "more upright posture",
        "generally larger size",
        "Typically a larger size",
        "Strong, stocky legs",
        "Stocky legs",
        "**Face shape:** American Bulldogs have a broad, square-shaped head with a more pronounced jaw and shorter muzzle, while Samoyeds have a narrower face and a longer snout.",
        "**Stocky build:** American Bulldogs have a more muscular and stockier build compared to the leaner and more agile build of Samoyeds.",
        "Drooping lips"
    ],
    "american pit bull terrier": [
        "Coat: Both breeds have short coats, but the texture and sheen might slightly differ, with Pit Bulls often having a sleeker coat.",
        "Generally solid or brindle coat colors, often with white markings ",
        "Slender, elegant build",
        "Short, smooth coat that is often brindle or solid-colored",
        "Thick, fluffy, white coat",
        "Less pronounced snout length compared to beagles",
        "Height: American Pit Bull Terriers usually stand taller (about 17-21 inches) compared to the Staffordshire Bull Terriers (about 14-16 inches).",
        "Solid color or brindle coat pattern",
        "shorter coat",
        "Generally more energetic and alert demeanor",
        "Stockier stature",
        "Bushy tail that curls over the back",
        "Size: American Pit Bull Terriers are generally larger and taller than Staffordshire Bull Terriers.",
        "Body: American Pit Bull Terriers have a leaner and more athletic build, while Staffordshire Bull Terriers are often more muscular and stocky.",
        "Leaner, more athletic build",
        "Tail: American Pit Bull Terriers have a longer, thinner tail, whereas Staffordshire Bull Terriers have a shorter, thicker tail.",
        "Tail is typically thick and tapers to a point",
        "Taller and more erect ears",
        "shorter snout"
    ],
    "basset hound": [
        "Speckled or \"belton\" coat pattern",
        "Prominent nose",
        "Prominent, loose lips (flews)",
        "Leaner, more elongated body compared to the boxer's muscular, stocky build",
        "Longer ears",
        "long, droopy ears",
        "Long, droopy ears"
    ],
    "beagle": [
        "Long, fluffy coat",
        "Large, sturdy body",
        "More compact and muscular body compared to a boxer's lean and tall frame",
        "long, droopy ears",
        "Long, droopy ears",
        "Distinct hound-like appearance",
        "more prominent chest",
        "More athletic build",
        "More muscular build",
        "Fox-like appearance",
        "Leaner body structure",
        "smaller stature",
        "sturdier build",
        "Curly tail that tends to arch over the back",
        "compact, athletic build",
        "Medium-sized body compared to the smaller, stockier body of a pug",
        "Smaller size",
        "Compact, muscular body",
        "short, smooth fur",
        "Longer legs"
    ],
    "boxer": [
        "Full, bushy tail",
        "Shorter coat",
        "Erect or semi-erect ears (typically cropped)",
        "typically docked tail (though not always)",
        "a smaller, more compact body",
        "Long, thick fur",
        "Muscular and athletic build",
        "Erect or cropped ears (often seen in boxers)",
        "Sturdy, medium-sized body",
        "Muscular, athletic build",
        "Taller stature",
        "Slender, athletic body",
        "Docked tail (in some regions)",
        "Proportionately longer legs"
    ],
    "chihuahua": [
        "Smooth or long fur coat (different from the typically sleek coat of a Siamese cat)",
        "Short, smooth coat (although some Chihuahuas have long hair)",
        "Short, smooth coat (though some chihuahuas have long hair, it's typically finer)",
        "Proportionally larger head compared to body",
        "Lack of pronounced muzzle",
        "tendency to appear \"shivery\" or delicate",
        "smooth or long coat",
        "Absence of whiskers (or less pronounced compared to a cat)",
        "short coat (though they can have long coats too)",
        "Delicate, svelte body build",
        "Proportionate snout",
        "Less fluffy tail (compared to the pomeranian's bushy tail)",
        "relatively larger eyes for the face",
        "large, prominent ears (often erect)",
        "lighter overall build",
        "Rounded \"apple\" head",
        "smaller overall size",
        "small and delicate frame",
        "Small body size",
        "rounded head (apple-shaped)"
    ],
    "english cocker spaniel": [
        "Longer ears",
        "Feathered ears that hang lower",
        "Long, wavy fur",
        "Longer, wavy ears",
        "longer, wavy ears",
        "Curly tail",
        "Feathered coat",
        "Long, wavy ears",
        "Feathery fur on legs and belly",
        "more compact body",
        "Longer, more flowing fur",
        "Longer, wavy or curly fur",
        "Longer body in proportion to height",
        "generally solid coat colors or roan patterns",
        "Longer, wavy or curly coat",
        "Tail carried level with or slightly above the back",
        "Wavy or curly fur",
        "Solid color or parti-color coat patterns, often with roan markings",
        "Longer snout",
        "Larger size"
    ],
    "english setter": [
        "Head and facial structure: English Setters have a more refined and elongated head structure, while Saint Bernards have a broader, more massive head with a pronounced muzzle.",
        "Overall build: English Setters exhibit a leaner, more athletic build compared to the robust, muscular build of Saint Bernards.",
        "Size: English Setters are generally smaller and lighter compared to the much larger Saint Bernards.",
        "Large and robust build",
        "Ears: English Setters have long, low-set ears that are feathered, whereas Saint Bernards have medium-sized, flapped ears without significant feathering.",
        "Coat: English Setters often have long, silky coats with feathered ears, legs, and tail, while Saint Bernards have dense, thick coats.",
        "Size: English Setters are generally smaller and lighter than Leonbergers.",
        "Muzzle: English Setters have a more refined, narrow muzzle, while Leonbergers have a broader and more robust muzzle.",
        "Longer, drooping ears",
        "Overall body structure: English Setters have a more slender, athletic build, whereas Leonbergers are larger and more robust with a powerful build.",
        "Size: English Setters are typically larger than English Cocker Spaniels.",
        "longer, more athletic build",
        "long, droopy ears",
        "long, silky hair with feathered texture",
        "longer, feathered coat",
        "longer coat",
        "droopy ears with feathered hair",
        "Long, feathered ears",
        "Often has a more refined and narrow face features",
        "Coat pattern: English Setters usually have a speckled or \"ticked\" coat pattern, while Leonbergers have a solid or slightly shaded coat."
    ],
    "german shorthaired": [
        "**British Shorthair**:",
        "**Prominent cheekbones and a defined jawline**",
        "**Large, bat-like ears**"
    ],
    "great pyrenees": [
        "Coloring: Great Pyrenees are generally white or predominantly white with some patches, while Ragdolls have color point patterns with distinct markings on their face, ears, paws, and tail.",
        "Ears: Great Pyrenees have medium-sized, rounded ears that tend to be flat against the head, whereas Ragdolls have pointed, upright ears.",
        "Body Shape: Great Pyrenees have a sturdy, muscular build, while Ragdolls have a more slender, elongated body.",
        "Tail: Great Pyrenees have a thick, bushy tail, whereas Ragdolls have a long, fluffy tail.",
        "more slender body build",
        "Predominantly white fur, potentially with patches of yellow, badger, or gray",
        "Less defined musculature compared to a pit bull",
        "More prominent, muscular build",
        "Muzzle: Great Pyrenees have a more pronounced, longer muzzle compared to the shorter, more refined muzzle of a Ragdoll.",
        "Broad head with a relatively flat skull",
        "Strong, muscular build",
        "solid, muscular build",
        "More slender and graceful build",
        "Fluffy, bushy tail often carried low or straight with slight curve",
        "Eye Shape: Great Pyrenees typically have dark, almond-shaped eyes, while Ragdolls usually have large, oval-shaped blue eyes.",
        "Silky coat of medium length",
        "Broad head with a gentle expression",
        "Erect ears that can be rounded at the tips or slightly folded",
        "lack of a pronounced black mask or markings",
        "Soft, rounded ears that can sometimes be feathered"
    ],
    "havanese": [
        "large, muscular body",
        "Less pronounced drooping ears compared to the English Cocker Spaniel",
        "Long, flowing hair around the ears and face",
        "longer ears that hang down, covered in long fur",
        "Tail curled over the back, covered in long hair",
        "Tail carried over the back but less fluffy compared to a Pomeranian's",
        "long, shaggy coat",
        "lacks the long ears and droopy appearance of a basset hound",
        "Rounded ears with hair that often falls over them",
        "Sturdier build",
        "Erect, triangular ears",
        "Broad, sturdy build",
        "Sturdier and slightly larger build",
        "Long, silky coat",
        "long, silky coat",
        "Longer, silky hair",
        "Tail often docked (in regions where this practice is legal)",
        "Plumed tail that curls over the back",
        "Dropped ears",
        "Larger size"
    ],
    "japanese chin": [
        "Long, silky coat, often in black and white or red and white",
        "Longer, silky coat that often looks more voluminous ",
        "More \"pushed-in\" face",
        "Long, flowing fur around the face and neck",
        "Distinctive markings on the face, usually black and white or red and white",
        "flat face with a broad forehead",
        "Long, flowing, and silky coat",
        "Small frame",
        "Flat face with an upturned nose"
    ],
    "keeshond": [
        "A keeshond has a fox-like face with a dark muzzle; a Ragdoll has a more rounded face.",
        "Eyes: Keeshonds have more pronounced \"spectacles\" or markings around the eyes, creating a more expressive look; Samoyeds do not have such markings.",
        "Small size",
        "A silky, straight coat",
        "Smaller size",
        "Pointed ears",
        "Pointed ears that stand erect",
        "Black and white or red and white fur colors",
        "fox-like face",
        "Fox-like face",
        "Compact body structure",
        "Dog-like appearance",
        "Bushy tail"
    ],
    "leonberger": [
        "Droopy, triangular ears",
        "pointed, upright ears",
        "Coat Color: Leonbergers typically have a brown or tan coat with black markings, especially around the face, while Great Pyrenees usually have a completely white or mostly white coat.",
        "Coat color: Leonbergers typically have a golden to reddish-brown coat, while Saint Bernards often have a white coat with red, black, or brindle spots.",
        "Head shape: Leonbergers have a more rectangular head shape, while Saint Bernards have a broader, rounder head.",
        "face: black mask on the face",
        "Ear shape: Leonbergers have medium-sized, pendant ears that lie close to the head, while Saint Bernards have more rounded ears.",
        "Distinct facial features of a dog",
        "Rectangular body shape",
        "face shape (Leonbergers have a more elongated face)",
        "Black mask around the face",
        "Mask: Leonbergers usually have a distinct black mask around the face, whereas Saint Bernards may not have this feature or only have partial dark markings.",
        "Black mask on the face",
        "Coat texture: Leonbergers have a dense, water-resistant double coat, while Saint Bernards have a thick, dense coat that can be either smooth or rough.",
        "Facial mask, often darker",
        "dog-like facial features"
    ],
    "miniature pinscher": [
        "Coat: Miniature Pinschers have a smooth, short, and glossy coat, typically in black, chocolate, or red, whereas Beagles have a denser, short coat in tricolor or bicolor patterns.",
        "**Color**: Miniature pinschers often come in colors such as black and tan, chocolate and tan, or solid red, while American pit bull terriers can be found in a variety of colors and patterns.",
        "**Tail**: Miniature pinschers typically have a docked tail that is quite short, while pit bull terriers usually have a thicker, medium-length tail.",
        "Proportionally longer legs compared to a cat",
        "**Size**: Miniature pinschers are significantly smaller, usually weighing 8-12 pounds, while American pit bull terriers weigh between 30-60 pounds.",
        "**Proportions**: Miniature pinschers have a more slender and sleek body, while pit bulls are more muscular and stocky.",
        "fur coat",
        "**Facial Expression**: Miniature pinschers often have a keen and alert expression, reflecting their high energy levels and curiosity, while pit bull terriers have a more earnest and strong expression.",
        "short, sleek coat",
        "**Ears**: Miniature pinschers often have cropped ears that stand erect or natural ears that fold over, while American pit bull terriers can have natural ears that are either cropped or left in their natural state.",
        "**Head Shape**: Miniature pinschers have a more narrow and elongated head, while American pit bull terriers have a broader and more robust head.",
        "overall size (typically larger than a Sphynx cat)",
        "Expression: Miniature Pinschers often have a more alert, intense expression, while Beagles have a softer, more relaxed expression.",
        "**Coat**: Both breeds have short coats, but the miniature pinscher's coat is very smooth and glossy."
    ],
    "newfoundland": [
        "Overall dog-like appearance with a muscular build, contrasting a Persian cat's smaller, more delicate frame",
        "Droopy jowls and facial expression compared to a cat's more defined features",
        "Similar appearance to a miniature black panther",
        "Large size",
        "Large size, generally much larger than any cat",
        "Larger and more robust frame",
        "Large, robust body",
        "Gentle and soft expression in the eyes",
        "larger size",
        "Smooth, glossy fur",
        "Proportionally longer and broader body",
        "Copper or gold eyes that are strikingly large and round",
        "Thick, double coat",
        "Large, bushy tail",
        "Gentle and calm expression",
        "Generally calm and gentle expression",
        "Drooping ears, often covered with long hair",
        "Gentle and expressive eyes",
        "Large, muscular body",
        "Droopy ears"
    ],
    "pomeranian": [
        "dense, fluffy coat",
        "Longer snout",
        "Fluffy, dense coat",
        "fluffy, dense coat",
        "fluffy coat",
        "Rounded ears",
        "Compact, sturdy body",
        "erect ears with more fur",
        "Fluffier coat",
        "shorter snout",
        "Shorter snout",
        "absence of feline features (e.g., whiskers, cat-like eyes)",
        "Variety of coat colors, often solid or with distinct patterning",
        "plume-like tail that arches over the back",
        "Plumed tail that curls over the back",
        "Fluffy double coat and mane-like fur",
        "Typically a plume-like tail that curls over the back"
    ],
    "pug": [
        "Smooth, fine coat",
        "Curly tail",
        "Smooth coat",
        "a short, curly tail",
        "Stocky body",
        "short, smooth fur",
        "short, smooth coat",
        "Short coat"
    ],
    "saint bernard": [
        "Shorter coat varieties: Saint Bernards can have both short and long coat varieties, whereas Leonbergers typically have a long, straight, and dense double coat.",
        "Distinctive coat colors: Saint Bernards often have a white base coat with patches of brown, red, or brindle, especially on the back and sides.",
        "Coat color: Saint Bernards usually have a tricolor or bicolor coat with shades of white, brown, and black, while Great Pyrenees are often solid white or have very few markings.",
        "Ears: Saint Bernards have medium-sized, high-set, and floppy ears.",
        "Ears: Saint Bernards have medium-sized, rounded ears that droop close to the head.",
        "broad, powerful head with pronounced stop",
        "Barrel-like chest",
        "Broad head",
        "Barrel-shaped chest",
        "Droopy jowls: Saint Bernards have more pronounced, droopy jowls compared to Leonbergers.",
        "Ears that are set high and hang close to the head",
        "short or long coat but typically with distinct patches of color",
        "Large size",
        "Droopy ears",
        "Long, bushy tail",
        "more narrow muzzle compared to the broader snout of a Newfoundland",
        "broad, squared muzzle",
        "Short snout",
        "Longer and thicker coat",
        "Large, robust, and muscular body"
    ],
    "samoyed": [
        "pointed ears"
    ],
    "scottish terrier": [
        "a distinctive, wiry coat",
        "Pointed ears",
        "Compact, robust body shape",
        "Long, wiry coat",
        "robust and compact body",
        "Wiry, coarse coat",
        "long, dense, wiry coat",
        "often found in a variety of colors including orange, black, white, and more",
        "longer, wiry fur",
        "Upright, pointed ears",
        "a prominent beard and eyebrows",
        "Bushy eyebrows",
        "distinct beard and eyebrows",
        "Generally smaller stature",
        "Compact and sturdy body",
        "distinctive beard and eyebrows",
        "Distinctive beard and eyebrows",
        "Long, pronounced snout",
        "Wiry coat",
        "Generally black, wheaten, or brindle coat color"
    ],
    "shiba inu": [
        "presence of a snout and whiskers (Sphynx cats have a more defined and slender facial structure)",
        "overall build (Shiba Inus are more robust compared to the slender physique of a Sphynx cat)",
        "Pointed ears",
        "medium build with a sturdy and strong physique",
        "face shape (Shiba Inu has a fox-like face with triangular eyes)",
        "shorter, denser coat",
        "Erect, triangular ears",
        "erect, triangular ears",
        "furry coat",
        "thick double coat with a soft undercoat",
        "larger, more robust build",
        "compact, muscular body",
        "erect ears",
        "ears (Shiba Inu has small, erect, triangular ears)",
        "thick double coat",
        "Thick double coat",
        "Double coat (thick and plush undercoat with stiff outer coat)",
        "Fox-like appearance",
        "Distinctive markings (often with contrasting colors on the face, chest, and legs)"
    ],
    "staffordshire bull terrier": [
        "relatively longer muzzle (pugs have a short, flat muzzle)",
        "Often a broader stance",
        "tapered tail (pugs usually have a curled tail)",
        "erect or semi-erect ears (pugs have floppy ears)"
    ],
    "wheaten terrier": [
        "larger size",
        "Dark, expressive eyes",
        "Tendencies of being smaller and more compact",
        "A double coat, which may be either wavy or curly",
        "Friendly, alert expression",
        "Tail held up and usually docked (shortened) in some regions",
        "Medium size",
        "overall sturdier build",
        "Longer muzzle",
        "Shorter muzzle",
        "Medium size, typically 30-40 pounds (13.6-18.1 kg)"
    ],
    "yorkshire terrier": [
        "Silky, long coat",
        "Silky, straight, and fine coat",
        "Silky, shiny coat",
        "Coarser hair on the head and muzzle",
        "silky, long hair",
        "tan and blue or black coat",
        "Long, fine, usually blue and tan coat",
        "Longer muzzle and facial hair",
        "Smaller, more delicate frame",
        "Round, dark eyes",
        "Small, V-shaped ears",
        "Long, silky, straight coat",
        "Sturdier build with a square profile",
        "Long, flowing hair on both the body and the face",
        "Longer muzzle",
        "generally lighter in color around the face and chest",
        "Small, erect ears",
        "Typically hair coloring that includes shades of black, tan, and blue",
        "Small, pointed ears that are often erect",
        "Long, silky coat"
    ]
}