{
    "A300": [
        "Slight dihedral wings (wings angled slightly upwards) ",
        "Slightly shorter fuselage compared to DC-10",
        "Lack of wingtip fences or sharklets (classic A300s)",
        "Absence of a characteristic \"S-duct\" engine intake on the tail",
        "Positioned lower, closer to the ground when on the ground (due to shorter landing gear)",
        "Winglets at the wingtips (depending on the version)",
        "Number of engines: The A300 has two engines mounted under its wings, while the Challenger 600 typically has two engines mounted on the rear fuselage.",
        "Wider and slightly more squared-off engine cowlings",
        "Smaller overall size",
        "Wing configuration: The A310 has wingtip fences (small vertical stabilizers at the end of each wing), which are not present on earlier models of the A300.",
        "Airbus A300 logo or markings if visible",
        "Winglets (on some models, though not as pronounced as modern aircraft)",
        "A300 typically does not feature a T-tail (MD-90 has a T-tail configuration)",
        "Shorter fuselage length (A300 is generally shorter than the A340)",
        "shorter fuselage"
    ],
    "A310": [
        "Two engines mounted under the wings, rather than four engines.",
        "distinctive tailcone shape (more pointed on A310)",
        "Winglets on the wings if present (later models may have them).",
        "Engine placement and type: Differences may also be found in the shape and placement of the engines under the wings.",
        "More modern fuselage design with fewer windows",
        "A wider and shorter fuselage compared to the DC-8.",
        "Shorter fuselage (A310) compared to the longer fuselage (DC-10)",
        "Two engines instead of four",
        "T-tails (tailplane)",
        "shorter fuselage",
        "Shorter fuselage",
        "Only two engines, one under each wing",
        "Absence of the distinctive tail engine found on the DC-10",
        "Two engines (one under each wing)",
        "Fuselage shape: The A310 typically has a shorter, more compact fuselage than the longer fuselage of the Boeing 767."
    ],
    "A320": [
        "landing gear design (A320 has a simpler main landing gear structure)",
        "Absence of rear fuselage-mounted engines"
    ],
    "A330": [
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "Newer design with longer range and more passenger capacity",
        "Tail height: The vertical tail fin of the A330 is often taller than that of the A310.",
        "**Wingtips:** A330 typically has wingtip devices known as winglets or sharklets, while early models of the Boeing 737 have no winglets and later models may have split scimitar winglets.",
        "Winglets with a distinctive upward curve (sharklets)",
        "Winglets on the wingtips",
        "Winglets with a curved design",
        "Length of fuselage: The A330 generally has a longer fuselage than the A310.",
        "Different wingtip design (depending on the variant)",
        "The shape of the tail cone",
        "Shorter fuselage",
        "Tail height: A380 has a taller tail compared to the A330.",
        "Wing span: The A330 has longer wings compared to the A310.",
        "Longer fuselage",
        "Winglets: The A330 often features larger, more prominent winglets compared to the A310."
    ],
    "A340": [
        "Differences in the shape and layout of the tail and vertical stabilizer",
        "Four engines (A340) vs. two engines (A320)",
        "Four engines",
        "More modern and sleek fuselage design",
        "Flat and straight engine pylons",
        "Four engines (A340 has four engines, whereas Boeing 757 has two)",
        "A340 generally has a smoother nose shape, while the 777 has a more pointed nose",
        "Number of landing gear wheels (A340 typically has more)",
        "Longer fuselage ",
        "Longer fuselage",
        "Lengthy fuselage "
    ],
    "A380": [
        "Number of landing gear wheels (22 for A380 vs. 14 for Boeing 777)",
        "Wingtip fences or winglets that are larger and more vertical",
        "Landing gear configuration with more wheels",
        "Extra set of landing gear wheels (20 wheels in total)",
        "slightly different tail design",
        "Typically wider fuselage",
        "Four engines mounted under the wings",
        "More landing gear wheels (22 wheels)",
        "four engines",
        "Four engines",
        "Larger overall size in terms of length and wingspan",
        "four engines mounted closer to the fuselage",
        "Four engines under the wings",
        "Larger tail fin",
        "Four engines (A380) vs. two engines (Boeing 757)"
    ],
    "ATR-42": [
        "Fuselage shape (ATR-42 has a stubbier, more robust fuselage, while BAE-125 has a sleeker, more streamlined fuselage)",
        "Propeller engines (ATR-42 has turboprop engines, while BAE-125 has jet engines)",
        "Nose shape: The ATR-42 has a more rounded nose, whereas the DHC-6 has a more angular shape.",
        "Number of engines (ATR-42 has two engines mounted on the wings, while BAE-125 has two rear-mounted engines)",
        "T-tail (ATR-42 has a conventional tail, whereas BAE-125 has a T-tail configuration)",
        "Tail design: The ATR-42 features a T-tail configuration, while the DHC-6 has a conventional tail design."
    ],
    "ATR-72": [
        "Larger capacity: The ATR-72 generally accommodates more passengers than the ATR-42, so observing seat rows through windows may help.",
        "A more compact, rounded fuselage.",
        "High-wing configuration as well but with jet engines.",
        "Increased number of windows: The ATR-72 typically has more passenger windows along the fuselage.",
        "Longer fuselage: The ATR-72 has a longer fuselage compared to the ATR-42.",
        "Number of engines (both have two, but different types)",
        "Four jet engines mounted on pylons under the wings.",
        "Sharper, more angular tail: The ATR-72 features a prominent, angular vertical stabilizer.",
        "Larger windows and fewer rows of seats compared to a jet airliner (ATR-72)"
    ],
    "An-12": [
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "Soviet-era design aesthetics, often more angular and utilitarian compared to the sleek and modern appearance of an A320",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "An-12 has a rear loading ramp, while DHC-1 does not",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "High-wing design, as opposed to the low-wing design of an A320",
        "Different engine nacelle shape (more streamlined compared to C-130)",
        "Ramp/cargo door on An-12",
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "Large cargo door at the rear",
        "Fuselage: The An-12 has a bulkier, more rugged-looking fuselage, while the A300 has a more streamlined, modern design.",
        "Cargo doors",
        "DHC-1 (Chipmunk) is a smaller, more streamlined, light trainer aircraft",
        "Shorter fuselage than MD-11",
        "Glass nose (with windows offering a more pointed front profile)"
    ],
    "BAE 146": [
        "Steep landing and takeoff capabilities"
    ],
    "BAE-125": [
        "lacks propellers (as ATR-72 is a turboprop)",
        "Low wing placement (wings positioned lower on the fuselage)",
        "Longer, more streamlined fuselage ",
        "smaller size and sleeker design",
        "Smaller size/compact fuselage",
        "swept wings",
        "Size and shape: The BAE-125 is typically smaller and has a more compact shape compared to the longer and larger ERJ 145.",
        "Engine placement: The BAE-125 has engines mounted on the rear fuselage, while the ERJ 145 also has rear-fuselage-mounted engines but can be identified by their specific placement and size.",
        "Propeller engines",
        "Jet engines instead of turboprops",
        "Smaller fuselage",
        "Wing-mounted engines (turboprop in most cases)",
        "Typically more rectangular fuselage shape",
        "Low wing placement",
        "fewer fuselage windows"
    ],
    "Beechcraft 1900": [
        "Twin propellers instead of jet engines"
    ],
    "Boeing 707": [
        "T-tail design (707’s tail design is slightly different)",
        "T-tail design present in DC-10 versus conventional tail design in Boeing 707",
        "Larger and more pronounced tail fin",
        "Swept-back tail fin",
        "T-tail tailplane",
        "Landing gear: Different configurations between the two aircraft",
        "Older liveries often found on 707 models compared to newer liveries on 717 models",
        "Smaller and more rounded fuselage compared to the Boeing 767",
        "Larger wingspan",
        "A more complex landing gear configuration with more wheels",
        "Four engines but typically larger and more spaced apart",
        "Winglets on DC-10 (in some later models) whereas Boeing 707 generally lacks winglets",
        "Distinctive S-shaped tail cone (on some models)",
        "Older design with less advanced aerodynamics compared to the 757",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)"
    ],
    "Boeing 717": [
        "Fewer windows on the fuselage",
        "Longer forward fuselage compared to the Fokker 100",
        "Sleeker and more aerodynamic nose shape",
        "Smaller winglets or none, compared to MD-80 variations",
        "Lack of winglets",
        "Shorter fuselage compared to the Boeing 727",
        "Two engines mounted at the rear of the fuselage",
        "Slightly shorter fuselage length",
        "Engine placement: The Boeing 717 has engines mounted at the rear of the fuselage, whereas the Boeing 757 has engines mounted under the wings.",
        "Smaller fuselage",
        "Smaller size and fuselage length",
        "Absence of a third engine in the tail section",
        "Two engines mounted on the rear fuselage",
        "Nose shape (more pointed on the Boeing 717)",
        "Fuselage Shape: The Boeing 717 typically has a shorter and more slender fuselage compared to most versions of the Boeing 737."
    ],
    "Boeing 727": [
        "Slightly swept wings with fewer pylons for engines",
        "Wide body",
        "A slightly longer fuselage",
        "Longer, more slender fuselage",
        "More pronounced rake angle of the tail fin",
        "Slimmer fuselage"
    ],
    "Boeing 737": [
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)"
    ],
    "Boeing 747": [
        "Four engines",
        "Four engines (747)",
        "Two engines (767)",
        "Four engines (most 747 models)",
        "pronounced wing sweep",
        "longer landing gear"
    ],
    "Boeing 757": [
        "No winglets",
        "Two overwing exits for most configurations, compared to the A320 which typically has one or no overwing exits.",
        "more slender and pointed nose",
        "Longer, more slender fuselage",
        "Presence of winglets or raked wingtips (depending on the model)",
        "longer fuselage",
        "Longer fuselage",
        "longer fuselage length",
        "T-tail absent",
        "Longer fuselage with more streamlined appearance",
        "Pointed nose shape",
        "Length of fuselage (Boeing 757 is longer)",
        "Distinctive nose shape (more pointed and elongated)",
        "Tail design (Boeing 757 vertical stabilizer is more angular)",
        "More pointed and thinner vertical stabilizer (tail fin)"
    ],
    "Boeing 767": [
        "More prominent, squared-off tail fin",
        "tail fin shape",
        "Larger, slightly taller vertical stabilizer (tail fin)",
        "Wider wingspan and larger winglets",
        "The shape of the nose (the 767 has a more pointed nose compared to the 747)",
        "More prominent wingspan",
        "Taller landing gear (767 has a higher stance)",
        "Winglets on the tips of the wings (in some models)",
        "winglets",
        "Raked wingtips (angled wingtips)",
        "Presence of a larger wingspan",
        "Single bogie (two wheels) on each main landing gear",
        "Higher number of wheels on the landing gear",
        "The location and shape of the tail fin and horizontal stabilizers",
        "Two engines (one on each wing)"
    ],
    "Boeing 777": [
        "**APU Exhaust**: The position and shape of the Auxiliary Power Unit (APU) exhaust at the rear can also provide clues.",
        "Engine count: Boeing 777 has two engines, while the Airbus A340 has four engines.",
        "Six wheels per main landing gear bogie (the A330 has four)",
        "Generally longer overall length",
        "Engine size and shape (larger on the Boeing 777)",
        "Longer, slender fuselage",
        "Landing Gear: Boeing 777 has more landing gear wheels (6 wheels per main gear) than Boeing 717 (4 wheels per main gear).",
        "two engines (Boeing 777) vs. four engines (Boeing 707)",
        "Raked wingtips (A330 has winglets)"
    ],
    "C-130": [
        "Wide, boxy fuselage",
        "Short, sturdy landing gear",
        "Less streamlined body shape",
        "Two piston engines",
        "Wing shape and position: The C-130 has a straight wing positioned approximately at the mid-fuselage level, while the An-12's wings are more tapered and positioned higher on the fuselage.",
        "Tailwheel landing gear configuration",
        "Shorter landing gear",
        "Wider and more robust landing gear",
        "Shorter, stockier landing gear suited for rough airstrips",
        "Squat and utilitarian appearance",
        "T-tail structure",
        "Long, slender fuselage with efficient aerodynamics"
    ],
    "C-47": [
        "Landing gear with tailwheel configuration",
        "Landing gear: The C-47 features a tailwheel landing gear configuration, while the DC-6 typically has a tricycle landing gear system.",
        "Tail wheel landing gear",
        "Large cargo door on the side",
        "retractable landing gear",
        "Tailwheel landing gear",
        "Tailwheel landing gear configuration",
        "Wing shape (C-47 has straight wings, whereas A310 has swept-back wings)",
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "more modern aerodynamic design",
        "rear door on the right side of the fuselage",
        "Rounded fuselage",
        "Wide-body fuselage",
        "Smaller size compared to DC-10",
        "Rounded fuselage shape"
    ],
    "CRJ-200": [
        "No winglets on many models",
        "More angular, sharply swept wings"
    ],
    "CRJ-700": [
        "Generally absence of winglets",
        "Classic, older aircraft design features"
    ],
    "Cessna 172": [
        "Tandem seating (one behind the other)",
        "smaller overall size and simpler design",
        "Taildragger landing gear (main two wheels in front, small third wheel at the tail)",
        "Smaller size and more compact",
        "Traditional ‘tail-dragger’ or tricycle gear setup",
        "seating for up to 19 passengers",
        "Tailwheel or tricycle landing gear configuration",
        "Multiple engines (usually four propellers)",
        "Smaller size compared to the DHC-6",
        "Smaller size and simpler design",
        "Four-seat configuration",
        "Number of seats (Cessna 172 typically has 4 seats, Cessna 208 can seat more passengers)",
        "High-wing monoplane design",
        "2 to 4 seating capacity",
        "Smaller overall size"
    ],
    "Cessna 208": [
        "Capacity for fewer passengers (typically 9-14)",
        "Number of seats (Cessna 208 seats up to around 14, Boeing 737 seats over 130)",
        "Fixed landing gear with optional floats or skis",
        "capacity for fewer passengers and cargo",
        "Size of the aircraft (Cessna 208 is significantly smaller)",
        "sleeker, more compact fuselage",
        "lack of jet engines",
        "Capacity for approximately 9-14 passengers",
        "Fixed landing gear (non-retractable)",
        "Type of landing gear (Cessna 208 often has fixed landing gear, Boeing 737 has retractable landing gear)",
        "Propeller-driven",
        "Tail design (Cessna 208 has a single vertical stabilizer and a simpler tail)"
    ],
    "Cessna Citation": [
        "**Fuselage shape**: The fuselage of a Cessna Citation is usually sleeker and more streamlined compared to the more boxy shape of the Beechcraft 1900.",
        "**Landing gear**: The Cessna Citation often has tricycle landing gear with the main gear retracting into the wings or fuselage, while the Beechcraft 1900's landing gear retracts into nacelles on the wing.",
        "smaller, more streamlined fuselage",
        "Landing gear (can vary between models, but generally simpler than Challenger 600)",
        "Sleek, aerodynamic fuselage",
        "Generally a sleeker and more compact design",
        "Nose shape (more pointed and streamlined)"
    ],
    "Challenger 600": [
        "Typically lacks the prominent nose cone seen on the CRJ-700",
        "Fuselage mounted engines (closer to the tail)",
        "Winglets may or may not be present (as opposed to the CRJ-700 which consistently has winglets)",
        "Smaller size (Challenger 600 is smaller compared to the A310)",
        "Distinctive rounded nose",
        "Generally smaller overall size compared to the CRJ-700",
        "Distinctive, shorter landing gear",
        "Winglets that are less pronounced or sometimes absent"
    ],
    "DC-10": [
        "Lack of winglets on the wingtips",
        "T-tail configuration.",
        "Older era design features (DC-10 is a 1970s model while the A300 was introduced slightly later)"
    ],
    "DC-3": [
        "Tail design (the DC-3 has a tail-wheel (tail-dragger) configuration, while the DC-8 has a tricycle landing gear with the tail up)",
        "Fuselage shape is less boxy (DC-3) compared to the boxier DHC-6",
        "Tricycle landing gear arrangement (more modern design in DC-3)",
        "Tailwheel landing gear (DC-3) instead of tricycle landing gear (DHC-6)",
        "Twin-engine configuration",
        "twin-engine configuration",
        "absence of a cargo door",
        "shorter fuselage",
        "More rounded and classic \"streamlined\" appearance (DC-3)",
        "Smaller size and fuselage",
        "Wing shape and placement (DC-3 has low wings, DC-9 has mid-wings)",
        "Distinctive rounded fuselage shape",
        "Smaller size and shorter fuselage",
        "Aircraft body size (the DC-3 is generally smaller and shorter than the DC-8)",
        "smaller overall size"
    ],
    "DC-6": [],
    "DC-8": [
        "Presence of S-duct: The DC-10 features a prominent S-duct on the tail for the third engine, which is absent in the DC-8.",
        "Swept-back wings (DC-8)"
    ],
    "DC-9": [
        "Absence of aerodynamic improvements like winglets",
        "No winglets at the wingtips (whereas many Boeing 767 models have winglets)",
        "Longer, more cylindrical body shape",
        "Landing gear with a simpler, single-bogey main gear setup",
        "Fewer sets of landing gear (typically two main landing gears compared to the 727's three)"
    ],
    "DH-82": [
        "biplane design",
        "Vintage (1930s) look and design elements",
        "biplane structure",
        "Biplane design (two sets of wings)"
    ],
    "DHC-1": [
        "More streamlined and modern design (DHC-1) vs. more vintage, biplane design (DH-82)",
        "Tricycle landing gear in some models (DHC-1) vs. taildragger landing gear (DH-82)",
        "Vintage, military trainer appearance",
        "Tailwheel landing gear",
        "Single-wing (monoplane) design (DHC-1) vs. dual-wing (biplane) design (DH-82)",
        "More streamlined and less pronounced engine cowling",
        "Relatively smaller and lighter frame",
        "Taildragger configuration (main landing gear under the wings, with a small tailwheel)",
        "Straight and square wings with little to no dihedral",
        "Radial engine cowling (distinctive engine shape)",
        "Straight wings with a slight dihedral",
        "Smaller size and light aircraft build",
        "Landing gear (Conventional gear on DHC-1, Tricycle gear on Hawk T1)",
        "size (DHC-1 is much smaller)",
        "Smaller overall size and lighter frame"
    ],
    "DHC-6": [
        "Fixed landing gear: The DHC-6 often has fixed landing gear, whereas the Cessna 208 might have retractable gear or different landing gear configurations.",
        "Landing gear (DHC-6 often has fixed landing gear, DC-8 has retractable landing gear)",
        "Propeller presence (DHC-6 has propellers due to turboprop engines, DC-8 does not have propellers)",
        "Short takeoff and landing (STOL) design features",
        "Number of engines (DHC-6 has 2 engines, DC-8 has 4 engines)",
        "Fixed landing gear (non-retractable)",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "Shorter fuselage (DHC-6 is overall shorter in length compared to DC-3)",
        "Fuselage shape: The DHC-6 has a boxier fuselage compared to the more streamlined fuselage of the Cessna 208."
    ],
    "DR-400": [
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "Aircraft registration usually starting with \"F-\" for French registration",
        "Positioned for general aviation or private flying",
        "Single-engine",
        "Retractable tricycle landing gear",
        "Single-engine (propeller) design",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "Typically used for training, private flying, and touring",
        "Single-engine propeller (as opposed to twin jet engines)",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "Single-engine configuration",
        "Low-wing monoplane design with characteristic dihedral angle",
        "Trapezoidal wings (straight leading edge and slanted trailing edge)",
        "**Fixed landing gear**: The DR-400 typically has non-retractable landing gear.",
        "Single-engine propeller"
    ],
    "Dash 8": [
        "T-tail design (Dash 8 usually has a T-tail, while BAE 146 has a conventional tail)"
    ],
    "Dornier 328": [],
    "EMB-120": [
        "Turboprop engines (propellers) instead of jet engines",
        "twin turboprop engines (visible propellers)",
        "Twin-engine turboprop with engines mounted on the wings",
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Landing gear configuration (retractable vs. fixed)",
        "twin turboprop engines",
        "Fuselage Length: The EMB-120 has a comparatively shorter fuselage, while the MD-90 has a longer, more slender fuselage.",
        "Retractable landing gear",
        "retractable landing gear",
        "turboprop engines",
        "Turboprop engines",
        "Twin turboprop engines mounted on the wings",
        "Twin-engine setup",
        "Sleeker and more aerodynamic nose profile",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the MD-90 has two jet engines mounted at the rear of the fuselage."
    ],
    "Embraer E-Jet": [
        "T-tail",
        "Distinctive \"T-tail\" configuration in some E-Jet models (e.g., E170)"
    ],
    "Embraer ERJ 145": [
        "Fuselage Shape: The ERJ 145 has a more tapered and jet-like fuselage, while the Beechcraft 1900 has a boxier fuselage typical of turboprop aircraft.",
        "Longer, slender fuselage",
        "Fuselage shape: The overall shape and proportions of the fuselage can be distinguishing factors.",
        "Fewer windows along the fuselage",
        "Landing gear: Differences in the landing gear configuration can help differentiate between the two aircraft.",
        "Jet Engines: The ERJ 145 has two rear-mounted jet engines, whereas the Beechcraft 1900 has two turboprop engines mounted on the wings.",
        "Wing configuration: Look at the wing shape and placement relative to the fuselage. The Embraer ERJ 145 has swept wings, while the Fokker 70 may have a different wing configuration.",
        "Wing Design: The wings of the ERJ 145 have a slightly swept-back design, whereas the Beechcraft 1900 has straighter wings.",
        "Length: The ERJ 145 is considerably longer than the Beechcraft 1900.",
        "Engine placement: ERJ 145 engines are mounted slightly below the wing line, while the CRJ-200 engines are mounted higher up in line with the wings.",
        "Absence of winglets",
        "Smaller fuselage diameter",
        "Absence of additional winglets and extended range fuel tanks",
        "Narrow fuselage",
        "T-tail configuration"
    ],
    "Embraer Legacy 600": [
        "Tail Design: The Legacy 600 has a more distinctive T-tail design, while the E-Jet's tail is more conventional for larger commercial aircraft.",
        "Different tail cone design, more pointed on the Legacy 600",
        "More pronounced nose shape",
        "Winglets: The Legacy 600 usually has a more pronounced upward curve on its winglets compared to the relatively simpler winglets on the E-Jet series."
    ],
    "Eurofighter Typhoon": [
        "Canard foreplanes",
        "Canards (small forewings near the front)",
        "Canard foreplanes (small, wing-like structures near the nose)",
        "Canard foreplanes near the cockpit",
        "Canards (small wing-like structures near the nose) on the Eurofighter Typhoon",
        "Presence of weapons or weapon mounts",
        "canard forewings",
        "canards (small forward wings near the nose)",
        "Canards (small forewings near the cockpit)",
        "Twin-engine layout",
        "Sharp, pointed nose cone",
        "Afterburning turbofan engines",
        "presence of underwing stores (weapons or fuel tanks)",
        "absence of canards",
        "Landing gear with more wheels to support the heavier aircraft"
    ],
    "F-16": [
        "Smaller size and sharper profile (F-16)",
        "single engine",
        "Single-engine configuration",
        "single-engine design",
        "Single-engine design",
        "Single-engine jet",
        "Delta or trapezoidal wing shape",
        "smaller size and sleeker profile",
        "Delta or cropped delta wing shape",
        "V-tail or single vertical stabilizer",
        "Small size compared to commercial airliners like the Boeing 757",
        "Sleek, single-engine design",
        "Wing shape: F-16 wings are more delta-shaped and blended with the fuselage; F/A-18 has straight-edged, trapezoidal wings.",
        "Shorter fuselage length",
        "Wing-mounted weapons or external fuel tanks"
    ],
    "F/A-18": [
        "military-grade weaponry and pylons",
        "Wingtip missile rails or pylons",
        "Canards",
        "Twin-engine",
        "Dual engines",
        "Presence of external weaponry and ordnance",
        "LEX (Leading Edge Extensions) running from the fuselage",
        "Absence of visible weaponry or military features",
        "external weaponry or pylons for missiles and bombs",
        "Small, compact frame",
        "Size: The F/A-18 is significantly smaller.",
        "twin-engine layout with afterburners",
        "High-wing design",
        "Catapult launch bar (for aircraft carriers)",
        "Sharp, angular design"
    ],
    "Falcon 2000": [
        "Retractable landing gear vs. fixed landing gear",
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure."
    ],
    "Falcon 900": [
        "More streamlined and sleek design",
        "Overall size: The Falcon 900 may appear slightly smaller and more compact compared to the Embraer Legacy 600.",
        "Dassault Falcon logo or branding",
        "Sleeker, more streamlined fuselage",
        "Fuselage: The Falcon 900 fuselage appears more curved and streamlined, while the Embraer Legacy 600 has a relatively straighter cylindrical shape.",
        "Winglets: The Embraer Legacy 600 often has noticeable winglets at the wingtips, whereas the Falcon 900 typically does not.",
        "Business jet configuration, typically fewer windows",
        "Sleeker fuselage",
        "Winglets: The Falcon 900 often has more pronounced winglets compared to the Challenger 600.",
        "T-tail: The Falcon 900 features a distinctive T-tail design.",
        "Manufacturer logos or specific livery",
        "T-tail: The Falcon 900 features a T-tail configuration, while the Embraer Legacy 600 has a conventional tail.",
        "More winglets or wing components",
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "Shorter and more compact size compared to commercial jets like the Embraer E-Jet"
    ],
    "Fokker 100": [
        "Landing gear placement and structure."
    ],
    "Fokker 50": [
        "Propellers: The Fokker 50 has two turboprop engines with visible propellers, whereas the Fokker 70 is a jet aircraft with turbofan engines and no propellers.",
        "**Nose shape**: The Fokker 50 typically has a more rounded and bulbous nose, while the Embraer ERJ 145 has a narrower and pointed nose.",
        "More rounded nose",
        "**Propellers**: The Fokker 50 is a turboprop aircraft and has large propellers on its wings, while the Embraer ERJ 145 is a jet and has jet engines.",
        "Fokker 50 has more rounded edges",
        "Fokker 50 has a more rounded nose",
        "Distinctive tail design difference"
    ],
    "Fokker 70": [],
    "Global Express": [
        "Larger, more aerodynamically efficient winglets or wingtip extensions",
        "Sleeker, more aerodynamic nose shape",
        "Winglets with distinct shape",
        "Winglets on the tips of the wings",
        "more elongated and pointed nose",
        "manufacturer logo (Bombardier for Global Express, Dassault for Falcon 900)",
        "a T-tail with a more pronounced curve",
        "Sleeker, more elongated fuselage",
        "Longer and more pointed nose"
    ],
    "Gulfstream": [
        "Signature \"G\" logo on tail (if present)",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Different nose shape, less pointed than Gulfstream",
        "Sleeker, more streamlined fuselage",
        "logo/branding",
        "Wingtip winglets (on some Gulfstream models)",
        "Specific nose shape and radome design",
        "Distinctive nose shape",
        "Trijet or twinjet configuration (if specifically the Falcon 2000, it’s a twinjet)",
        "tail design",
        "Distinct Gulfstream logo/branding",
        "Winglets with a different design compared to Gulfstream",
        "winglets",
        "Sleek, streamlined fuselage shape ",
        "T-tail"
    ],
    "Hawk T1": [
        "Size: The Hawk T1 is much smaller than the DC-10.",
        "Sleeker, streamlined fuselage",
        "Sleeker, more aerodynamic profile (Hawk T1) vs. more traditional, boxier profile (DHC-1)",
        "Design: The Hawk T1 has a streamlined, agile design for maneuverability, contrasting with the DC-10's bulkier and broader design meant for high-capacity passenger travel.",
        "Modern, sleek fuselage",
        "Swept-back wings (Hawk T1) vs. straight wings (DHC-1)",
        "Short fuselage",
        "Rounder, more bulbous fuselage",
        "Longer, sleeker fuselage typical of a jet trainer",
        "Engines: The Hawk T1 typically has one jet engine, whereas the DC-10 has three engines (two under the wings and one at the base of the vertical stabilizer).",
        "Single jet engine exhaust at the rear (Hawk T1)",
        "Twin jet engines mounted under each wing (A300)",
        "Pointed nose",
        "Wings: The Hawk T1 has a straight-wing configuration, while the DC-10 has a swept-wing design generally seen in large commercial airliners.",
        "Tail: The Hawk T1 has a T-tail configuration, while the DC-10 has an engine mounted at the base of the vertical stabilizer."
    ],
    "Il-76": [
        "T-shaped tail",
        "Fuselage shape: The Il-76 has a wider, more cylindrical fuselage designed for cargo, while the Boeing 727 has a narrower, more streamlined fuselage optimized for passenger travel.",
        "Three engines (two on the wings and one in the tail)",
        "Tall, boxy fuselage"
    ],
    "King Air": [
        "Propellers (King Air has turboprop engines, while Cessna Citation has jet engines)",
        "Landing gear (King Air often has retractable tricycle landing gear including the forward gear, while Falcon 2000 has a more robust and streamlined landing gear system adjusted for jet performance)",
        "Engine placement: King Air models have engines mounted on the wings, while Gulfstream jets have engines mounted on the rear fuselage.",
        "Propeller engines (King Air has twin turboprop engines, while Falcon 2000 has jet engines)",
        "Typically fewer windows",
        "Propellers: King Air aircraft typically have propellers, while Gulfstream jets are known for their turbofan engines."
    ],
    "L-1011": [
        "Rear fuselage shape: The L-1011 has a somewhat boxy rear end due to the tail engine configuration, which is different from the sleeker rear fuselage of the A340.",
        "**Winglets**: The A300 might have winglets on the tips of its wings depending on the variant, while the L-1011 does not feature winglets.",
        "Overall fuselage design: The L-1011 may have a slightly shorter, more stubby appearance compared to the longer, streamlined look of the A340.",
        "Generally larger size compared to the A320",
        "Larger wing span in proportion to fuselage compared to A310",
        "Door and window arrangement (Differences in the positioning and alignment of doors and windows)",
        "Winglets or absence thereof (Boeing 757 often has winglets)",
        "S-shaped air intake for the tail engine",
        "Wider, more rounded fuselage",
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "Larger, more rounded tail engine housing",
        "L-1011 often has a more rounded nose compared to the DC-9's more pointed design",
        "Wider fuselage",
        "Circular doors on the fuselage",
        "More angular-wing planes at the wing root"
    ],
    "MD-11": [
        "Landing Gear: The MD-11 has a different landing gear configuration, including a center landing gear, which is not present in the MD-80.",
        "Sharp, angled winglets (on some models)",
        "Tail engine intake: The MD-11’s tail engine has a noticeable air intake at the base of the vertical stabilizer, which is absent in the Boeing 767's design.",
        "Three engines: The MD-11 has three engines, with one located on the tail, whereas the Boeing 767 has only two engines, both mounted under the wings.",
        "Trijet Configuration: The MD-11 has three engines, with one engine at the tail section and two mounted under the wings, whereas the MD-80 has two engines mounted at the rear fuselage.",
        "Three engines (two under wings and one in the tail)",
        "Trijet engine configuration (one engine on the tail and two under the wings)",
        "three engines (one on each wing and one in the tail)",
        "The MD-11 typically has a slightly wider and longer tail with a distinct APU exhaust at the tail cone, whereas the MD-90 does not have this feature",
        "a more modern, aerodynamic shape",
        "Third engine exhaust is longer and more tapered",
        "Larger and more prominent landing gear",
        "Nose shape: the MD-11 has a slightly more pointed nose compared to the A310.",
        "Tail design: the MD-11's third engine is located at the base of the vertical stabilizer (tail fin), creating a distinct tail design.",
        "Winglets: the MD-11 has winglets (small vertical stabilizers) at the tips of the wings, whereas the A310 does not."
    ],
    "MD-80": [],
    "MD-90": [
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "absence of the third engine at the tail (MD-90).",
        "Landing gear: MD-90's landing gear is located differently compared to the wide body design of A300.",
        "Winglets (some MD-90s have winglets while MD-80s generally do not)"
    ],
    "Metroliner": [
        "landing gear with fairings",
        "Fixed landing gear (in some models)",
        "Landing gear position (retractable gear in the wings for Metroliner)",
        "Retractable tricycle landing gear",
        "Smaller size compared to EMB-120",
        "Landing gear positioned under the wings",
        "Propeller-driven engines ",
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "Turboprop engines on the wings",
        "elongated fuselage",
        "Fuselage-mounted turboprop engines",
        "Twin turboprop engines mounted close to the fuselage",
        "wing-mounted engines"
    ],
    "PA-28": [
        "**Wing Position**: The PA-28 is a low-wing aircraft, meaning its wings are attached to the bottom of the fuselage, whereas the DHC-1 (Chipmunk) has a low arrangement but appears more middle due to its more trainer-like structure.",
        "**Engine Cowling**: The PA-28’s engine cowling is more streamlined and integrated, whereas the DHC-1 might have more visible engine parts or a prominent radial engine look.",
        "**Fuselage Shape:** The PA-28 generally has a more rounded, tubular fuselage, whereas the SR-20 has a more streamlined and tapered fuselage.",
        "**Fuselage Shape**: The PA-28 has a more streamlined, modern fuselage shape, while the DHC-1 tends to have a more classic, military trainer look, with a bubble canopy.",
        "Single propeller at the front",
        "Small, single-engine design",
        "Tricycle landing gear",
        "**Nose Shape**: The PA-28 often has a more pointed, aerodynamic nose cone, whereas the DHC-1 has a blunter, more rounded nose profile.",
        "**High Wing vs. Low Wing:** PA-28 typically has a low wing configuration, meaning the wings are mounted below the fuselage.",
        "Single-engine design",
        "**Wing Tips:** The PA-28 has more traditional wing tips, whereas the SR-20 often has winglets or more advanced aerodynamic designs.",
        "Absence of high-mounted wings or twin engines on the wings",
        "Propeller at the front of the aircraft",
        "fixed landing gear (most models)",
        "single propeller"
    ],
    "SR-20": [
        "Single-engine (propeller) aircraft",
        "Cirrus Aircraft logo",
        "Single-engine piston aircraft",
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Smaller, single-engine aircraft design",
        "**Single Engine:** The SR-20 has a single engine, typically a piston engine mounted at the front, whereas the EMB-120 has twin turboprop engines mounted on the wings.",
        "Landing Gear: The SR-20 has fixed tricycle landing gear, whereas the A310 has retractable landing gear suited for larger aircraft.",
        "Fixed tricycle landing gear with a more streamlined design (PA-28 has less aerodynamic landing gear)",
        "Generally used for personal or flight training purposes",
        "**Landing Gear:** The SR-20 usually has a nosewheel (tricycle) landing gear configuration, while the EMB-120 also has a tricycle landing gear but its struts are more robust to support the larger aircraft.",
        "Cirrus logo",
        "**Size:** The SR-20 is a smaller, single-engine aircraft designed for general aviation and personal use, while the EMB-120 is a larger, twin-engine regional airliner.",
        "**Windows and Doors:** The SR-20 has fewer windows and a more streamlined fuselage compared to the EMB-120, which has multiple cabin windows along the side and larger entry doors for passengers and cargo.",
        "Fixed tricycle landing gear",
        "Retractable landing gear (in later models)"
    ],
    "Saab 2000": [
        "longer, sleeker fuselage",
        "T-tail design but different in shape compared to Saab 2000",
        "Logo and branding (Airlines operating these aircraft may have distinct liveries.)",
        "Winglets on the wingtips",
        "Taller landing gear",
        "Sleeker, more streamlined fuselage",
        "slightly pointed nose",
        "Presence of winglets at the tips of the wings (Saab 2000)",
        "T-tail design"
    ],
    "Saab 340": [
        "**Landing Gear**: The landing gear of the Saab 340 is typically more prominent and may be more visible in photos compared to the sleeker design of the landing gear of the Embraer ERJ 145.",
        "Tricycle landing gear",
        "Lower landing gear structure",
        "**Landing Gear**: Differences in the landing gear configuration can also be observed, with the Saab 2000 typically having a more robust design owing to its higher performance characteristics.",
        "Distinctive T-tail",
        "Rounder nose shape",
        "Saab logo or specific airline livery indicative of Saab 340 operators",
        "More elongated fuselage",
        "**Fuselage Length**: The Saab 340 has a shorter, stubbier fuselage compared to the longer, more slender fuselage of the Embraer ERJ 145."
    ],
    "Spitfire": [
        "tailwheel landing gear",
        "Tailwheel landing gear",
        "Tail wheel",
        "Retractable landing gear",
        "Narrow landing gear (retractable)",
        "Smaller size compared to the jet",
        "Classic tailplane (Spitfire) vs. swept-back tailplane (Hawk T1)",
        "Sleek, aerodynamic fuselage",
        "Elliptical wings (Spitfire) vs. straight wings with slight sweepback (Hawk T1)",
        "Lack of turboprop engines",
        "Smaller overall size",
        "Tailwheel undercarriage",
        "Monoplane with elliptical wings",
        "Shorter fuselage",
        "Propeller blades (typically three-bladed for early models)"
    ],
    "Tornado": [
        "single or tandem cockpit configuration",
        "Sleeker, more angular appearance suitable for combat",
        "Twin-engine configuration",
        "twin-engine configuration",
        "swept wings with variable geometry (adjustable sweep angle)",
        "smaller, more compact airframe",
        "Swing-wing design",
        "Twin-engine design",
        "military insignia or markings",
        "no visible cockpit or engines",
        "Compact and aerodynamic airframe",
        "absence of solid structure and wings typical of aircraft",
        "Presence of external weapon mounts or ordnance",
        "landing gear (if visible in a static or landing/takeoff photo)",
        "Canopy for pilot and co-pilot"
    ],
    "Tu-134": [
        "T-tail design with higher position (Yak-42)",
        "Glass nose or radar dome at the front (depending on the variant)",
        "Smaller size",
        "Smaller size compared to the DC-8 ",
        "Distinctive nose shape with radar dome (in Tu-134)"
    ],
    "Tu-154": [
        "A more elongated fuselage compared to the BAE-125",
        "National or airline markings typical of Russian or Eastern Bloc aviation during its era",
        "Shorter, more rounded nose compared to the DC-8",
        "Distinctive \"glass nose\" often seen on Tu-154s",
        "Shorter, stubbier fuselage",
        "Distinctive \"doghouse\" structure for the central engine's air intake above the fuselage",
        "Longer fuselage in comparison to the DC-9",
        "Three rear-mounted engines (as opposed to the Yak-42's two engines)",
        "Narrow fuselage compared to the Boeing 707",
        "Trijet configuration (three engines, two under the wings and one at the rear)",
        "Cockpit window shape: The cockpit windows on the Tu-154 might have different shapes and arrangements compared to the 727.",
        "Landing gear configuration (Tu-154 has a different setup compared to the Boeing 707)",
        "Swept-back wings with pronounced anhedral (downward angle)",
        "Three engines: The Tu-154 has three engines, one on each side of the fuselage, near the rear, and one in the tail, while the A340 has four engines under the wings.",
        "Winglets on some models of the Tu-154"
    ],
    "Yak-42": [
        "lack of visible propellers (ATR-72 has two propellers)",
        "single-aft entry door vs. multiple side entry doors on the ATR-72",
        "No propellers (Saab 2000 is a turboprop aircraft, while Yak-42 is a jet)",
        "Presence of winglets on later models",
        "three jet engines (one on the tail, two on the wings)",
        "Number of engines (Yak-42 has three jet engines, Saab 340 has two propeller engines)",
        "Slightly shorter fuselage",
        "Smaller overall size and wingspan compared to the Boeing 717",
        "Yak-42 has rounded wing tips, while Tu-154 has more angular ones",
        "Three engines (one in the tail and two under the wings)",
        "T-tailed trijet configuration (Yak-42 has three engines positioned at the rear)",
        "Number of windows (Differences in the number and arrangement of passenger windows)"
    ]
}