{
    "A300": [
        "Slight dihedral wings (wings angled slightly upwards) ",
        "Slightly shorter fuselage compared to DC-10",
        "Positioned lower, closer to the ground when on the ground (due to shorter landing gear)",
        "Number of engines: The A300 has two engines mounted under its wings, while the Challenger 600 typically has two engines mounted on the rear fuselage.",
        "Wing configuration: The A310 has wingtip fences (small vertical stabilizers at the end of each wing), which are not present on earlier models of the A300.",
        "Fuselage shape: The A300 has a wider, more cylindrical fuselage, while the Challenger 600 has a narrower fuselage.",
        "Absence of a characteristic \"S-duct\" engine intake on the tail",
        "Lack of wingtip fences or sharklets (classic A300s)",
        "Tail design: The A300 has a vertical stabilizer with a more prominent and rounded design, whereas the Challenger 600's tail is smaller and more streamlined.",
        "Tail design (differences in vertical stabilizer and rudder)",
        "Smaller overall size",
        "A300 typically does not feature a T-tail (MD-90 has a T-tail configuration)",
        "shorter fuselage",
        "Landing gear: The A300 has a more complex landing gear structure due to its larger size, while the Challenger 600 has a simpler, more compact landing gear.",
        "Wider and slightly more squared-off engine cowlings"
    ],
    "A310": [
        "Two engines mounted under the wings, rather than four engines.",
        "More modern fuselage design with fewer windows",
        "T-tails (tailplane)",
        "distinctive tailcone shape (more pointed on A310)"
    ],
    "A320": [
        "Absence of rear fuselage-mounted engines",
        "landing gear design (A320 has a simpler main landing gear structure)",
        "The absence of an extra set of landing gear near the wing roots  ",
        "sharklets (tip extensions) on wings (A320 typically has these)",
        "nose shape",
        "Rounded nose  ",
        "More modern, rounded nose shape",
        "Winglets with a vertical upturn instead of raked wingtips (common in some 767 models)",
        "T-tail design",
        "Proportions of the fuselage to wings  ",
        "Wingtips or Sharklets on the end of the wings",
        "Tail-mounted engines",
        "Two-wheel main landing gear (as opposed to the A300's four-wheel bogeys)"
    ],
    "A330": [
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "Winglets on the wingtips",
        "Winglets with a distinctive upward curve (sharklets)",
        "Newer design with longer range and more passenger capacity",
        "Winglets with a curved design",
        "**Wingtips:** A330 typically has wingtip devices known as winglets or sharklets, while early models of the Boeing 737 have no winglets and later models may have split scimitar winglets.",
        "Length of fuselage: The A330 generally has a longer fuselage than the A310.",
        "Different wingtip design (depending on the variant)",
        "Distinctive winglets",
        "Shorter fuselage",
        "Typically a slightly shorter and higher tail compared to the Boeing 767",
        "Winglets: The A330 often features larger, more prominent winglets compared to the A310.",
        "Longer fuselage",
        "Tail height: The vertical tail fin of the A330 is often taller than that of the A310.",
        "Curved wing leading edges"
    ],
    "A340": [],
    "A380": [
        "Typically wider fuselage",
        "four engines mounted closer to the fuselage",
        "Wingtip fences or winglets that are larger and more vertical",
        "Wider and taller fuselage",
        "four engines",
        "Four engines",
        "Larger overall size in terms of length and wingspan",
        "Distinctive hump running the entire length of the fuselage",
        "Four engines mounted under the wings",
        "Landing gear configuration with more wheels",
        "Larger overall size and wingspan",
        "Four engines under the wings",
        "Often a more prominent nose design",
        "Generally more massive and larger fuselage",
        "slightly different tail design"
    ],
    "ATR-42": [
        "More rounded nose (ATR-42)",
        "Different engine nacelle shapes (ATR-42 has more teardrop-shaped nacelles)"
    ],
    "ATR-72": [],
    "An-12": [
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "An-12 has a rear loading ramp, while DHC-1 does not",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "Soviet-era design aesthetics, often more angular and utilitarian compared to the sleek and modern appearance of an A320",
        "Different engine nacelle shape (more streamlined compared to C-130)",
        "High-wing design, as opposed to the low-wing design of an A320",
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "Glass nose (with windows offering a more pointed front profile)",
        "High-wing design for An-12 versus mid-wing for DHC-1",
        "Ramp/cargo door on An-12",
        "Large cargo door at the rear",
        "Shorter fuselage than MD-11",
        "Cargo doors",
        "Landing gear configuration (An-12 has retractable landing gear, while DHC-1 has fixed gear)"
    ],
    "BAE 146": [
        "Steep landing and takeoff capabilities",
        "Stubbier, more rounded nose",
        "Distinctive airbrake on the tail (sometimes deployed)"
    ],
    "BAE-125": [
        "Generally more rounded nose",
        "A more pronounced, bulbous nose",
        "Jet engines instead of turboprops",
        "Straight wings with winglets or no winglets at all",
        "lacks propellers (as ATR-72 is a turboprop)",
        "Longer, more streamlined fuselage ",
        "Cylindrical nose"
    ],
    "Beechcraft 1900": [
        "Straight winglets on Beechcraft 1900 vs. raked or no winglets on Embraer ERJ 145"
    ],
    "Boeing 707": [
        "T-tail design (707’s tail design is slightly different)",
        "Older design with less advanced aerodynamics compared to the 757",
        "Smaller and more streamlined nose section",
        "Larger and more pronounced tail fin",
        "T-tail tailplane",
        "T-tail design present in DC-10 versus conventional tail design in Boeing 707",
        "Four engines but typically larger and more spaced apart",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)",
        "Wings: The Boeing 707's wings are higher and more swept than the 727's.",
        "A more streamlined and pointed nose",
        "A slightly larger and wider fuselage",
        "Larger wingspan",
        "Larger fuselage",
        "A more complex landing gear configuration with more wheels",
        "More rounded and shorter fuselage"
    ],
    "Boeing 717": [
        "Sleeker and more aerodynamic nose shape",
        "Lack of winglets",
        "Winglets at the wingtips (optional on Boeing 717 but not available on Fokker 100)",
        "Smaller winglets or none, compared to MD-80 variations",
        "Longer forward fuselage compared to the Fokker 100",
        "Nose shape (more pointed on the Boeing 717)"
    ],
    "Boeing 727": [
        "Wide body",
        "Longer, more slender fuselage",
        "Distinctive nose shape",
        "Narrower fuselage diameter compared to the DC-8",
        "A slightly longer fuselage",
        "More pronounced rake angle of the tail fin"
    ],
    "Boeing 737": [
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)",
        "Winglets (upward-curving extensions) on the wingtips in newer models",
        "Winglets at the wingtips (737s often have winglets, 717s typically do not)"
    ],
    "Boeing 747": [
        "More pointed and streamlined nose",
        "Longer fuselage",
        "More pointed nose shape",
        "Longer fuselage compared to the height of the tail (747)",
        "larger fuselage",
        "Wider and taller fuselage",
        "Hump-like structure near the front",
        "Distinctive nose shape, flatter and broader compared to the A340",
        "Distinctive nose shape ",
        "Distinctive nose shape",
        "Taller landing gear",
        "larger, bulkier fuselage",
        "Shorter and more robust fuselage compared to the more elongated fuselage of the 757",
        "Higher and more bulbous tail fin compared to the 747",
        "Taller landing gear (747)"
    ],
    "Boeing 757": [
        "Two overwing exits for most configurations, compared to the A320 which typically has one or no overwing exits.",
        "Longer, more slender fuselage",
        "4-wheeled main landing gear (compared to A330's 6-wheeled)",
        "T-tail absent",
        "Presence of winglets or raked wingtips (depending on the model)",
        "No winglets",
        "Longer fuselage with more streamlined appearance",
        "Taller landing gear",
        "taller landing gear",
        "more slender and pointed nose",
        "Longer fuselage",
        "longer fuselage",
        "Length of fuselage (Boeing 757 is longer)",
        "Shorter landing gear and tail height",
        "Underbelly shape: The 757 has a sleeker, more slender underbelly, whereas the 767 has a more rounded and wider underbelly."
    ],
    "Boeing 767": [
        "Winglets on the tips of the wings (in some models)",
        "More prominent, squared-off tail fin",
        "More prominent wingspan",
        "Winglets that are typically larger on the 757 (if both are equipped with winglets)",
        "winglets",
        "Wider wingspan and larger winglets",
        "Bigger engines, often with a more elongated, oval shape",
        "Larger size overall",
        "Larger overall size",
        "Differences in engine shape and mounting depending on specific engine models used",
        "Modern, wing-mounted engines (versus the more classic, under-wing engines of the 707)",
        "tail fin shape",
        "Winglets (depending on specific 767 model, but generally smaller winglets compared to modern 747s)",
        "Presence of a larger wingspan",
        "number of engines"
    ],
    "Boeing 777": [
        "**APU Exhaust**: The position and shape of the Auxiliary Power Unit (APU) exhaust at the rear can also provide clues.",
        "Engine count: Boeing 777 has two engines, while the Airbus A340 has four engines.",
        "Generally longer overall length",
        "Raked wingtips (A330 has winglets)",
        "Engine size and shape (larger on the Boeing 777)",
        "Modern, more streamlined design (Boeing 777)",
        "Raked wingtips (Boeing 777 wingtips are curved and angled back slightly)",
        "presence of a supercritical wing design on the 777 for better fuel efficiency",
        "larger size and wingspan",
        "Raked wingtips (winglets that are angled outward instead of upward)",
        "raked wingtips (777)",
        "Winglets: Boeing 777 typically does not have winglets, while the A340 often features winglets.",
        "Advanced, high-bypass turbofan engines (Boeing 777)",
        "More elongated and aerodynamically efficient nose (Boeing 777)",
        "Winglets: Older Boeing 717 models do not have winglets, whereas Boeing 777 may have them."
    ],
    "C-130": [
        "Rear cargo ramp/door",
        "Wide, boxy fuselage",
        "Short, sturdy landing gear",
        "Rear cargo ramp for loading and unloading",
        "Rear cargo ramp and door",
        "Rear loading ramp",
        "Large rear cargo ramp",
        "Large rear cargo ramp and door",
        "Loading ramp at the rear",
        "Two piston engines",
        "A large rear loading ramp"
    ],
    "C-47": [
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "Landing gear: The C-47 features a tailwheel landing gear configuration, while the DC-6 typically has a tricycle landing gear system.",
        "Wing shape (C-47 has straight wings, whereas A310 has swept-back wings)",
        "Landing gear with tailwheel configuration",
        "Smaller size compared to DC-10",
        "T-tail design",
        "Trijet configuration (three engines)",
        "Two engines: The C-47 has two engines, whereas the DC-6 has four.",
        "Single tail fin",
        "Tailwheel landing gear configuration",
        "Tail wheel landing gear",
        "Large size compared to C-47",
        "Tailwheel configuration",
        "Straight, simpler wings",
        "Propellers (C-47 has propellers, A310 has jet engines)"
    ],
    "CRJ-200": [
        "More angular, sharply swept wings",
        "No winglets on many models",
        "Absence of winglets",
        "Engines also at the rear but slightly different mounting"
    ],
    "CRJ-700": [
        "More complex landing gear structure",
        "Landing gear configuration",
        "T-tail design as well, but a more robust fuselage",
        "Different landing gear configuration (the CRJ-700 has taller landing gear)",
        "Engine placement and shape",
        "Engine placement closer to the wings",
        "Generally absence of winglets",
        "T-tail structure with slight differences in size and angle"
    ],
    "Cessna 172": [
        "Traditional ‘tail-dragger’ or tricycle gear setup",
        "Tailwheel or tricycle landing gear configuration",
        "Fixed landing gear (compared to the often retractable gear on the DHC-1)",
        "Tricycle landing gear (nose wheel included)",
        "Retractable landing gear",
        "retractable landing gear",
        "Fixed, non-retractable landing gear",
        "Tricycle landing gear with a single nose wheel",
        "Type of landing gear (Cessna 172 has fixed landing gear, while Cessna 208 can have either fixed or retractable landing gear)",
        "smaller overall size and simpler design",
        "Smaller size and simpler design",
        "Fixed landing gear",
        "fixed landing gear",
        "Taildragger landing gear (main two wheels in front, small third wheel at the tail)",
        "Multiple engines (usually four propellers)"
    ],
    "Cessna 208": [
        "fixed landing gear",
        "Fixed landing gear",
        "Fixed landing gear (non-retractable)",
        "Tricycle landing gear",
        "Fixed landing gear with optional floats or skis",
        "lack of jet engines",
        "capacity for fewer passengers and cargo",
        "Capacity for approximately 9-14 passengers",
        "Number of seats (Cessna 208 seats up to around 14, Boeing 737 seats over 130)"
    ],
    "Cessna Citation": [
        "**Fuselage shape**: The fuselage of a Cessna Citation is usually sleeker and more streamlined compared to the more boxy shape of the Beechcraft 1900.",
        "Landing gear (can vary between models, but generally simpler than Challenger 600)",
        "**Size:** Cessna Citations are generally smaller.",
        "**Nose Shape:** Cessna Citations often have a more pointed nose. ",
        "size",
        "**Tail design**: The Cessna Citation often features a T-tail configuration, whereas the Beechcraft 1900 has a conventional tail design.",
        "Swept wings",
        "swept wings",
        "**Wing configuration**: The Cessna Citation usually has a straight wing design, whereas the Beechcraft 1900 has a low-wing design.",
        "smaller size",
        "Smaller size",
        "Less pronounced nose shape compared to Embraer Legacy 600",
        "Nose shape (more pointed and streamlined)",
        "**Landing gear**: The Cessna Citation often has tricycle landing gear with the main gear retracting into the wings or fuselage, while the Beechcraft 1900's landing gear retracts into nacelles on the wing.",
        "Fewer windows on the fuselage"
    ],
    "Challenger 600": [
        "Winglets may or may not be present (as opposed to the CRJ-700 which consistently has winglets)",
        "Winglets that are less pronounced or sometimes absent",
        "T-tail configuration",
        "Generally smaller overall size compared to the CRJ-700",
        "Fuselage mounted engines (closer to the tail)",
        "Typically lacks the prominent nose cone seen on the CRJ-700"
    ],
    "DC-10": [
        "T-tail configuration.",
        "Engine on the tail: On the DC-10, the tail engine is mounted just above the fuselage and in front of the vertical stabilizer, whereas the L-1011 has its tail engine embedded in the fuselage with an S-duct.",
        "Wider fuselage.",
        "Large, distinctive tail engine intake.",
        "Lack of winglets on the wingtips",
        "Older era design features (DC-10 is a 1970s model while the A300 was introduced slightly later)",
        "Larger wingspan and overall size.",
        "engine placement (DC-10 has one engine on the tail and two under the wings, DC-3 has engines only on the wings)",
        "Three engines: one under each wing and one at the base of the vertical stabilizer."
    ],
    "DC-3": [
        "Tailwheel landing gear (DC-3) instead of tricycle landing gear (DHC-6)",
        "Tricycle landing gear arrangement (more modern design in DC-3)",
        "Tailwheel (as opposed to nosewheel)",
        "More rounded and classic \"streamlined\" appearance (DC-3)",
        "Fuselage shape is less boxy (DC-3) compared to the boxier DHC-6",
        "Tailwheel landing gear",
        "tailwheel landing gear (taildragger)",
        "twin-engine configuration",
        "Twin-engine configuration",
        "Rounded, non-retractable tail wheel (DC-3) versus retractable tricycle landing gear (DC-6)",
        "smaller overall size",
        "absence of a cargo door",
        "Low-wing monoplane design",
        "Smaller size and fuselage",
        "shorter fuselage"
    ],
    "DC-6": [
        "Tail Design: DC-6 has a tricycle landing gear (nose gear), and a vertical stabilizer without a dorsal fillet, while the C-47 has a tailwheel landing gear and a more prominent dorsal fillet on the vertical stabilizer.",
        "Wing shape: The DC-6 wings have a more pronounced taper, while the DC-3 wings are relatively straighter.",
        "Lack of winglets (many Boeing 757s have winglets on the tips of their wings)"
    ],
    "DC-8": [
        "Longer and thinner profile compared to the more compact, modern look of the A320",
        "The presence of a more prominent wing dihedral angle (DC-8)"
    ],
    "DC-9": [
        "No winglets at the wingtips (whereas many Boeing 767 models have winglets)"
    ],
    "DH-82": [
        "Vintage (1930s) look and design elements",
        "biplane design",
        "biplane structure",
        "smaller size overall",
        "Smaller size overall",
        "Biplane design (two sets of wings)",
        "simpler, vintage design (typically from the 1930s)",
        "Narrow fuselage",
        "wooden and fabric construction",
        "Wooden and fabric construction",
        "smaller size ",
        "smaller size",
        "Smaller size",
        "Biplane configuration (two sets of wings)"
    ],
    "DHC-1": [
        "Tricycle landing gear in some models (DHC-1) vs. taildragger landing gear (DH-82)",
        "Vintage, military trainer appearance",
        "More streamlined and modern design (DHC-1) vs. more vintage, biplane design (DH-82)",
        "More streamlined and less pronounced engine cowling",
        "Single-wing (monoplane) design (DHC-1) vs. dual-wing (biplane) design (DH-82)",
        "Wing shape and layout (straight wings on DHC-1, swept wings on Hawk T1)",
        "Taildragger configuration (main landing gear under the wings, with a small tailwheel)",
        "Straight wings with a slight dihedral",
        "More streamlined, military trainer appearance",
        "Straight and square wings with little to no dihedral",
        "Tailwheel landing gear",
        "Smaller size and light aircraft build",
        "Landing gear (Conventional gear on DHC-1, Tricycle gear on Hawk T1)",
        "Relatively smaller and lighter frame",
        "Wing placement: The DHC-1 has low-wing configuration, with the wings positioned lower on the fuselage, whereas the A310 has a mid or high-wing configuration relative to its size."
    ],
    "DHC-6": [
        "Fixed landing gear: The DHC-6 often has fixed landing gear, whereas the Cessna 208 might have retractable gear or different landing gear configurations.",
        "Landing gear (DHC-6 often has fixed landing gear, DC-8 has retractable landing gear)",
        "Propeller presence (DHC-6 has propellers due to turboprop engines, DC-8 does not have propellers)",
        "Fixed landing gear (non-retractable)",
        "Twin engines: The DHC-6 has two engines mounted on the wings, whereas the Cessna 208 typically has a single engine.",
        "Short takeoff and landing (STOL) design features",
        "Number of engines (DHC-6 has 2 engines, DC-8 has 4 engines)",
        "Fuselage shape: The DHC-6 has a boxier fuselage compared to the more streamlined fuselage of the Cessna 208.",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "Fuselage shape (DHC-6 has a more boxy fuselage, DC-8 has a sleeker, cylindrical fuselage)",
        "Engine type (DHC-6 has turboprop engines, DC-8 has jet engines)",
        "Twin-engine turboprop (DHC-6)",
        "Tail design: The DHC-6 has twin tail fins, while the Cessna 208 has a single tail fin.",
        "Shorter fuselage (DHC-6 is overall shorter in length compared to DC-3)"
    ],
    "DR-400": [
        "Single-engine (propeller) design",
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "Single-engine propeller",
        "Low-wing monoplane design with characteristic dihedral angle",
        "Single-engine propeller (as opposed to twin jet engines)",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "low-wing monoplane design",
        "Single-engine",
        "Positioned for general aviation or private flying",
        "Low-wing monoplane configuration",
        "Single-engine configuration",
        "Low-wing design",
        "Typically used for training, private flying, and touring",
        "Retractable tricycle landing gear"
    ],
    "Dash 8": [
        "Longer fuselage compared to the Dornier 328"
    ],
    "Dornier 328": [
        "Rounded, bulbous nose",
        "Longer and sleeker fuselage"
    ],
    "EMB-120": [
        "Airline Livery: Many MD-90s are painted with commercial airline liveries, while EMB-120s can also be found in regional airline or corporate liveries.",
        "Turboprop engines (propellers) instead of jet engines",
        "Size and Body Shape: The EMB-120 is a smaller, turboprop aircraft, while the MD-90 is a larger, twin-jet commercial airliner.",
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the MD-90 has two jet engines mounted at the rear of the fuselage.",
        "Size: The EMB-120 is significantly smaller than the DC-10.",
        "twin turboprop engines (visible propellers)",
        "Twin-engine turboprop with engines mounted on the wings",
        "Landing gear structure: The DC-10 has more complex and robust landing gear compared to the EMB-120.",
        "Sleeker and more aerodynamic nose profile",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the DC-10 has three jet engines (two on the wings and one on the tail).",
        "twin turboprop engines",
        "Presence of winglets on the wingtips",
        "Landing Gear: The EMB-120 commonly has its landing gear mounted on the wings and fuselage, while the MD-90's landing gear is mounted under the fuselage and wing roots.",
        "smaller fuselage with a capacity of around 30 passengers"
    ],
    "Embraer E-Jet": [
        "Number of engines (Embraer E-Jets usually have two engines, while the BAE 146 has four)",
        "presence of winglets or raked wingtips",
        "Main Landing Gear: The E-Jets have a shorter, more compact main landing gear compared to the longer and more visible landing gear of the Fokker 100.",
        "smaller overall airframe size compared to the E-Jet series ",
        "Distinctive \"T-tail\" configuration in some E-Jet models (e.g., E170)",
        "Engines: The E-Jets have engines that are mounted under the wings, whereas the Fokker 100 has rear-mounted engines.",
        "less pronounced nose shape"
    ],
    "Embraer ERJ 145": [
        "Longer, slender fuselage",
        "Absence of winglets",
        "Length: The ERJ 145 tends to be slightly longer than the CRJ-200."
    ],
    "Embraer Legacy 600": [
        "More pronounced nose shape",
        "More prominent, rounded nose",
        "A more rounded nose",
        "Presence of winglets at wingtips",
        "Slightly elongated and sleek body shape",
        "Tail Design: The Legacy 600 has a more distinctive T-tail design, while the E-Jet's tail is more conventional for larger commercial aircraft.",
        "T-tail design",
        "T-tail configuration",
        "Landing gear configuration (Embraer has a different stance and wheel setup)",
        "Different tail cone design, more pointed on the Legacy 600",
        "Distinctive nose shape (more rounded on the Embraer)",
        "Distinctive T-tail design",
        "Size: The Legacy 600 is generally smaller and more streamlined compared to the E-Jet, which is a regional jet with a larger capacity.",
        "More extended and pronounced fuselage length compared to its counterparts",
        "Larger fuselage with more rounded shape"
    ],
    "Eurofighter Typhoon": [
        "Canards (small forewings near the front)",
        "Canard foreplanes",
        "Larger, elongated fuselage",
        "Canard foreplanes (small, wing-like structures near the nose)",
        "Sharp, pointed nose cone",
        "canards (small forward wings near the nose)",
        "canard forewings",
        "Canard foreplanes near the cockpit",
        "swept wing configuration",
        "Slim, streamlined fuselage designed for high maneuverability",
        "civilian livery and design",
        "Sharp, angular design",
        "Trapezoidal air intakes",
        "sharp, pointed nose design",
        "Twin-engine layout"
    ],
    "F-16": [
        "Smaller size and sharper profile (F-16)",
        "smaller size and sleeker profile",
        "Overall size: F-16 is generally smaller in size compared to the larger F/A-18.",
        "Smaller size compared to commercial aircraft",
        "Landing gear design: F-16 and F/A-18 have different landing gear configurations and wheel setups.",
        "single engine",
        "Presence of weaponry or pylons for attaching bombs/missiles",
        "single-engine design",
        "Single-engine design",
        "Presence of weapons or weapon hardpoints (if visible)",
        "Narrow fuselage",
        "Presence of weapons and external fuel tanks (F-16)",
        "Small size compared to commercial airliners",
        "Shorter fuselage length",
        "Single-engine setup (F-16) vs. twin-engine setup (A310)"
    ],
    "F/A-18": [
        "shorter, more robust landing gear",
        "smaller size",
        "Larger landing gear designed for airport runways",
        "Sharp, angular design",
        "Small, compact frame",
        "Multi-wheeled landing gear ",
        "Wingtip missile rails or pylons",
        "Size: The F/A-18 is significantly smaller.",
        "Single-seat or dual-seat configuration",
        "Narrow fuselage",
        "Generally smaller size compared to commercial airliners",
        "Canards",
        "Larger, wide-body fuselage designed for passenger transport",
        "military-grade weaponry and pylons",
        "tactical camouflage or military markings"
    ],
    "Falcon 2000": [
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure.",
        "**Winglets**: Some models of the Falcon 2000 have distinct winglets, while the CRJ-200 commonly has raked wingtips or no winglets.",
        "Nose shape (sleeker for Falcon 2000)",
        "**Fuselage Shape**: The Falcon 2000 has a sleek, business-jet fuselage shape, whereas the CRJ-200 has a more rounded, regional airliner fuselage.",
        "Sleeker, more modern design",
        "More rounded fuselage",
        "Winglets: The Falcon 2000 often features winglets (upward-pointing extensions on the wingtips), while older models of the Challenger 600 may have none or smaller versions.",
        "**Size and Length**: The Falcon 2000 is generally smaller than the CRJ-200.",
        "Fuselage length: The Challenger 600 is generally larger with a longer fuselage compared to the Falcon 2000.",
        "Business jet appearance rather than commercial airliner",
        "straight wings without winglets",
        "Engine placement: The Falcon 2000 has engines mounted closer to the fuselage, whereas the Challenger 600’s engines are mounted higher and at the rear.",
        "**Landing Gear**: The Falcon 2000 might have a more pronounced landing gear design compared to the CRJ-200.",
        "T-tail design: The Falcon 2000 typically has a distinctive T-tail, while the Challenger 600 has a lower-mounted tailplane.",
        "Nose shape: The Falcon 2000 has a more pointed nose compared to the rounder nose of the Challenger 600."
    ],
    "Falcon 900": [
        "Winglets: The Embraer Legacy 600 often has noticeable winglets at the wingtips, whereas the Falcon 900 typically does not.",
        "Engine placement: On the Falcon 900, two engines are mounted on the sides of the fuselage and one is at the base of the vertical stabilizer; the Embraer Legacy 600 has engines mounted on each side of the fuselage near the rear.",
        "Fuselage: The Falcon 900 fuselage appears more curved and streamlined, while the Embraer Legacy 600 has a relatively straighter cylindrical shape.",
        "Dassault Falcon logo or branding",
        "Trijet configuration (three engines)",
        "Overall size: The Falcon 900 may appear slightly smaller and more compact compared to the Embraer Legacy 600.",
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "T-tail: The Falcon 900 features a T-tail configuration, while the Embraer Legacy 600 has a conventional tail.",
        "Window configuration: The arrangement and shape of the windows may differ, with the Falcon 900 having a more scattered arrangement and the Embraer Legacy 600 having a more uniform row.",
        "Manufacturer logos or specific livery",
        "Signature windows characteristic of Dassault Falcon jets",
        "More streamlined and sleek design",
        "More winglets or wing components",
        "Three rear-mounted engines",
        "Distinctive nose shape"
    ],
    "Fokker 100": [
        "Tail cone: The design of the tail cone or APU exhaust might be different.",
        "More slender fuselage profile",
        "Larger size and longer fuselage.",
        "Longer fuselage",
        "Landing gear placement and structure.",
        "Engine position: Both planes have rear-mounted engines, but the engine design and placement can provide clues."
    ],
    "Fokker 50": [
        "More prominent nose gear strut",
        "Smaller size in comparison to the ATR-72",
        "Main landing gear positioning (Fokker 50 has a more traditional arrangement)",
        "Fokker 50 has a more rounded nose"
    ],
    "Fokker 70": [
        "Swept-back wings as opposed to the straighter wings of the Fokker 50.",
        "Lack of a straightforward nose cone seen on the MD-80"
    ],
    "Global Express": [
        "Sleeker, more aerodynamic nose shape",
        "Sleeker, more elongated fuselage",
        "additional antenna arrays and sensors",
        "Longer and more pointed nose",
        "more elongated and pointed nose",
        "manufacturer logo (Bombardier for Global Express, Dassault for Falcon 900)",
        "Window layout (Global Express might have different window spacings or shapes)",
        "Fewer windows along the fuselage",
        "a T-tail with a more pronounced curve",
        "Larger, sleek fuselage",
        "Long, slender fuselage",
        "More rounded nose design",
        "Larger, more aerodynamically efficient winglets or wingtip extensions",
        "Nose shape (Global Express has a more pointed nose)",
        "longer fuselage"
    ],
    "Gulfstream": [
        "Signature \"G\" logo on tail (if present)",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Wingtip winglets (on some Gulfstream models)",
        "often a larger, more luxurious profile compared to King Air's smaller, more compact design",
        "Different nose shape, less pointed than Gulfstream",
        "Winglets with a different design compared to Gulfstream",
        "logo/branding",
        "Trijet or twinjet configuration (if specifically the Falcon 2000, it’s a twinjet)",
        "winglets"
    ],
    "Hawk T1": [
        "Design: The Hawk T1 has a streamlined, agile design for maneuverability, contrasting with the DC-10's bulkier and broader design meant for high-capacity passenger travel.",
        "Sleeker, streamlined fuselage",
        "Sleeker, more aerodynamic profile (Hawk T1) vs. more traditional, boxier profile (DHC-1)",
        "Size: The Hawk T1 is much smaller than the DC-10.",
        "Small, sleek, and compact design (Hawk T1)",
        "Modern, sleek fuselage",
        "Landing Gear: The Hawk T1 has a simple tricycle landing gear, while the DC-10 has a more robust and complex landing gear to support its larger size and weight.",
        "Longer, sleeker fuselage typical of a jet trainer",
        "Single-engine jet design",
        "\\-single-engine jet design",
        "Swept-back wings (Hawk T1) vs. straight wings (DHC-1)",
        "Single-engine jet",
        "Short fuselage",
        "Commercial airline livery or branding (A300)",
        "Multiple passenger windows along the fuselage (A300)"
    ],
    "Il-76": [
        "Tall, boxy fuselage",
        "T-shaped tail",
        "Conventional tail (not a T-tail)",
        "Three engines (two on the wings and one in the tail)",
        "Typically larger size compared to BAE-125",
        "T-tail configuration",
        "The more rounded and bulbous nose design of the Il-76",
        "Fuselage shape: The Il-76 has a wider, more cylindrical fuselage designed for cargo, while the Boeing 727 has a narrower, more streamlined fuselage optimized for passenger travel."
    ],
    "King Air": [
        "Wing position (King Air has wings mounted low on the fuselage, while Falcon 2000 has mid-wing positioning)",
        "Tail design (King Air typically has a T-tail, while Falcon 2000 has a conventional tail)",
        "Landing gear (King Air often has retractable tricycle landing gear including the forward gear, while Falcon 2000 has a more robust and streamlined landing gear system adjusted for jet performance)",
        "Retractable landing gear that is more streamlined with the wings",
        "Swept wings",
        "Shorter wingspan",
        "Landing gear: The landing gear design and placement might vary between the two, with King Air models often having simpler, less robust landing gear compared to the more substantial gear on Gulfstream jets.",
        "Smaller and more streamlined fuselage",
        "Shorter fuselage compared to a Metroliner",
        "Less rugged landing gear designed for paved runways (compared to the DHC-6's rugged, fixed gear)",
        "T-tail configuration",
        "Propellers (King Air has turboprop engines, while Cessna Citation has jet engines)",
        "Retractable landing gear",
        "Engine placement: King Air models have engines mounted on the wings, while Gulfstream jets have engines mounted on the rear fuselage.",
        "T-tail design"
    ],
    "L-1011": [
        "Larger wing span in proportion to fuselage compared to A310",
        "**Winglets**: The A300 might have winglets on the tips of its wings depending on the variant, while the L-1011 does not feature winglets.",
        "Fuller height and extended fairing under the tail",
        "Winglets or absence thereof (Boeing 757 often has winglets)",
        "Rear fuselage shape: The L-1011 has a somewhat boxy rear end due to the tail engine configuration, which is different from the sleeker rear fuselage of the A340.",
        "Overall fuselage design: The L-1011 may have a slightly shorter, more stubby appearance compared to the longer, streamlined look of the A340.",
        "Hubbier, more rounded fuselage",
        "T-tail with additional ventral fin (small fin under the tail)",
        "Wider, more rounded fuselage",
        "Distinctive S-duct for the tail engine",
        "More angular-wing planes at the wing root",
        "Wider and taller fuselage",
        "Longer fuselage with a sleeker nose design",
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "Wider fuselage"
    ],
    "MD-11": [
        "Extended fuselage length compared to DC-8",
        "Three engines (two under wings and one in the tail)",
        "Shorter fuselage compared to the A340",
        "Extended fuselage: the MD-11 typically has a longer fuselage compared to the A310.",
        "a more modern, aerodynamic shape",
        "Landing Gear: The MD-11 has a different landing gear configuration, including a center landing gear, which is not present in the MD-80.",
        "Sharp, angled winglets (on some models)",
        "Wider fuselage",
        "Longer fuselage",
        "longer fuselage",
        "T-tail design (tailplane mounted at the top of the tail fin)",
        "Tailplane with a smaller span",
        "Length: The MD-11 is generally longer compared to the MD-80.",
        "Three engines (one mounted in the tail and two under the wings)",
        "Trijet engine configuration (one engine on the tail and two under the wings)"
    ],
    "MD-80": [
        "Older, more angular design elements",
        "More modern and sleeker design overall"
    ],
    "MD-90": [
        "absence of the third engine at the tail (MD-90).",
        "Nose shape: The MD-90 usually has a more pointed nose compared to the A300.",
        "T-tail design (MD-90) vs. conventional tail (DC-10).",
        "Single-aisle fuselage (MD-90) vs. wide-body fuselage (DC-10).",
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "Length of the aircraft: The MD-90 is typically longer and slimmer than the A300.",
        "Winglets (some MD-90s have winglets while MD-80s generally do not)",
        "Landing gear: MD-90's landing gear is located differently compared to the wide body design of A300.",
        "generally smaller size and narrower body of the MD-90.",
        "Extended fuselage: The MD-90 is longer than the DC-9.",
        "T-tail configuration on the CRJ-700 (not present on the MD-90)",
        "Winglets (on some models)",
        "Two engines mounted under the wings (MD-90) vs. three engines, one on each wing and one at the base of the vertical stabilizer (DC-10).",
        "Fuselage length: The MD-11 has a longer fuselage compared to the MD-90.",
        "Longer fuselage approximately 46.5 meters (152 feet 8 inches)"
    ],
    "Metroliner": [
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "landing gear with fairings",
        "Propeller-driven engines ",
        "Fixed landing gear (in some models)",
        "Tail design (Metroliner: T-tail; BAE 146: T-tail but with a noticeably larger vertical stabilizer)",
        "twin turboprop engines",
        "Fixed (non-retractable) landing gear on some models",
        "Twin turboprop engines (Metroliner)",
        "Presence of propeller blades on engines",
        "Retractable tricycle landing gear",
        "Twin turboprop engines mounted on the wings",
        "Landing gear position (retractable gear in the wings for Metroliner)"
    ],
    "PA-28": [
        "**Fuselage Shape:** The PA-28 generally has a more rounded, tubular fuselage, whereas the SR-20 has a more streamlined and tapered fuselage.",
        "**Wing Position**: The PA-28 is a low-wing aircraft, meaning its wings are attached to the bottom of the fuselage, whereas the DHC-1 (Chipmunk) has a low arrangement but appears more middle due to its more trainer-like structure.",
        "Landing gear: The PA-28 usually has fixed tricycle landing gear with the nose wheel located under the nose, while the DR-400 also has fixed tricycle landing gear but with slight design differences.",
        "fixed landing gear (most models)",
        "**High Wing vs. Low Wing:** PA-28 typically has a low wing configuration, meaning the wings are mounted below the fuselage.",
        "**Nose Shape**: The PA-28 often has a more pointed, aerodynamic nose cone, whereas the DHC-1 has a blunter, more rounded nose profile.",
        "**Engine Cowling**: The PA-28’s engine cowling is more streamlined and integrated, whereas the DHC-1 might have more visible engine parts or a prominent radial engine look.",
        "Small, single-engine design",
        "Fuselage: The PA-28 has a relatively slender fuselage, while the An-12 has a bulkier, more robust fuselage designed for cargo.",
        "**Fuselage Shape**: The PA-28 has a more streamlined, modern fuselage shape, while the DHC-1 tends to have a more classic, military trainer look, with a bubble canopy.",
        "Tricycle landing gear",
        "Single propeller at the front",
        "Fixed landing gear",
        "Absence of high-mounted wings or twin engines on the wings",
        "Single-engine design"
    ],
    "SR-20": [
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Single-engine (propeller) aircraft",
        "Cirrus Aircraft logo",
        "**Single Engine:** The SR-20 has a single engine, typically a piston engine mounted at the front, whereas the EMB-120 has twin turboprop engines mounted on the wings.",
        "Single-engine piston aircraft",
        "Fixed tricycle landing gear with a more streamlined design (PA-28 has less aerodynamic landing gear)",
        "Smaller, single-engine aircraft design",
        "**Size:** The SR-20 is a smaller, single-engine aircraft designed for general aviation and personal use, while the EMB-120 is a larger, twin-engine regional airliner.",
        "Landing Gear: The SR-20 has fixed tricycle landing gear, whereas the A310 has retractable landing gear suited for larger aircraft.",
        "**Landing Gear:** The SR-20 usually has a nosewheel (tricycle) landing gear configuration, while the EMB-120 also has a tricycle landing gear but its struts are more robust to support the larger aircraft.",
        "Cirrus logo",
        "**Windows and Doors:** The SR-20 has fewer windows and a more streamlined fuselage compared to the EMB-120, which has multiple cabin windows along the side and larger entry doors for passengers and cargo.",
        "Generally used for personal or flight training purposes",
        "T-tail configuration (PA-28 has a conventional tail)",
        "single-engine propeller"
    ],
    "Saab 2000": [
        "longer, sleeker fuselage",
        "smaller overall size compared to the BAE 146, which has four jet engines",
        "Sleeker, more streamlined fuselage",
        "T-tail design but different in shape compared to Saab 2000",
        "Fewer windows in comparison to a BAE-125",
        "Sleek, elongated fuselage",
        "More windows along the fuselage",
        "slightly pointed nose",
        "Number of propellers (Saab 2000 typically has 4 or 5 blades on its propellers.)",
        "Typically equipped with 5-bladed propellers (ATR-72 usually has 6-bladed propellers)",
        "Jet engines (no propellers)",
        "Taller landing gear",
        "Longer fuselage",
        "Wings positioned slightly further back on the fuselage",
        "Fewer windows along the side (around 50 seats vs. around 70 seats in ATR-72)"
    ],
    "Saab 340": [],
    "Spitfire": [
        "Tail wheel",
        "Tailwheel landing gear",
        "tailwheel landing gear",
        "Retractable landing gear",
        "Historical context: Spitfires are associated with World War II, so uniforms, other aircraft, or period-specific details might be present in the background or with the aircraft.",
        "Monoplane with elliptical wings",
        "Lack of turboprop engines",
        "Rounded wingtips",
        "Propeller-driven engine",
        "Tailwheel undercarriage",
        "Single propeller engine at the nose",
        "Narrow landing gear (retractable)",
        "Elliptical wings",
        "elliptical wings",
        "propeller engine"
    ],
    "Tornado": [
        "single or tandem cockpit configuration",
        "twin-engine configuration",
        "Twin-engine configuration",
        "smaller, more compact airframe",
        "Camouflage or gray paint scheme (typical of military aircraft)",
        "swept wings with variable geometry (adjustable sweep angle)",
        "Swing-wing design",
        "no visible cockpit or engines",
        "Twin-engine design",
        "absence of solid structure and wings typical of aircraft",
        "landing gear (if visible in a static or landing/takeoff photo)",
        "Camouflage or military markings",
        "Presence of external weapon mounts or ordnance",
        "Canopy for pilot and co-pilot",
        "Compact and aerodynamic airframe"
    ],
    "Tu-134": [
        "Number of Engines: The Tu-134 has two engines mounted at the rear, while the Tu-154 has three engines, with one in the tail and two under the wings.",
        "Engine placement: The engines of the Tu-134 are mounted at the rear fuselage, while the BAE-125's engines are mounted on the wings.",
        "Windows arrangement: The Tu-134 might have a different alignment and number of passenger windows compared to the Boeing 727.",
        "Fuselage shape: The Tu-134 has a more cylindrical fuselage, while the BAE-125 is slightly more elongated with a tapered tail.",
        "Nose shape: The Tu-134 has a more pointed nose, compared to the more rounded nose of the BAE-125.",
        "Landing gear design: The design and placement of the landing gear can also be a distinguishing feature.",
        "Window arrangement: The Tu-134 often has rectangular windows arranged in a straight line, while the BAE-125 has oval or round windows with a different alignment.",
        "Landing gear located in pods on rear fuselage (Tu-134)",
        "3-wheeled main landing gear (Tu-134)",
        "Nose shape: The Tu-134 has a more rounded nose, while the Boeing 727 has a more pointed nose."
    ],
    "Tu-154": [
        "A more elongated fuselage compared to the BAE-125",
        "Longer fuselage in comparison to the DC-9",
        "Shorter, more rounded nose compared to the DC-8",
        "Narrow fuselage compared to the Boeing 707",
        "Shorter, stubbier fuselage",
        "Landing gear configuration (Tu-154 has a different setup compared to the Boeing 707)"
    ],
    "Yak-42": [
        "lack of visible propellers (ATR-72 has two propellers)",
        "No propellers (Saab 2000 is a turboprop aircraft, while Yak-42 is a jet)"
    ]
}