{
    "A300": [
        "Slight dihedral wings (wings angled slightly upwards) ",
        "Winglets (depending on the model/version of A300)",
        "Winglets at the wingtips (depending on the version)",
        "Length of the fuselage: The A300 typically has a longer fuselage compared to the A310."
    ],
    "A310": [],
    "A320": [
        "Absence of rear fuselage-mounted engines",
        "landing gear design (A320 has a simpler main landing gear structure)",
        "nose shape",
        "Proportions of the fuselage to wings  ",
        "Rounded nose  ",
        "More modern, rounded nose shape"
    ],
    "A330": [
        "Shorter fuselage",
        "Longer fuselage",
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "Newer design with longer range and more passenger capacity",
        "Length of fuselage: The A330 generally has a longer fuselage than the A310.",
        "Winglets with a distinctive upward curve (sharklets)",
        "The shape of the tail cone",
        "Winglets on the wingtips",
        "A wider, more modern fuselage",
        "Larger size and longer fuselage",
        "Wider fuselage",
        "**Wingtips:** A330 typically has wingtip devices known as winglets or sharklets, while early models of the Boeing 737 have no winglets and later models may have split scimitar winglets.",
        "Different wingtip design (depending on the variant)",
        "Winglets with a curved design",
        "Typically a slightly shorter and higher tail compared to the Boeing 767"
    ],
    "A340": [
        "Slightly larger size and more elongated shape",
        "Differences in the shape and layout of the tail and vertical stabilizer",
        "Airbus logo on the tail or fuselage (if visible)",
        "Four engines (A340 has four engines, whereas Boeing 757 has two)",
        "Four engines",
        "Lengthy fuselage ",
        "Longer fuselage ",
        "Longer fuselage",
        "Longer fuselage: The A340 generally has a longer fuselage than the A310.",
        "Four engines: The A340 has four engines, while the A310 has two.",
        "Aircraft tail height (A340 generally taller)",
        "Four engines (two under each wing)"
    ],
    "A380": [
        "Wingtip fences or winglets that are larger and more vertical",
        "Typically wider fuselage",
        "Wider and taller fuselage",
        "Often a more prominent nose design",
        "Larger overall size in terms of length and wingspan",
        "Distinctive hump running the entire length of the fuselage",
        "Distinctively larger and more rounded nose",
        "four engines mounted closer to the fuselage",
        "Larger overall size and wingspan",
        "larger, more rounded nose",
        "Generally more massive and larger fuselage",
        "slightly different tail design",
        "overall larger size and bulkier appearance",
        "Larger tail fin",
        "Four engines"
    ],
    "ATR-42": [
        "T-tail (ATR-42 has a conventional tail, whereas BAE-125 has a T-tail configuration)",
        "Propeller engines (ATR-42 has turboprop engines, while BAE-125 has jet engines)"
    ],
    "ATR-72": [
        "More rounded nose shape without a pointed radar dome",
        "A more compact, rounded fuselage.",
        "Rounded nose",
        "Four jet engines mounted on pylons under the wings."
    ],
    "An-12": [
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "An-12 has a rear loading ramp, while DHC-1 does not",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "Different engine nacelle shape (more streamlined compared to C-130)",
        "Soviet-era design aesthetics, often more angular and utilitarian compared to the sleek and modern appearance of an A320",
        "Landing gear configuration (An-12 has retractable landing gear, while DHC-1 has fixed gear)",
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "Glass nose (with windows offering a more pointed front profile)",
        "Ramp/cargo door on An-12",
        "Large cargo door at the rear",
        "Landing Gear: The An-12 has a more utilitarian landing gear setup, often with main gear pods and rear gear clusters, while the A300 has more conventional retractable gear.",
        "High-wing design, as opposed to the low-wing design of an A320",
        "Cargo doors",
        "Size (An-12 is much larger)"
    ],
    "BAE 146": [],
    "BAE-125": [
        "Fewer windows, typically associated with business jets",
        "small, twin-engine business jet",
        "lacks propellers (as ATR-72 is a turboprop)",
        "Size and shape: The BAE-125 is typically smaller and has a more compact shape compared to the longer and larger ERJ 145.",
        "Wing-mounted engines (turboprop in most cases)",
        "Fewer windows along the fuselage",
        "Jet engines instead of turboprops",
        "swept wings",
        "Engine placement: The BAE-125 has engines mounted on the rear fuselage, while the ERJ 145 also has rear-fuselage-mounted engines but can be identified by their specific placement and size.",
        "Ailerons and flaps distinctively visible on the wings",
        "Propeller engines",
        "two engines mounted at the rear",
        "Swept-back wings with winglets",
        "winglets at the tips",
        "Longer, more streamlined fuselage "
    ],
    "Beechcraft 1900": [
        "Twin propellers instead of jet engines"
    ],
    "Boeing 707": [
        "Smaller and more streamlined nose section",
        "A more streamlined and pointed nose",
        "Older design with less advanced aerodynamics compared to the 757",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)",
        "Wider body",
        "Larger fuselage",
        "T-tail design (707’s tail design is slightly different)",
        "A slightly larger and wider fuselage",
        "Four engines but typically larger and more spaced apart",
        "Smaller and more rounded fuselage compared to the Boeing 767",
        "More rounded and shorter fuselage",
        "A more complex landing gear configuration with more wheels"
    ],
    "Boeing 717": [
        "Sleeker and more aerodynamic nose shape",
        "Lack of winglets"
    ],
    "Boeing 727": [
        "Wide body",
        "Longer, more slender fuselage",
        "Slightly swept wings with fewer pylons for engines",
        "A slightly longer fuselage",
        "Slimmer fuselage",
        "More pronounced rake angle of the tail fin",
        "Narrow body",
        "Shorter fuselage compared to the 757",
        "Narrower fuselage diameter compared to the DC-8",
        "Typically older and having a more retro design style",
        "Longer fuselage compared to Boeing 717",
        "Narrow fuselage with distinctive taper towards the rear",
        "Distinctive nose shape",
        "Winglets (in some models, but not all)",
        "Twin engines mounted under the wings"
    ],
    "Boeing 737": [
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)",
        "Length of the fuselage (737 tends to be longer than 717)",
        "Smaller landing gear and fewer wheels",
        "Distinctive pointed nose shape",
        "Longer fuselage length",
        "pointed nose design"
    ],
    "Boeing 747": [
        "distinctive \"humpback\" profile",
        "pronounced wing sweep",
        "more prominent winglets",
        "More pointed and streamlined nose",
        "Shorter and less pronounced landing gear (767)",
        "Larger tail fin",
        "More pointed nose shape",
        "Winglets at the ends of the wings (depending on specific 747 model)",
        "Winglets on the ends of the wings (in newer models)",
        "Longer fuselage compared to the height of the tail (747)",
        "longer landing gear",
        "More prominent and taller vertical stabilizer",
        "Distinctive nose shape ",
        "Distinctive nose shape",
        "Taller landing gear"
    ],
    "Boeing 757": [
        "Two overwing exits for most configurations, compared to the A320 which typically has one or no overwing exits.",
        "No winglets",
        "more slender and pointed nose",
        "Longer, more slender fuselage",
        "Presence of winglets or raked wingtips (depending on the model)",
        "T-tail absent",
        "Landing gear: The Boeing 757 has a noticeable difference in the landing gear configuration compared to the Boeing 767.",
        "**Number of Engines**: The Boeing 757 typically has two engines under its wings, whereas the Boeing 777 also has two engines, but they are significantly larger.",
        "Longer fuselage with more streamlined appearance",
        "Higher landing gear stance",
        "Length of fuselage (Boeing 757 is longer)",
        "Shorter landing gear and tail height",
        "Longer fuselage",
        "longer fuselage",
        "Taller landing gear"
    ],
    "Boeing 767": [
        "More prominent, squared-off tail fin",
        "Winglets on the tips of the wings (in some models)",
        "tail fin shape",
        "Higher number of wheels on the landing gear",
        "Winglets: Boeing 767 generally has raked wingtips, while the A320 has winglets or sharklets.",
        "Single bogie (two wheels) on each main landing gear",
        "Taller landing gear (767 has a higher stance)",
        "winglets",
        "More prominent wingspan",
        "Larger, more rounded nose shape",
        "A wider fuselage (767 is a wide-body aircraft)",
        "Raked wingtips which are slightly curved upwards",
        "Wider wingspan and larger winglets",
        "Length: The Boeing 767 is usually longer than the A320.",
        "Longer and wider body"
    ],
    "Boeing 777": [
        "Generally longer overall length",
        "**APU Exhaust**: The position and shape of the Auxiliary Power Unit (APU) exhaust at the rear can also provide clues.",
        "Engine count: Boeing 777 has two engines, while the Airbus A340 has four engines.",
        "two engines (Boeing 777) vs. four engines (Boeing 707)",
        "Six wheels per main landing gear bogie (the A330 has four)",
        "Engine size and shape (larger on the Boeing 777)",
        "Longer, slender fuselage"
    ],
    "C-130": [
        "Wide, boxy fuselage",
        "Short, sturdy landing gear",
        "Less streamlined body shape",
        "Tailwheel landing gear configuration",
        "Wing shape and position: The C-130 has a straight wing positioned approximately at the mid-fuselage level, while the An-12's wings are more tapered and positioned higher on the fuselage.",
        "Two piston engines",
        "Military insignia and camouflage pattern (if applicable)",
        "The presence of a large rear cargo door: Both aircraft feature a rear cargo ramp, but the shape and design can be distinguishing factors.",
        "Shorter, stockier landing gear suited for rough airstrips",
        "Squat and utilitarian appearance",
        "Large rear cargo ramp",
        "Shorter landing gear",
        "The landing gear configuration: The C-130 typically has a set of two main landing gears with two wheels each on each side, while the An-12 has two pairs of tandem main landing gear.",
        "Bulky and rugged appearance for tactical airlift operations",
        "Long, slender fuselage with efficient aerodynamics"
    ],
    "C-47": [
        "astrodome or navigator's bubble on top of the fuselage",
        "Propellers (C-47 has propellers, A310 has jet engines)",
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "Landing gear: The C-47 features a tailwheel landing gear configuration, while the DC-6 typically has a tricycle landing gear system.",
        "Tail wheel landing gear",
        "Landing gear with tailwheel configuration",
        "Tailwheel landing gear",
        "Smaller size compared to DC-10",
        "retractable landing gear",
        "Single tail fin",
        "Wing shape (C-47 has straight wings, whereas A310 has swept-back wings)",
        "Double tail fins",
        "Shorter fuselage: The C-47 has a shorter fuselage than the DC-6.",
        "Two engines: The C-47 has two engines, whereas the DC-6 has four.",
        "Tailwheel landing gear configuration"
    ],
    "CRJ-200": [
        "No winglets on many models",
        "More angular, sharply swept wings",
        "Absence of winglets",
        "Engines also at the rear but slightly different mounting"
    ],
    "CRJ-700": [
        "Longer, sleeker fuselage",
        "T-tail design as well, but a more robust fuselage",
        "More complex landing gear structure",
        "Generally absence of winglets",
        "Engine placement closer to the wings",
        "Overwing emergency exits with particular placement",
        "Larger, more pronounced winglets",
        "Longer fuselage"
    ],
    "Cessna 172": [
        "Number of seats (Cessna 172 typically has 4 seats, Cessna 208 can seat more passengers)",
        "No twin-engine configuration (DHC-6 is a twin-engine aircraft)",
        "Smaller size compared to the DHC-6",
        "Engine configuration (Cessna 172 has a single piston engine, while Cessna 208 has a turboprop engine)",
        "Tailwheel or tricycle landing gear configuration",
        "twin engines with propellers",
        "Multiple engines (usually four propellers)",
        "Fixed landing gear (compared to the often retractable gear on the DHC-1)",
        "smaller overall size and simpler design"
    ],
    "Cessna 208": [
        "Number of seats (Cessna 208 seats up to around 14, Boeing 737 seats over 130)",
        "Wide, single door at the rear (often for cargo loading)",
        "Size of the aircraft (Cessna 208 is significantly smaller)",
        "lack of jet engines",
        "Tail design (Cessna 208 has a single vertical stabilizer and a simpler tail)",
        "capacity for fewer passengers and cargo",
        "Wing position (Cessna 208 has high wings, Boeing 737 has low wings)",
        "sleeker, more compact fuselage",
        "Simpler, less elongated fuselage",
        "Fixed landing gear (non-retractable)",
        "Fixed landing gear with optional floats or skis",
        "Fewer windows",
        "Capacity for fewer passengers (typically 9-14)",
        "Longer fuselage compared to Cessna 208",
        "significantly fewer windows"
    ],
    "Cessna Citation": [
        "**Fuselage shape**: The fuselage of a Cessna Citation is usually sleeker and more streamlined compared to the more boxy shape of the Beechcraft 1900.",
        "Landing gear (can vary between models, but generally simpler than Challenger 600)",
        "**Landing gear**: The Cessna Citation often has tricycle landing gear with the main gear retracting into the wings or fuselage, while the Beechcraft 1900's landing gear retracts into nacelles on the wing.",
        "size",
        "**Size:** Cessna Citations are generally smaller."
    ],
    "Challenger 600": [
        "Typically lacks the prominent nose cone seen on the CRJ-700",
        "Challenger 600 typically has a sleeker, more streamlined appearance",
        "Commercial or business jet appearance",
        "Winglets that are less pronounced or sometimes absent",
        "Wing configuration: The Challenger 600 has wings that are typically lower and closer to the ground compared to the DC-10's higher wing configuration suitable for longer haul and greater lift."
    ],
    "DC-10": [],
    "DC-3": [
        "Tricycle landing gear arrangement (more modern design in DC-3)",
        "Smaller size and fuselage",
        "Fuselage shape is less boxy (DC-3) compared to the boxier DHC-6",
        "smaller overall size",
        "Distinctive rounded fuselage shape",
        "Smaller size and shorter fuselage",
        "More rounded and classic \"streamlined\" appearance (DC-3)",
        "Landing gear: The DC-3 has a tail-dragger landing gear configuration with the main gear under the wings and a small tail wheel, whereas the Boeing 707 has tricycle landing gear with nose gear and main gear.",
        "more rounded nose",
        "shorter fuselage",
        "Fuselage shape: The DC-3 has a more rounded, narrower fuselage compared to the wider body of the Boeing 707.",
        "Tailwheel landing gear (DC-3) instead of tricycle landing gear (DHC-6)",
        "Overall length and fuselage shape (DC-3 is shorter and more rounded)",
        "absence of a cargo door",
        "Rounded nose"
    ],
    "DC-6": [
        "Tail Design: DC-6 has a tricycle landing gear (nose gear), and a vertical stabilizer without a dorsal fillet, while the C-47 has a tailwheel landing gear and a more prominent dorsal fillet on the vertical stabilizer.",
        "Overall size significantly larger than the DH-82",
        "Larger, more streamlined fuselage",
        "Tail wheel landing gear for earlier models"
    ],
    "DC-8": [
        "Wing-mounted additional fuel tanks: Some Boeing 707 models have additional fuel tanks on the wings which are not commonly found on DC-8s.",
        "Presence of S-duct: The DC-10 features a prominent S-duct on the tail for the third engine, which is absent in the DC-8.",
        "Longer fuselage with a more slender appearance",
        "Distinctive shape of the tail fin and rudder",
        "Tail design: DC-8 features a more pointed dorsal fin on the vertical stabilizer, unlike the Boeing 707 which usually has a more rounded dorsal fin.",
        "Wing design: The DC-8 tends to have shorter wings relative to its body length, whereas the DC-10 has longer wings with winglets (in some models) to support its heavy load.",
        "Older design with fewer high-tech materials and features"
    ],
    "DC-9": [],
    "DH-82": [
        "Vintage (1930s) look and design elements",
        "wooden and fabric construction",
        "Wooden and fabric construction",
        "biplane design",
        "biplane structure",
        "Narrow fuselage",
        "simpler, vintage design (typically from the 1930s)",
        "Biplane design (two sets of wings)",
        "Historic look, often associated with vintage aircraft from the 1930s",
        "fixed landing gear with tailwheel",
        "Fixed landing gear with tailwheel",
        "Fixed tailwheel landing gear",
        "Simple, rounded fuselage design typical of early 20th-century light aircraft",
        "Fixed landing gear with a tailwheel",
        "Biplane configuration (two sets of wings)"
    ],
    "DHC-1": [
        "More streamlined and modern design (DHC-1) vs. more vintage, biplane design (DH-82)",
        "Vintage, military trainer appearance",
        "More streamlined and less pronounced engine cowling",
        "Single-wing (monoplane) design (DHC-1) vs. dual-wing (biplane) design (DH-82)",
        "Tricycle landing gear in some models (DHC-1) vs. taildragger landing gear (DH-82)",
        "Taildragger configuration (main landing gear under the wings, with a small tailwheel)",
        "Straight and square wings with little to no dihedral",
        "More streamlined, military trainer appearance",
        "Relatively smaller and lighter frame",
        "Radial engine cowling (distinctive engine shape)",
        "Tailwheel landing gear",
        "Size of the aircraft: The DHC-1 is a small single-engine aircraft, while the A310 is a large commercial airliner.",
        "Wing shape and layout (straight wings on DHC-1, swept wings on Hawk T1)",
        "Straight wings with a slight dihedral",
        "Wing placement: The DHC-1 has low-wing configuration, with the wings positioned lower on the fuselage, whereas the A310 has a mid or high-wing configuration relative to its size."
    ],
    "DHC-6": [
        "Fixed landing gear: The DHC-6 often has fixed landing gear, whereas the Cessna 208 might have retractable gear or different landing gear configurations.",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "Short takeoff and landing (STOL) design features",
        "Twin engines: The DHC-6 has two engines mounted on the wings, whereas the Cessna 208 typically has a single engine.",
        "Sturdy, rugged appearance suitable for STOL (Short Takeoff and Landing) operations",
        "Fixed landing gear (non-retractable)",
        "Landing gear (DHC-6 often has fixed landing gear, DC-8 has retractable landing gear)",
        "Propeller presence (DHC-6 has propellers due to turboprop engines, DC-8 does not have propellers)",
        "Twin-engine turboprop (DHC-6)",
        "Straight wings: The wings of a DHC-6 are straight and high-mounted, compared to the slightly different wing structure of a Cessna 208.",
        "Number of engines (DHC-6 has 2 engines, DC-8 has 4 engines)",
        "Retractable tricycle landing gear",
        "Engine type (DHC-6 has turboprop engines, DC-8 has jet engines)",
        "Twin-engine configuration",
        "Fixed, non-retractable landing gear (DHC-6)"
    ],
    "DR-400": [
        "Aircraft registration usually starting with \"F-\" for French registration",
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "Single-engine (propeller) design",
        "Positioned for general aviation or private flying",
        "Single-engine",
        "Typically used for training, private flying, and touring",
        "Single-engine propeller (as opposed to twin jet engines)",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "Single-engine propeller",
        "Rounded wingtips and tail surfaces",
        "unique dihedral wing tips (slightly drooping)",
        "Single-engine configuration",
        "Low-wing monoplane design with characteristic dihedral angle",
        "Single-engine aircraft configuration"
    ],
    "Dash 8": [
        "Slightly different nose shape (Dash 8 has a more angular nose)",
        "More boxy fuselage shape",
        "Four-bladed propellers (depending on the specific Dash 8 model)"
    ],
    "Dornier 328": [
        "Distinctive propeller shape (often 4-blade on Dornier 328, versus 6-blade on ATR-72)",
        "More compact and shorter fuselage on the Dornier 328 compared to the BAE 146",
        "T-tail design",
        "Longer and sleeker fuselage",
        "Shorter fuselage",
        "T-tail configuration",
        "twin turboprop engines (usually visible on the wings)"
    ],
    "EMB-120": [
        "Turboprop engines (propellers) instead of jet engines",
        "Sleeker and more aerodynamic nose profile",
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Twin-engine turboprop with engines mounted on the wings",
        "Size and shape of the fuselage (larger and more robust in EMB-120)",
        "twin turboprop engines (visible propellers)",
        "Size: The EMB-120 is significantly smaller than the DC-10."
    ],
    "Embraer E-Jet": [
        "Main Landing Gear: The E-Jets have a shorter, more compact main landing gear compared to the longer and more visible landing gear of the Fokker 100.",
        "Engines: The E-Jets have engines that are mounted under the wings, whereas the Fokker 100 has rear-mounted engines.",
        "longer landing gear legs",
        "Winglets: Embraer E-Jets typically have winglets, while Fokker 100s do not.",
        "Distinctive \"T-tail\" configuration in some E-Jet models (e.g., E170)",
        "Number of engines (Embraer E-Jets usually have two engines, while the BAE 146 has four)",
        "T-tail configuration",
        "T-tail",
        "presence of winglets or raked wingtips",
        "Engine placement (Embraer E-Jets typically have engines mounted under the wings, while BAE 146 has engines mounted on the fuselage above the wings)",
        "Longer, slender wings",
        "Distinctive T-tail design (in some models)"
    ],
    "Embraer ERJ 145": [
        "Absence of winglets",
        "Longer, slender fuselage",
        "Length: The ERJ 145 tends to be slightly longer than the CRJ-200.",
        "tail design",
        "T-shaped tail"
    ],
    "Embraer Legacy 600": [
        "More prominent, rounded nose",
        "Presence of winglets at wingtips",
        "Tail Design: The Legacy 600 has a more distinctive T-tail design, while the E-Jet's tail is more conventional for larger commercial aircraft.",
        "Slightly elongated and sleek body shape",
        "A more rounded nose",
        "More pronounced nose shape",
        "Different tail cone design, more pointed on the Legacy 600",
        "Distinctive T-tail design",
        "Distinctive nose shape (more rounded on the Embraer)",
        "Landing gear configuration (Embraer has a different stance and wheel setup)",
        "Size: The Legacy 600 is generally smaller and more streamlined compared to the E-Jet, which is a regional jet with a larger capacity.",
        "T-tail configuration",
        "T-tail design",
        "Winglets: The Legacy 600 usually has a more pronounced upward curve on its winglets compared to the relatively simpler winglets on the E-Jet series.",
        "Larger fuselage with more rounded shape"
    ],
    "Eurofighter Typhoon": [
        "Sharp, pointed nose cone",
        "Larger, elongated fuselage",
        "Canards (small forewings near the front)",
        "Trapezoidal air intakes",
        "Smaller overall size compared to commercial airliners",
        "Presence of various weaponry or missile mounts",
        "Sharp, angular design",
        "sharp, pointed nose design",
        "Canard foreplanes (small, wing-like structures near the nose)",
        "Presence of modern radar and sensor systems",
        "Presence of weapons or weapon mounts",
        "swept wing configuration",
        "more streamlined and elegant design for comfort and efficiency",
        "presence of underwing stores (weapons or fuel tanks)",
        "Slim, streamlined fuselage designed for high maneuverability"
    ],
    "F-16": [
        "smaller size and sleeker profile",
        "Smaller size and sharper profile (F-16)",
        "Sleek, single-engine design",
        "Smaller size compared to commercial aircraft",
        "Single-engine design",
        "single-engine design",
        "Overall size: F-16 is generally smaller in size compared to the larger F/A-18.",
        "single engine",
        "Small size compared to commercial airliners",
        "Sleek, streamlined design",
        "Shorter fuselage length",
        "Single-engine configuration",
        "Compact and agile airframe",
        "Sleek, aerodynamic design with a pointed nose",
        "Small size compared to commercial airliners like the Boeing 757"
    ],
    "F/A-18": [
        "Larger, wide-body fuselage designed for passenger transport",
        "Sharp, angular design",
        "Narrow fuselage",
        "Twin-engine configuration",
        "Canards",
        "Single-seat or dual-seat configuration",
        "Slender, swept-back wings",
        "Wingtip missile rails or pylons",
        "Sleek and angled design with sharp edges",
        "twin-engine jet design",
        "swept-back wings with a more aggressive angle",
        "High-wing design",
        "twin vertical stabilizers",
        "Single vertical stabilizer (tail fin)",
        "Absence of visible weaponry or military features"
    ],
    "Falcon 2000": [
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure.",
        "Engine placement: The Falcon 2000 has engines mounted closer to the fuselage, whereas the Challenger 600’s engines are mounted higher and at the rear.",
        "Winglets: The Falcon 2000 often features winglets (upward-pointing extensions on the wingtips), while older models of the Challenger 600 may have none or smaller versions.",
        "T-tail design: The Falcon 2000 typically has a distinctive T-tail, while the Challenger 600 has a lower-mounted tailplane.",
        "Fuselage length: The Challenger 600 is generally larger with a longer fuselage compared to the Falcon 2000.",
        "Sleeker, more modern design",
        "T-tail configuration",
        "Slightly smaller overall size",
        "**Winglets**: Some models of the Falcon 2000 have distinct winglets, while the CRJ-200 commonly has raked wingtips or no winglets.",
        "Nose shape (sleeker for Falcon 2000)"
    ],
    "Falcon 900": [
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "Manufacturer logos or specific livery",
        "Trijet configuration (three engines)",
        "Dassault Falcon logo or branding",
        "Sleeker, more streamlined fuselage",
        "Overall size: The Falcon 900 may appear slightly smaller and more compact compared to the Embraer Legacy 600.",
        "T-tail design",
        "Sleeker fuselage",
        "More streamlined and sleek design",
        "Landing gear configuration ",
        "Smaller, more rounded fuselage",
        "Smaller size",
        "engine configuration",
        "Distinctive nose shape",
        "A more conventional fuselage with a larger, bulkier look"
    ],
    "Fokker 100": [
        "Tail cone: The design of the tail cone or APU exhaust might be different.",
        "Landing gear placement and structure."
    ],
    "Fokker 50": [],
    "Fokker 70": [
        "T-tail configuration.",
        "Swept-back wings as opposed to the straighter wings of the Fokker 50."
    ],
    "Global Express": [
        "a T-tail with a more pronounced curve",
        "Window layout (Global Express might have different window spacings or shapes)"
    ],
    "Gulfstream": [
        "Signature \"G\" logo on tail (if present)",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Winglets with a different design compared to Gulfstream",
        "Trijet or twinjet configuration (if specifically the Falcon 2000, it’s a twinjet)",
        "Wingtip winglets (on some Gulfstream models)",
        "winglets",
        "Different nose shape, less pointed than Gulfstream",
        "often a larger, more luxurious profile compared to King Air's smaller, more compact design",
        "logo/branding",
        "tail design",
        "Distinct Gulfstream logo/branding",
        "T-tail",
        "Sleeker, more streamlined fuselage",
        "Distinctive winglets",
        "T-tail design"
    ],
    "Hawk T1": [
        "Longer, sleeker fuselage typical of a jet trainer",
        "Sleeker, streamlined fuselage",
        "short landing gear",
        "Sleeker, more aerodynamic profile (Hawk T1) vs. more traditional, boxier profile (DHC-1)",
        "Modern, sleek fuselage",
        "Small, sleek, and compact design (Hawk T1)",
        "Civilian registration markings and general aviation paint scheme",
        "Single-engine jet",
        "\\-single-engine jet design",
        "Single-engine jet design",
        "Landing Gear: The Hawk T1 has a simple tricycle landing gear, while the DC-10 has a more robust and complex landing gear to support its larger size and weight.",
        "Single jet engine exhaust at the rear (Hawk T1)",
        "Lack of propellers",
        "Short fuselage",
        "Presence of large landing gear suitable for commercial aviation (A300)"
    ],
    "Il-76": [
        "Radome: The Il-76 typically has a more pronounced radome (radar housing) on its nose compared to the C-130.",
        "T-tail configuration",
        "Radome: The Il-76 has a radar dome located under its nose, which is not typical of the Boeing 707.",
        "Three engines (two on the wings and one in the tail)",
        "Typically larger size compared to BAE-125",
        "Tail Design: The Il-76 features a T-tail, where the horizontal stabilizer is mounted at the top of the vertical stabilizer, whereas the C-130 has a conventional tail with the horizontal stabilizer mounted low on the fuselage.",
        "Tall, boxy fuselage",
        "Distinctive T-tail configuration",
        "Fuselage Shape: The Il-76 has a wider fuselage compared to the C-130.",
        "Cargo Door: The Il-76 has a rear cargo door that also serves as a ramp, while the C-130 has a cargo ramp and door at the rear fuselage.",
        "T-shaped tail",
        "T-tail configuration (Il-76) vs. conventional tail (An-12)",
        "Distinctive radome (dome-shaped weather radar cover) on the nose",
        "Four engines mounted on underwing pylons",
        "Conventional tail (not a T-tail)"
    ],
    "King Air": [
        "Landing gear (King Air often has retractable tricycle landing gear including the forward gear, while Falcon 2000 has a more robust and streamlined landing gear system adjusted for jet performance)",
        "Wing position (King Air has wings mounted low on the fuselage, while Falcon 2000 has mid-wing positioning)",
        "Retractable tricycle landing gear",
        "Landing gear: The landing gear design and placement might vary between the two, with King Air models often having simpler, less robust landing gear compared to the more substantial gear on Gulfstream jets."
    ],
    "L-1011": [
        "Rear fuselage shape: The L-1011 has a somewhat boxy rear end due to the tail engine configuration, which is different from the sleeker rear fuselage of the A340.",
        "**Winglets**: The A300 might have winglets on the tips of its wings depending on the variant, while the L-1011 does not feature winglets.",
        "Overall fuselage design: The L-1011 may have a slightly shorter, more stubby appearance compared to the longer, streamlined look of the A340.",
        "Winglets: The A340 often has winglets (small vertical fins at the wingtips), while the L-1011 does not.",
        "Airline livery and markings (Specific airlines that operated primarily the L-1011 or 757 can be a hint)",
        "**Tail-mounted engine**: The L-1011 has a distinctive third engine on the tail, integrated within an S-duct design, while the A300 has two engines mounted under the wings only.",
        "**Tail shape**: The L-1011 has a distinctive tail section with a more complex structure, incorporating the third engine, while the A300 has a simpler vertical stabilizer without an integrated engine.",
        "S-shaped air intake for the tail engine",
        "Nose shape: The L-1011 has a more rounded nose compared to the slightly more pointed nose of the A340.",
        "Nose shape (The L-1011 has a more rounded, blunt nose compared to the 757's sharper, pointed nose)",
        "S-duct on the tail engine (a curved intake leading to the rear-mounted engine)",
        "More angular-wing planes at the wing root",
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "**Nose shape**: The L-1011 generally has a more rounded and bulbous nose compared to the A300, which has a more pointed nose.",
        "Longer fuselage with a sleeker nose design"
    ],
    "MD-11": [
        "Landing Gear: The MD-11 has a different landing gear configuration, including a center landing gear, which is not present in the MD-80.",
        "Larger and more prominent landing gear",
        "Extended fuselage: the MD-11 typically has a longer fuselage compared to the A310.",
        "Three engines (two under wings and one in the tail)",
        "Sharp, angled winglets (on some models)",
        "Typically larger landing gear and higher ground clearance",
        "Trijet engine configuration (one engine on the tail and two under the wings)",
        "T-tail design (tailplane mounted at the top of the tail fin)",
        "a more modern, aerodynamic shape",
        "Trijet Configuration: The MD-11 has three engines, with one engine at the tail section and two mounted under the wings, whereas the MD-80 has two engines mounted at the rear fuselage.",
        "longer fuselage",
        "Longer fuselage",
        "Extended fuselage length compared to DC-8",
        "three engines (one on each wing and one in the tail)",
        "Winglets on the tips of the wings (some MD-90 models may not have winglets)"
    ],
    "MD-80": [
        "Older, more angular design elements",
        "More modern and sleeker design overall",
        "Distinctive \"mad dog\" shape and appearance that is bulkier"
    ],
    "MD-90": [
        "T-tail configuration on the CRJ-700 (not present on the MD-90)",
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "Winglets (some MD-90s have winglets while MD-80s generally do not)",
        "absence of the third engine at the tail (MD-90).",
        "Landing gear: MD-90's landing gear is located differently compared to the wide body design of A300.",
        "Winglets (on some models)",
        "Commercial airline livery and logos on the fuselage",
        "Nose shape: The MD-90 usually has a more pointed nose compared to the A300."
    ],
    "Metroliner": [
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "landing gear with fairings",
        "Retractable tricycle landing gear",
        "Twin turboprop engines (Metroliner)",
        "Presence of propeller blades on engines",
        "Propeller-driven engines ",
        "Twin turboprop engines mounted close to the fuselage",
        "twin turboprop engines",
        "Landing gear position (retractable gear in the wings for Metroliner)"
    ],
    "PA-28": [
        "**Fuselage Shape:** The PA-28 generally has a more rounded, tubular fuselage, whereas the SR-20 has a more streamlined and tapered fuselage.",
        "Landing gear: The PA-28 usually has fixed tricycle landing gear with the nose wheel located under the nose, while the DR-400 also has fixed tricycle landing gear but with slight design differences.",
        "fewer windows",
        "**Engine Cowling**: The PA-28’s engine cowling is more streamlined and integrated, whereas the DHC-1 might have more visible engine parts or a prominent radial engine look.",
        "Single-engine aircraft",
        "Tricycle landing gear",
        "**Landing Gear**: The PA-28 typically features a tricycle landing gear arrangement, with a nose wheel, whereas the DHC-1 usually has a taildragger configuration with the main landing gear located forward of a tail wheel.",
        "Small, single-engine design",
        "**High Wing vs. Low Wing:** PA-28 typically has a low wing configuration, meaning the wings are mounted below the fuselage."
    ],
    "SR-20": [
        "Single-engine (propeller) aircraft",
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Landing Gear: The SR-20 has fixed tricycle landing gear, whereas the A310 has retractable landing gear suited for larger aircraft.",
        "**Size:** The SR-20 is a smaller, single-engine aircraft designed for general aviation and personal use, while the EMB-120 is a larger, twin-engine regional airliner.",
        "Cirrus Aircraft logo",
        "**Single Engine:** The SR-20 has a single engine, typically a piston engine mounted at the front, whereas the EMB-120 has twin turboprop engines mounted on the wings.",
        "**Windows and Doors:** The SR-20 has fewer windows and a more streamlined fuselage compared to the EMB-120, which has multiple cabin windows along the side and larger entry doors for passengers and cargo.",
        "**Passenger Capacity:** The SR-20 typically seats 4 to 5 people, whereas the EMB-120 can seat up to 30 passengers.",
        "Single-engine piston aircraft",
        "Smaller, single-engine aircraft design",
        "**Landing Gear:** The SR-20 usually has a nosewheel (tricycle) landing gear configuration, while the EMB-120 also has a tricycle landing gear but its struts are more robust to support the larger aircraft.",
        "Generally used for personal or flight training purposes",
        "Fixed tricycle landing gear with a more streamlined design (PA-28 has less aerodynamic landing gear)",
        "Cirrus logo",
        "Retractable landing gear"
    ],
    "Saab 2000": [
        "Sleeker, more streamlined fuselage",
        "longer, sleeker fuselage",
        "Logo and branding (Airlines operating these aircraft may have distinct liveries.)",
        "Taller landing gear",
        "Longer fuselage",
        "Fewer windows in comparison to a BAE-125",
        "Sturdier, less elongated fuselage",
        "slightly pointed nose"
    ],
    "Saab 340": [
        "Saab logo or specific airline livery indicative of Saab 340 operators",
        "**Fuselage Length**: The Saab 340 has a shorter, stubbier fuselage compared to the longer, more slender fuselage of the Embraer ERJ 145.",
        "**Propeller Blades**: The Saab 2000 usually features 6-blade propellers, whereas the Saab 340 generally has 4-blade propellers.",
        "**Wing Shape**: The Saab 340 has straight wings with minimal sweep, whereas the Embraer ERJ 145 has more swept-back wings.",
        "Smaller size compared to the BAE 146",
        "**Propellers**: The Saab 340 has two turboprop engines with large, visible propellers, while the Embraer ERJ 145 has jet engines without propellers."
    ],
    "Spitfire": [
        "Retractable landing gear",
        "Tailwheel landing gear",
        "tailwheel landing gear",
        "Narrow landing gear (retractable)",
        "Tail wheel",
        "RAF (Royal Air Force) roundels and markings",
        "Propeller-driven engine",
        "Historical context: Spitfires are associated with World War II, so uniforms, other aircraft, or period-specific details might be present in the background or with the aircraft.",
        "Monoplane with elliptical wings",
        "Smaller overall size",
        "lack of a modern radar nose cone",
        "Rounded wingtips",
        "Lack of turboprop engines",
        "Elliptical wings (Spitfire) vs. straight wings with slight sweepback (Hawk T1)",
        "Single-engine piston aircraft"
    ],
    "Tornado": [
        "Twin-engine configuration",
        "twin-engine configuration",
        "smaller, more compact airframe",
        "Swing-wing design",
        "no visible cockpit or engines",
        "Twin-engine design",
        "swept wings with variable geometry (adjustable sweep angle)",
        "single or tandem cockpit configuration",
        "landing gear (if visible in a static or landing/takeoff photo)",
        "absence of solid structure and wings typical of aircraft",
        "Canopy for pilot and co-pilot",
        "Sleeker, more angular appearance suitable for combat",
        "Compact and aerodynamic airframe",
        "Presence of external weapon mounts or ordnance",
        "Camouflage or gray paint scheme (typical of military aircraft)"
    ],
    "Tu-134": [
        "Smaller size compared to the DC-8 "
    ],
    "Tu-154": [
        "A more elongated fuselage compared to the BAE-125",
        "Longer fuselage in comparison to the DC-9",
        "Shorter, more rounded nose compared to the DC-8",
        "Larger size and passenger capacity",
        "National or airline markings typical of Russian or Eastern Bloc aviation during its era",
        "Shorter, stubbier fuselage",
        "Narrow fuselage compared to the Boeing 707",
        "Presence of wing fences or winglets near the wingtips"
    ],
    "Yak-42": [
        "lack of visible propellers (ATR-72 has two propellers)",
        "Yak-42 has rounded wing tips, while Tu-154 has more angular ones",
        "Presence of winglets on later models"
    ]
}