{
    "A300": [
        "Slight dihedral wings (wings angled slightly upwards) ",
        "Winglets at the wingtips (depending on the version)",
        "Tail fin with a larger vertical stabilizer",
        "Winglets (on some models, though not as pronounced as modern aircraft)",
        "different tail design",
        "Lack of wingtip fences or sharklets (classic A300s)",
        "Positioned lower, closer to the ground when on the ground (due to shorter landing gear)",
        "More rounded nose",
        "Absence of a characteristic \"S-duct\" engine intake on the tail",
        "Smaller overall size",
        "Slightly shorter fuselage compared to DC-10",
        "smaller wingspan",
        "Winglets (depending on the model/version of A300)"
    ],
    "A310": [
        "Winglets on the wings if present (later models may have them).",
        "More modern fuselage design with fewer windows",
        "distinctive tailcone shape (more pointed on A310)",
        "T-tails (tailplane)",
        "Engine placement and type: Differences may also be found in the shape and placement of the engines under the wings."
    ],
    "A320": [
        "Absence of rear fuselage-mounted engines",
        "Winglets with a vertical upturn instead of raked wingtips (common in some 767 models)",
        "landing gear design (A320 has a simpler main landing gear structure)",
        "Proportions of the fuselage to wings  ",
        "Shorter fuselage length",
        "More modern, rounded nose shape",
        "Smaller overall size and shorter fuselage",
        "nose shape",
        "Smaller size and shorter fuselage",
        "T-tail design",
        "The absence of an extra set of landing gear near the wing roots  ",
        "Fuselage length: The A320 has a shorter fuselage compared to the A330."
    ],
    "A330": [
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "Winglets on the wingtips",
        "Distinctive winglets",
        "**Livery and Logos:** Identifiable airline branding might provide clues specific to the types of aircraft they predominantly use.",
        "Length of fuselage: The A330 generally has a longer fuselage than the A310.",
        "Winglets with a distinctive upward curve (sharklets)",
        "Tail height: The vertical tail fin of the A330 is often taller than that of the A310.",
        "Newer design with longer range and more passenger capacity",
        "Winglets with a curved design",
        "Different wingtip design (depending on the variant)",
        "Typically a slightly shorter and higher tail compared to the Boeing 767",
        "Shorter fuselage",
        "The shape of the tail cone",
        "Winglets: The A330 often features larger, more prominent winglets compared to the A310.",
        "Tail height: A380 has a taller tail compared to the A330."
    ],
    "A340": [
        "Newer, more modern design compared to A300 ",
        "Four engines (A340 has four engines, whereas Boeing 757 has two)",
        "Four engines (A340) vs. two engines (A320)",
        "Four engines",
        "Slightly larger size and more elongated shape",
        "Airbus logo on the tail or fuselage (if visible)",
        "Winglets shape (A340 winglets are different compared to A320)"
    ],
    "A380": [
        "Wingtip fences or winglets that are larger and more vertical",
        "Larger overall size in terms of length and wingspan",
        "Larger overall size and wingspan",
        "Typically wider fuselage",
        "Larger tail fin",
        "four engines mounted closer to the fuselage",
        "Distinctively larger and more rounded nose",
        "Wider and taller fuselage",
        "Often a more prominent nose design",
        "overall larger size and bulkier appearance",
        "Wingtip fences rather than raked wingtips",
        "Four engines mounted under the wings",
        "four engines",
        "Four engines",
        "slightly different tail design"
    ],
    "ATR-42": [
        "Propeller engines (ATR-42 has turboprop engines, while BAE-125 has jet engines)",
        "Fuselage shape (ATR-42 has a stubbier, more robust fuselage, while BAE-125 has a sleeker, more streamlined fuselage)",
        "More rounded nose (ATR-42)",
        "T-tail (ATR-42 has a conventional tail, whereas BAE-125 has a T-tail configuration)",
        "More modern, sleeker appearance"
    ],
    "ATR-72": [
        "A more compact, rounded fuselage.",
        "Larger capacity: The ATR-72 generally accommodates more passengers than the ATR-42, so observing seat rows through windows may help.",
        "High-wing configuration as well but with jet engines.",
        "Increased number of windows: The ATR-72 typically has more passenger windows along the fuselage.",
        "Longer fuselage: The ATR-72 has a longer fuselage compared to the ATR-42.",
        "Larger windows and fewer rows of seats compared to a jet airliner (ATR-72)",
        "Number of engines (both have two, but different types)",
        "More rounded nose shape without a pointed radar dome",
        "Longer fuselage with more windows",
        "Engine nacelle size: The engine nacelles on an ATR-72 might appear slightly larger due to more powerful engines."
    ],
    "An-12": [
        "An-12 has a rear loading ramp, while DHC-1 does not",
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "Large cargo door at the rear",
        "Soviet-era design aesthetics, often more angular and utilitarian compared to the sleek and modern appearance of an A320",
        "Different engine nacelle shape (more streamlined compared to C-130)",
        "Ramp/cargo door on An-12",
        "Cargo doors",
        "Glass nose (with windows offering a more pointed front profile)",
        "Rear cargo door (visible hinged door at the rear)",
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "High-wing design, as opposed to the low-wing design of an A320",
        "Fuselage: The An-12 has a bulkier, more rugged-looking fuselage, while the A300 has a more streamlined, modern design.",
        "Shorter fuselage than MD-11"
    ],
    "BAE 146": [
        "**Shorter fuselage:** Compared to the longer, more slender fuselage of the Embraer ERJ 145, the BAE 146 has a stubbier fuselage.",
        "Stubbier, more rounded nose",
        "A long, slender fuselage ",
        "T-tail design",
        "T-tail configuration",
        "Distinctive airbrake on the tail (sometimes deployed)",
        "**High-wing Configuration:** The BAE 146 features a high-wing design. In contrast, the Embraer ERJ 145 has a low-wing design.",
        "wide, rounded nose",
        "Shorter fuselage"
    ],
    "BAE-125": [
        "small, twin-engine business jet",
        "Size and shape: The BAE-125 is typically smaller and has a more compact shape compared to the longer and larger ERJ 145.",
        "Engine placement: The BAE-125 has engines mounted on the rear fuselage, while the ERJ 145 also has rear-fuselage-mounted engines but can be identified by their specific placement and size.",
        "Fewer windows, typically associated with business jets",
        "Number of windows: The BAE-125 has fewer windows along the fuselage as it is a smaller aircraft, while the ERJ 145 has more windows due to its greater passenger capacity.",
        "lacks propellers (as ATR-72 is a turboprop)",
        "Wing-mounted engines (turboprop in most cases)",
        "Jet engines instead of turboprops",
        "Straight wings with winglets or no winglets at all",
        "smaller size and sleeker design",
        "T-tail configuration",
        "winglets at the tips",
        "Propeller engines",
        "Tail design: The vertical and horizontal stabilizers on the BAE-125 have a distinct design compared to the ERJ 145.",
        "Smaller size/compact fuselage"
    ],
    "Beechcraft 1900": [
        "Twin propellers instead of jet engines",
        "Twin turboprop engines (as opposed to jet engines on the Legacy 600)"
    ],
    "Boeing 707": [
        "Four engines suspended on pylons under the wings (position and shape can be a clue)",
        "Smaller and more streamlined nose section",
        "A more streamlined and pointed nose",
        "Four engines mounted on pylons under the wings",
        "Wings: The Boeing 707's wings are higher and more swept than the 727's.",
        "Four engines but typically larger and more spaced apart",
        "A more complex landing gear configuration with more wheels",
        "Larger fuselage",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)",
        "Wider body",
        "Smaller and more rounded fuselage compared to the Boeing 767",
        "A slightly larger and wider fuselage",
        "Four engines under the wings",
        "Engine pylon design: The engine pylons on the Boeing 707 may differ in shape and attachment from those on the DC-8.",
        "Main landing gear: The Boeing 707 has more traditional landing gear with four wheels, while the Boeing 727 has landing gear that retracts into the fuselage."
    ],
    "Boeing 717": [
        "Lack of winglets",
        "Sleeker and more aerodynamic nose shape",
        "Winglets at the wingtips (optional on Boeing 717 but not available on Fokker 100)",
        "Nose shape (more pointed on the Boeing 717)",
        "Winglets (if present, though some 717s may not have winglets)",
        "Longer forward fuselage compared to the Fokker 100",
        "Absence of a third engine in the tail section",
        "Slightly shorter fuselage length",
        "Newer design and more modern appearance",
        "Shorter fuselage",
        "Smaller fuselage"
    ],
    "Boeing 727": [
        "More pronounced rake angle of the tail fin",
        "Longer, more slender fuselage",
        "Wide body",
        "Slightly swept wings with fewer pylons for engines",
        "A slightly longer fuselage",
        "Winglets (in some models, but not all)"
    ],
    "Boeing 737": [
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)",
        "Wingtip design, such as split scimitar winglets (737) versus sharklets (A320)",
        "Shorter fuselage",
        "Longer fuselage length"
    ],
    "Boeing 747": [
        "pronounced wing sweep",
        "distinctive \"humpback\" profile",
        "More pointed and streamlined nose",
        "Larger tail fin",
        "more prominent winglets",
        "Longer fuselage compared to the height of the tail (747)",
        "Higher and more bulbous tail fin compared to the 747",
        "Shorter and less pronounced landing gear (767)",
        "Winglets at the ends of the wings (depending on specific 747 model)",
        "Winglets on the ends of the wings (in newer models)",
        "More prominent and taller vertical stabilizer",
        "Smaller tail fin compared to the A380",
        "Wider wingspan",
        "No winglets (depending on specific A340 model) or smaller, blended winglets compared to the 747",
        "More blunt and wider nose"
    ],
    "Boeing 757": [
        "Longer, more slender fuselage",
        "No winglets",
        "more slender and pointed nose",
        "Longer fuselage with more streamlined appearance",
        "Presence of winglets or raked wingtips (depending on the model)",
        "longer fuselage",
        "Longer fuselage",
        "Higher landing gear stance",
        "T-tail absent",
        "longer fuselage length",
        "Taller main landing gear with a slight forward tilt",
        "Taller landing gear",
        "taller landing gear",
        "Narrow fuselage",
        "**Number of Engines**: The Boeing 757 typically has two engines under its wings, whereas the Boeing 777 also has two engines, but they are significantly larger."
    ],
    "Boeing 767": [
        "Taller landing gear (767 has a higher stance)",
        "landing gear",
        "Higher number of wheels on the landing gear",
        "Single bogie (two wheels) on each main landing gear",
        "The shape of the nose (the 767 has a more pointed nose compared to the 747)",
        "Larger, more rounded nose shape",
        "Four sets of landing gear wheels (two on each main gear) instead of two on the 737",
        "Wider fuselage",
        "Longer and wider body"
    ],
    "Boeing 777": [
        "**APU Exhaust**: The position and shape of the Auxiliary Power Unit (APU) exhaust at the rear can also provide clues.",
        "Generally longer overall length",
        "Number of wheels: The Boeing 777 has a larger landing gear configuration, with six wheels per main landing gear assembly, while the Boeing 737 usually has four wheels per main landing gear assembly.",
        "Longer, slender fuselage",
        "Modern, more streamlined design (Boeing 777)",
        "more modern, elongated fuselage shape",
        "Fuselage shape: The Boeing 777 has a wider, more rounded fuselage in contrast to the narrower fuselage of the Boeing 737.",
        "larger size and wingspan",
        "Six wheels per main landing gear bogie (the A330 has four)",
        "Main landing gear: The Boeing 777 usually features two sets of main landing gear, each with six wheels, while the A340 has an additional central landing gear with four wheels.",
        "**Fuselage Shape**: The Boeing 777 has a wider fuselage.",
        "**Wingspan**: The Boeing 777 has a larger wingspan.",
        "Larger wingspan",
        "Generally larger wingspan compared to most versions of the Boeing 747",
        "presence of a supercritical wing design on the 777 for better fuel efficiency"
    ],
    "C-130": [
        "Rear cargo ramp/door",
        "Rear cargo ramp for loading and unloading",
        "Wide, boxy fuselage",
        "Rear cargo ramp and door",
        "Large rear cargo ramp and door",
        "Large rear cargo ramp",
        "Squared-off fuselage rear for loading and unloading cargo",
        "Rear loading ramp",
        "Loading ramp at the rear",
        "Cargo door on the side of the fuselage toward the rear",
        "A large rear loading ramp",
        "No rear loading ramp, designed for passenger or freight transport",
        "Distinctive square-shaped cargo ramp and door at the rear",
        "The presence of a large rear cargo door: Both aircraft feature a rear cargo ramp, but the shape and design can be distinguishing factors.",
        "Larger, more robust fuselage"
    ],
    "C-47": [
        "Trijet configuration (three engines)",
        "rear door on the right side of the fuselage",
        "Large cargo door on the side",
        "Wide-body fuselage",
        "Propellers (C-47 has propellers, A310 has jet engines)",
        "Wing shape (C-47 has straight wings, whereas A310 has swept-back wings)",
        "Less elongated and more robust fuselage",
        "Round engine nacelles",
        "larger fuselage",
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "Modern jet airliner nose design",
        "Shorter fuselage: The C-47 has a shorter fuselage than the DC-6.",
        "Rounded fuselage",
        "Twin-engine configuration",
        "astrodome or navigator's bubble on top of the fuselage"
    ],
    "CRJ-200": [
        "Fuselage Shape: The CRJ-200 generally has a more cylindrical fuselage, whereas the MD-90 has a wider fuselage.",
        "Number of Engines: Both aircraft have two engines, but the placement differs; CRJ-200 engines are located at the rear of the fuselage, whereas MD-90 engines are also rear-mounted but larger."
    ],
    "CRJ-700": [
        "Generally absence of winglets",
        "T-tail design as well, but a more robust fuselage",
        "Larger, more pronounced winglets",
        "T-tail structure with slight differences in size and angle",
        "Distinctive T-tail"
    ],
    "Cessna 172": [
        "Traditional ‘tail-dragger’ or tricycle gear setup",
        "Tailwheel or tricycle landing gear configuration"
    ],
    "Cessna 208": [],
    "Cessna Citation": [
        "Less pronounced nose shape compared to Embraer Legacy 600",
        "**Fuselage shape**: The fuselage of a Cessna Citation is usually sleeker and more streamlined compared to the more boxy shape of the Beechcraft 1900.",
        "Landing gear (can vary between models, but generally simpler than Challenger 600)",
        "differences in landing gearplacement",
        "**Engine position**: Cessna Citation typically has engines mounted on the rear fuselage, while Beechcraft 1900 has engines mounted on the wings.",
        "**Wing configuration**: The Cessna Citation usually has a straight wing design, whereas the Beechcraft 1900 has a low-wing design."
    ],
    "Challenger 600": [
        "Landing gear configuration (Challenger 600 landing gear is simpler compared to the A310's more robust system)",
        "Winglets may or may not be present (as opposed to the CRJ-700 which consistently has winglets)",
        "Distinctive, shorter landing gear",
        "Typically lacks the prominent nose cone seen on the CRJ-700",
        "More spacious, shorter landing gear",
        "Winglets that are less pronounced or sometimes absent",
        "Fuselage mounted engines (closer to the tail)",
        "Landing gear: The Challenger 600 typically has two main landing gears, each with multiple wheels, and a nose gear, while the DC-10 has more complex landing gear with an additional center landing gear assembly.",
        "T-tail configuration",
        "Distinctive rounded nose",
        "Generally has fewer windows along the fuselage",
        "T-tail design",
        "Standard tail fin rather than a T-tail"
    ],
    "DC-10": [
        "T-tail configuration.",
        "Engine on the tail: On the DC-10, the tail engine is mounted just above the fuselage and in front of the vertical stabilizer, whereas the L-1011 has its tail engine embedded in the fuselage with an S-duct.",
        "**Third Engine on Tail:** The DC-10 has a distinctive third engine mounted at the base of its vertical stabilizer, whereas the A320 has only two engines mounted under the wings.",
        "Trijet configuration (distinctive third engine in the tail area)",
        "Large, distinctive tail engine intake.",
        "T-tail: The DC-10 features a T-tail design, where the horizontal stabilizer is mounted at the top of the vertical tail.",
        "T-tail design with the third engine integrated into the tail",
        "Wing-mounted engines: Both aircraft have two wing-mounted engines, but the overall design of the tail and center engine can still help in identification.",
        "engine placement (DC-10 has one engine on the tail and two under the wings, DC-3 has engines only on the wings)",
        "Tail engine intake (distinctive S-duct or straight)",
        "Tail engine intake tends to be more circular in shape",
        "Tail design: The DC-10 has a T-tail design, while the DC-8 has a more traditional tailplane.",
        "Lack of winglets on the wingtips"
    ],
    "DC-3": [
        "Classic, vintage design from the 1930s and 1940s"
    ],
    "DC-6": [
        "Overall size significantly larger than the DH-82",
        "Larger, more streamlined fuselage",
        "Generally more vintage appearance, including large rounded windows (DC-6) ",
        "Rounded nose",
        "Swept wings"
    ],
    "DC-8": [
        "Engine placement: The DC-8 has all engines mounted under the wings, whereas the DC-10 has two engines under the wings and one engine mounted on the tail.",
        "Wing design: The DC-8 tends to have shorter wings relative to its body length, whereas the DC-10 has longer wings with winglets (in some models) to support its heavy load.",
        "Number of engines: The DC-8 typically has four engines, while the DC-10 has three engines.",
        "Four engines mounted on the wing (DC-8) vs. two engines (Boeing 767)",
        "Four more narrow engines (DC-8 vs. DC-6, which has more rounded piston engines)",
        "Presence of S-duct: The DC-10 features a prominent S-duct on the tail for the third engine, which is absent in the DC-8."
    ],
    "DC-9": [],
    "DH-82": [
        "Vintage (1930s) look and design elements",
        "biplane design"
    ],
    "DHC-1": [
        "More streamlined and modern design (DHC-1) vs. more vintage, biplane design (DH-82)",
        "Vintage, military trainer appearance",
        "Single-wing (monoplane) design (DHC-1) vs. dual-wing (biplane) design (DH-82)",
        "Tricycle landing gear in some models (DHC-1) vs. taildragger landing gear (DH-82)",
        "More streamlined and less pronounced engine cowling",
        "More streamlined, military trainer appearance",
        "Straight wings with a slight dihedral",
        "Tailwheel landing gear",
        "Straight and square wings with little to no dihedral",
        "Radial engine cowling (distinctive engine shape)",
        "Landing gear: The DHC-1 features fixed landing gear, whereas the A310 has retractable landing gear for streamlined flight.",
        "Landing gear (Conventional gear on DHC-1, Tricycle gear on Hawk T1)",
        "Wing placement: The DHC-1 has low-wing configuration, with the wings positioned lower on the fuselage, whereas the A310 has a mid or high-wing configuration relative to its size.",
        "Taildragger configuration (main landing gear under the wings, with a small tailwheel)",
        "Wing shape and layout (straight wings on DHC-1, swept wings on Hawk T1)"
    ],
    "DHC-6": [
        "Fixed landing gear: The DHC-6 often has fixed landing gear, whereas the Cessna 208 might have retractable gear or different landing gear configurations.",
        "Twin engines: The DHC-6 has two engines mounted on the wings, whereas the Cessna 208 typically has a single engine.",
        "Propeller presence (DHC-6 has propellers due to turboprop engines, DC-8 does not have propellers)",
        "Fuselage shape: The DHC-6 has a boxier fuselage compared to the more streamlined fuselage of the Cessna 208.",
        "Fuselage shape (DHC-6 has a more boxy fuselage, DC-8 has a sleeker, cylindrical fuselage)",
        "Number of engines (DHC-6 has 2 engines, DC-8 has 4 engines)",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "Shorter fuselage (DHC-6 is overall shorter in length compared to DC-3)",
        "Straight wings: The wings of a DHC-6 are straight and high-mounted, compared to the slightly different wing structure of a Cessna 208.",
        "Twin-engine turboprop (DHC-6)",
        "Engine type (DHC-6 has turboprop engines, DC-8 has jet engines)",
        "Sturdy, rugged appearance suitable for STOL (Short Takeoff and Landing) operations",
        "Landing gear (DHC-6 often has fixed landing gear, DC-8 has retractable landing gear)",
        "Distinctive, more squared-off nose compared to the Cessna 172's rounded nose",
        "Short takeoff and landing (STOL) design features"
    ],
    "DR-400": [
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "Single-engine (propeller) design",
        "Low-wing monoplane design with characteristic dihedral angle",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "Single-engine",
        "Single-engine propeller",
        "Low-wing design",
        "low-wing monoplane design",
        "Single-engine propeller (as opposed to twin jet engines)",
        "Positioned for general aviation or private flying",
        "Single-engine configuration",
        "Aircraft registration usually starting with \"F-\" for French registration",
        "unique dihedral wing tips (slightly drooping)",
        "Low-wing monoplane configuration"
    ],
    "Dash 8": [
        "Slightly different nose shape (Dash 8 has a more angular nose)",
        "Propeller engines (Dash 8 typically has two propeller engines, BAE-125 has jet engines)",
        "Propeller engines (Dash 8 typically has turboprop engines while BAE 146 has jet engines)",
        "More boxy fuselage shape"
    ],
    "Dornier 328": [
        "Rounded, bulbous nose",
        "Nose shape (more rounded and shorter on the Dornier 328)"
    ],
    "EMB-120": [
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Turboprop engines (propellers) instead of jet engines",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the MD-90 has two jet engines mounted at the rear of the fuselage.",
        "Size and Body Shape: The EMB-120 is a smaller, turboprop aircraft, while the MD-90 is a larger, twin-jet commercial airliner.",
        "Fuselage Length: The EMB-120 has a comparatively shorter fuselage, while the MD-90 has a longer, more slender fuselage.",
        "Twin-engine turboprop with engines mounted on the wings",
        "smaller fuselage with a capacity of around 30 passengers",
        "Airline Livery: Many MD-90s are painted with commercial airline liveries, while EMB-120s can also be found in regional airline or corporate liveries.",
        "Sleeker and more aerodynamic nose profile",
        "twin turboprop engines (visible propellers)",
        "Landing Gear: The EMB-120 commonly has its landing gear mounted on the wings and fuselage, while the MD-90's landing gear is mounted under the fuselage and wing roots.",
        "twin turboprop engines",
        "Size and shape of the fuselage (larger and more robust in EMB-120)",
        "fewer and smaller windows compared to the A320",
        "Larger passenger capacity (typically for regional flights)"
    ],
    "Embraer E-Jet": [],
    "Embraer ERJ 145": [
        "Longer, slender fuselage",
        "Absence of winglets",
        "T-tail configuration",
        "Absence of additional winglets and extended range fuel tanks",
        "engine placement"
    ],
    "Embraer Legacy 600": [
        "Different tail cone design, more pointed on the Legacy 600",
        "Tail Design: The Legacy 600 has a more distinctive T-tail design, while the E-Jet's tail is more conventional for larger commercial aircraft.",
        "T-tail configuration",
        "More pronounced nose shape",
        "Winglets: The Legacy 600 usually has a more pronounced upward curve on its winglets compared to the relatively simpler winglets on the E-Jet series.",
        "T-tail with smaller size stabilizers",
        "T-tail design",
        "Landing gear configuration (Embraer has a different stance and wheel setup)",
        "More prominent, rounded nose",
        "A more rounded nose",
        "Slightly elongated and sleek body shape",
        "Winglets (small upward extensions at the wingtips) on the wings",
        "Presence of winglets at wingtips",
        "Engine Position: The engines on the Legacy 600 are mounted further back toward the tail, while the E-Jet’s engines are mounted on the wings.",
        "General aircraft size and proportion, Legacy 600 is typically shorter"
    ],
    "Eurofighter Typhoon": [
        "Canards (small forewings near the front)",
        "Canard foreplanes (small, wing-like structures near the nose)",
        "Canard foreplanes",
        "Canards (small wing-like structures near the nose) on the Eurofighter Typhoon",
        "Twin-engine layout",
        "civilian livery and design",
        "Smaller overall size compared to commercial airliners",
        "Canards (small forewings near the cockpit)",
        "Landing gear with more wheels to support the heavier aircraft",
        "Sharp, pointed nose cone",
        "Delta wing design",
        "Delta wing shape",
        "Sharp, angular design",
        "canards (small forward wings near the nose)",
        "canard forewings"
    ],
    "F-16": [
        "smaller size and sleeker profile",
        "Smaller size and sharper profile (F-16)",
        "Smaller size compared to commercial aircraft",
        "Single-engine design",
        "single-engine design",
        "Small size compared to commercial airliners like the Boeing 757",
        "presence of armaments or missile pylons",
        "Shorter fuselage length",
        "small, compact frame",
        "single engine",
        "Sleek, single-engine design",
        "Overall size: F-16 is generally smaller in size compared to the larger F/A-18.",
        "Small size compared to commercial airliners",
        "Delta or trapezoidal wing shape",
        "sharp, pointed nose"
    ],
    "F/A-18": [
        "swept-back wings with a more aggressive angle",
        "Sharp, angular design",
        "Wingtip missile rails or pylons",
        "Twin-engine configuration",
        "Canards",
        "twin-engine layout with afterburners",
        "twin vertical stabilizers",
        "High-wing design",
        "Single-seat or dual-seat configuration",
        "Sleek and angled design with sharp edges",
        "twin-engine jet design",
        "Absence of visible weaponry or military features",
        "Narrow fuselage",
        "Slender, swept-back wings",
        "Single vertical stabilizer (tail fin)"
    ],
    "Falcon 2000": [
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure.",
        "**Winglets**: Some models of the Falcon 2000 have distinct winglets, while the CRJ-200 commonly has raked wingtips or no winglets.",
        "Sleeker, more modern design",
        "Winglets: The Falcon 2000 often features winglets (upward-pointing extensions on the wingtips), while older models of the Challenger 600 may have none or smaller versions.",
        "Nose shape (sleeker for Falcon 2000)",
        "straight wings without winglets"
    ],
    "Falcon 900": [
        "Trijet configuration (three engines)",
        "Sleeker, more streamlined fuselage",
        "Sleeker fuselage",
        "Dassault Falcon logo or branding",
        "Distinctive nose shape",
        "Manufacturer logos or specific livery",
        "More streamlined and sleek design",
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "T-tail design",
        "A more conventional fuselage with a larger, bulkier look",
        "Signature windows characteristic of Dassault Falcon jets",
        "T-tail: The Falcon 900 features a distinctive T-tail design.",
        "More winglets or wing components",
        "Larger fuselage with a more rounded shape",
        "Smaller, more rounded fuselage"
    ],
    "Fokker 100": [
        "Landing gear placement and structure.",
        "Tail cone: The design of the tail cone or APU exhaust might be different."
    ],
    "Fokker 50": [
        "4-bladed propellers (Fokker 50) vs. 6-bladed propellers (Dornier 328)",
        "Smaller size in comparison to the ATR-72",
        "Tail Design: The Fokker 50 has a more rounded tail fin, whereas the Saab 2000's tail fin is generally more angular and upright.",
        "Propeller engines (Fokker 50) vs. jet engines (Fokker 100)",
        "Wingspan: The Fokker 50 has a wingspan of approximately 29 meters, while the Saab 2000's wingspan is around 24.76 meters.",
        "More rounded nose",
        "Propeller Count: The Fokker 50 typically has twin turboprop engines, while the Saab 2000 also has twin turboprops but may show differences in blade design and count."
    ],
    "Fokker 70": [
        "T-tail configuration: The Fokker 70 has a T-shaped tail, whereas the Boeing 737 has a conventional tail.",
        "Swept-back wings as opposed to the straighter wings of the Fokker 50.",
        "T-tail configuration.",
        "Generally shorter fuselage than long-haul jetliners but more streamlined than turboprops.",
        "Lack of a straightforward nose cone seen on the MD-80"
    ],
    "Global Express": [
        "Sleeker, more aerodynamic nose shape",
        "a T-tail with a more pronounced curve",
        "Long, slender fuselage",
        "More rounded nose design",
        "more elongated and pointed nose",
        "Longer and more pointed nose",
        "Sleeker, more elongated fuselage",
        "Logo and branding (if visible): Corporate logos or airline branding could provide clues."
    ],
    "Gulfstream": [
        "Signature \"G\" logo on tail (if present)",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Sleeker, more streamlined fuselage",
        "winglets",
        "Sleek, streamlined fuselage shape ",
        "Sleek, streamlined fuselage"
    ],
    "Hawk T1": [
        "Longer, sleeker fuselage typical of a jet trainer",
        "Sleeker, streamlined fuselage",
        "Red Arrows or similar military aerobatics team markings ",
        "Civilian registration markings and general aviation paint scheme",
        "Tricycle landing gear (one front, two rear)",
        "Lack of propellers",
        "Short fuselage",
        "Military markings or insignia, often used by air forces for training (Hawk T1)",
        "Delta wing",
        "Swept wings",
        "Fixed tricycle landing gear",
        "short landing gear",
        "Military markings and paint schemes",
        "Swept-back wings (Hawk T1) vs. straight wings (DHC-1)",
        "Modern, sleek fuselage"
    ],
    "Il-76": [
        "Fuselage shape: The Il-76 has a wider, more cylindrical fuselage designed for cargo, while the Boeing 727 has a narrower, more streamlined fuselage optimized for passenger travel.",
        "Cargo Door: The Il-76 has a rear cargo door that also serves as a ramp, while the C-130 has a cargo ramp and door at the rear fuselage.",
        "Typically larger size compared to BAE-125",
        "T-shaped tail",
        "Tall, boxy fuselage",
        "Three engines (two on the wings and one in the tail)",
        "Radome: The Il-76 has a radar dome located under its nose, which is not typical of the Boeing 707."
    ],
    "King Air": [
        "Single piston engine",
        "Smaller and more streamlined fuselage",
        "Swept wings",
        "Rounder nose design",
        "Larger fuselage",
        "Retractable tricycle landing gear",
        "Smaller fuselage",
        "Civilian/commercial use appearance",
        "Large, round fuselage",
        "Retractable landing gear that is more streamlined with the wings"
    ],
    "L-1011": [
        "**Winglets**: The A300 might have winglets on the tips of its wings depending on the variant, while the L-1011 does not feature winglets.",
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "Winglets or absence thereof (Boeing 757 often has winglets)",
        "Generally larger size compared to the A320",
        "Winglets: The A340 often has winglets (small vertical fins at the wingtips), while the L-1011 does not.",
        "Rear fuselage shape: The L-1011 has a somewhat boxy rear end due to the tail engine configuration, which is different from the sleeker rear fuselage of the A340.",
        "Number of engines: The L-1011 typically has three engines, whereas the A340 has four.",
        "Larger wing span in proportion to fuselage compared to A310",
        "**Tail shape**: The L-1011 has a distinctive tail section with a more complex structure, incorporating the third engine, while the A300 has a simpler vertical stabilizer without an integrated engine.",
        "T-tail design on the DC-9 (L-1011 has a conventional tail)",
        "More angular-wing planes at the wing root",
        "S-shaped air intake for the tail engine",
        "Airline livery and markings (Specific airlines that operated primarily the L-1011 or 757 can be a hint)",
        "Door and window arrangement (Differences in the positioning and alignment of doors and windows)",
        "Distinctive S-duct for the tail engine"
    ],
    "MD-11": [
        "Sharp, angled winglets (on some models)",
        "Length: The MD-11 is generally longer compared to the MD-80.",
        "Extended fuselage: the MD-11 typically has a longer fuselage compared to the A310.",
        "Shorter fuselage compared to the A340",
        "Trijet Configuration: The MD-11 has three engines, with one engine at the tail section and two mounted under the wings, whereas the MD-80 has two engines mounted at the rear fuselage.",
        "Three engines (two under wings and one in the tail)",
        "Three engines: The MD-11 has three engines, with one located on the tail, whereas the Boeing 767 has only two engines, both mounted under the wings.",
        "Winglets: the MD-11 has winglets (small vertical stabilizers) at the tips of the wings, whereas the A310 does not.",
        "three engines (one on each wing and one in the tail)",
        "Longer fuselage compared to the A320",
        "Trijet engine configuration (one engine on the tail and two under the wings)",
        "Tail Structure: The MD-11 often has a more pronounced T-tail with a larger horizontal stabilizer compared to the MD-80.",
        "Three-engine configuration: an MD-11 has three engines (one on each wing and one at the base of the vertical stabilizer), while an A310 has two engines (one on each wing).",
        "T-tail design (tailplane mounted at the top of the tail fin)"
    ],
    "MD-80": [],
    "MD-90": [
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "absence of the third engine at the tail (MD-90).",
        "T-tail configuration on the CRJ-700 (not present on the MD-90)",
        "Nose shape: The MD-90 usually has a more pointed nose compared to the A300.",
        "Landing gear: MD-90's landing gear is located differently compared to the wide body design of A300.",
        "Commercial airline livery and logos on the fuselage",
        "Winglets (some MD-90s have winglets while MD-80s generally do not)",
        "Length of the aircraft: The MD-90 is typically longer and slimmer than the A300.",
        "Engine type and model (MD-90 typically has IAE V2500 engines, whereas MD-80 has JT8D engines)",
        "Winglets (on some models)",
        "generally smaller size and narrower body of the MD-90.",
        "Engine type: The MD-90 uses twin rear-mounted turbofan engines, whereas the A300 has wing-mounted engines."
    ],
    "Metroliner": [
        "landing gear with fairings",
        "Fixed landing gear (in some models)",
        "Fixed (non-retractable) landing gear on some models",
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "Retractable tricycle landing gear",
        "Landing gear position (retractable gear in the wings for Metroliner)",
        "Smaller overall size compared to the Challenger 600",
        "More angular and less sleek appearance compared to a Gulfstream",
        "Propeller-driven engines ",
        "high wings with winglets"
    ],
    "PA-28": [
        "Small, single-engine design",
        "**Fuselage Shape:** The PA-28 generally has a more rounded, tubular fuselage, whereas the SR-20 has a more streamlined and tapered fuselage.",
        "fewer windows",
        "**Engine Cowling**: The PA-28’s engine cowling is more streamlined and integrated, whereas the DHC-1 might have more visible engine parts or a prominent radial engine look."
    ],
    "SR-20": [
        "Single-engine (propeller) aircraft",
        "Landing Gear: The SR-20 has fixed tricycle landing gear, whereas the A310 has retractable landing gear suited for larger aircraft.",
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Cirrus Aircraft logo",
        "Fixed tricycle landing gear with a more streamlined design (PA-28 has less aerodynamic landing gear)",
        "Retractable landing gear",
        "**Single Engine:** The SR-20 has a single engine, typically a piston engine mounted at the front, whereas the EMB-120 has twin turboprop engines mounted on the wings.",
        "Smaller, single-engine aircraft design",
        "**Landing Gear:** The SR-20 usually has a nosewheel (tricycle) landing gear configuration, while the EMB-120 also has a tricycle landing gear but its struts are more robust to support the larger aircraft.",
        "**Windows and Doors:** The SR-20 has fewer windows and a more streamlined fuselage compared to the EMB-120, which has multiple cabin windows along the side and larger entry doors for passengers and cargo.",
        "Single-engine piston aircraft",
        "Generally used for personal or flight training purposes",
        "**Size:** The SR-20 is a smaller, single-engine aircraft designed for general aviation and personal use, while the EMB-120 is a larger, twin-engine regional airliner.",
        "Retractable landing gear (in later models)",
        "**Passenger Capacity:** The SR-20 typically seats 4 to 5 people, whereas the EMB-120 can seat up to 30 passengers."
    ],
    "Saab 2000": [
        "longer, sleeker fuselage",
        "Taller landing gear",
        "Sleek, elongated fuselage",
        "Sleeker, more streamlined fuselage",
        "Wings positioned slightly further back on the fuselage",
        "slightly pointed nose",
        "T-tail design but different in shape compared to Saab 2000",
        "Elongated fuselage with a sleek design",
        "More windows along the fuselage",
        "Sturdier, less elongated fuselage",
        "Jet engines (no propellers)",
        "Number of propellers (Saab 2000 typically has 4 or 5 blades on its propellers.)",
        "Longer fuselage",
        "Presence of winglets at the tips of the wings (Saab 2000)"
    ],
    "Saab 340": [
        "**Propeller Blades**: The Saab 2000 usually features 6-blade propellers, whereas the Saab 340 generally has 4-blade propellers.",
        "**Landing Gear**: The landing gear of the Saab 340 is typically more prominent and may be more visible in photos compared to the sleeker design of the landing gear of the Embraer ERJ 145.",
        "Rounder nose shape",
        "Sleek, narrow nose profile",
        "Tricycle landing gear",
        "**Propellers**: The Saab 340 has two turboprop engines with large, visible propellers, while the Embraer ERJ 145 has jet engines without propellers.",
        "Smaller size compared to the BAE 146"
    ],
    "Spitfire": [
        "Tailwheel landing gear",
        "tailwheel landing gear",
        "Retractable landing gear",
        "Tail wheel",
        "Monoplane with elliptical wings",
        "RAF (Royal Air Force) roundels and markings",
        "Narrow landing gear (retractable)",
        "elliptical wings",
        "Elliptical wings",
        "Rounded wingtips",
        "Elliptical wings (Spitfire) vs. straight wings with slight sweepback (Hawk T1)",
        "Tailwheel undercarriage",
        "Lack of turboprop engines",
        "Propeller-driven engine",
        "Elliptical wing shape"
    ],
    "Tornado": [
        "Canopy for pilot and co-pilot",
        "single or tandem cockpit configuration",
        "no visible cockpit or engines",
        "swept wings with variable geometry (adjustable sweep angle)",
        "twin-engine configuration",
        "Twin-engine configuration",
        "Twin-engine design",
        "Swing-wing design",
        "smaller, more compact airframe",
        "sleek, aerodynamic fuselage",
        "Sleeker, more angular appearance suitable for combat",
        "No wings or engine components",
        "Compact and aerodynamic airframe",
        "Presence of external weapon mounts or ordnance",
        "twin-engine design with afterburners"
    ],
    "Tu-134": [
        "Fuselage shape: The Tu-134 has a more cylindrical fuselage, while the BAE-125 is slightly more elongated with a tapered tail.",
        "Window arrangement: The Tu-134 often has rectangular windows arranged in a straight line, while the BAE-125 has oval or round windows with a different alignment.",
        "Windows arrangement: The Tu-134 might have a different alignment and number of passenger windows compared to the Boeing 727.",
        "Fewer windows along the aircraft (Tu-134 typically has fewer windows)",
        "Passenger Doors: The Tu-134 usually has fewer passenger doors visible on the fuselage compared to the Tu-154.",
        "anhedral tailplanes (Tu-134) versus horizontal tailplanes (Yak-42)",
        "Fewer windows along the fuselage",
        "Number of Engines: The Tu-134 has two engines mounted at the rear, while the Tu-154 has three engines, with one in the tail and two under the wings.",
        "Nose shape: The Tu-134 has a more rounded nose, while the Boeing 727 has a more pointed nose.",
        "Smaller size",
        "Aircraft size: The Tu-134 is generally larger in size compared to the BAE-125."
    ],
    "Tu-154": [
        "A more elongated fuselage compared to the BAE-125",
        "Longer fuselage in comparison to the DC-9",
        "Shorter, more rounded nose compared to the DC-8",
        "Shorter, stubbier fuselage",
        "Larger size and passenger capacity",
        "National or airline markings typical of Russian or Eastern Bloc aviation during its era"
    ],
    "Yak-42": [
        "three jet engines (one on the tail, two on the wings)",
        "Yak-42 has rounded wing tips, while Tu-154 has more angular ones",
        "Presence of winglets on later models",
        "lack of visible propellers (ATR-72 has two propellers)",
        "Slightly shorter fuselage",
        "More bulbous nose shape (Yak-42 nose is less pointed than Tu-134's)"
    ]
}