{
    "A300": [
        "Airbus logo or livery markings",
        "Airbus logo or markings on the aircraft",
        "Airbus A300 logo or markings if visible",
        "Airbus logo or markings",
        "Winglets at the wingtips (depending on the version)",
        "A300 typically does not feature a T-tail (MD-90 has a T-tail configuration)",
        "Winglets (depending on the model/version of A300)",
        "Tail design (differences in vertical stabilizer and rudder)",
        "Lack of wingtip fences or sharklets (classic A300s)",
        "A broader and shorter fuselage relative to the A320",
        "Signature Airbus \"bulbous\" nose shape",
        "Positioned lower, closer to the ground when on the ground (due to shorter landing gear)",
        "different tail design",
        "different engine types (A300 typically has older engine models)",
        "Length of the fuselage: The A300 typically has a longer fuselage compared to the A310."
    ],
    "A310": [
        "Winglets on the wings if present (later models may have them).",
        "Winglets at the end of the wings (on some models)",
        "winglets on the wingtips (present on some A310 models)",
        "Winglets on the A310, which are usually absent on the DC-10",
        "T-tails (tailplane)",
        "less prominent winglets",
        "Winglets: Airbus A310s typically do not have winglets, while some Boeing 767 variants have winglets on the wings.",
        "single elevator on the horizontal stabilizer",
        "A distinct vertical stabilizer and tail shape characteristic to Airbus designs.",
        "distinctively curved winglets (if equipped)",
        "distinctive tailcone shape (more pointed on A310)",
        "Winglets: Airbus A310 typically does not have winglets, while many Boeing 757 models feature them.",
        "Tail design: The A310 has a more straight-laced fin and rudder design, while the Boeing 767's tail is more swept-back.",
        "three-section windshield (A310) vs. four-section windshield (A320)",
        "Single full passenger deck (no partial upper deck as in some larger aircraft)"
    ],
    "A320": [
        "Winglets with a vertical upturn instead of raked wingtips (common in some 767 models)",
        "Airbus logo or specific airline livery known to operate A320s",
        "sharklets (tip extensions) on wings (A320 typically has these)",
        "landing gear design (A320 has a simpler main landing gear structure)",
        "Sharklet winglets  ",
        "Distinctive Airbus nose shape (more rounded compared to the 767's more pointed nose)",
        "Sharklet wingtip devices (winglets)",
        "registration number (Airbus A320 models usually start with an \"F\" in the registration markings for commercial aircraft from Europe, while U.S. aircraft start with an \"N\")",
        "Wingtips or Sharklets on the end of the wings",
        "Winglets on the ends of the wings",
        "T-tail design",
        "Rounded nose  ",
        "Landing gear with a more complex strut and joint structure",
        "The absence of an extra set of landing gear near the wing roots  ",
        "A more noticeable curve in the upturn of the leading edge of the tail fin"
    ],
    "A330": [
        "**Wingtips:** A330 typically has wingtip devices known as winglets or sharklets, while early models of the Boeing 737 have no winglets and later models may have split scimitar winglets.",
        "Number of engines: A330 has two engines, while A380 has four.",
        "**Livery and Logos:** Identifiable airline branding might provide clues specific to the types of aircraft they predominantly use.",
        "Winglets: The A330 often features larger, more prominent winglets compared to the A310.",
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "Airbus branding or insignia on the fuselage",
        "Engine size: The A330 typically has larger engines compared to the A310.",
        "Rounded, bulbous nose",
        "Fuselage Shape: A330 has a slightly shorter and more uniform cylindrical shape, while the Boeing 777 has a visually larger and more elongated fuselage.",
        "Wing span: The A330 has longer wings compared to the A310.",
        "Different wingtip design (depending on the variant)",
        "Newer design with longer range and more passenger capacity",
        "Landing Gear: The A330 has a tricycle landing gear configuration with fewer wheels (two main landing gears with two wheels each), whereas the Boeing 777 has four wheels on each of its main landing gears.",
        "Tail height: The vertical tail fin of the A330 is often taller than that of the A310.",
        "Winglets with a distinctive upward curve (sharklets)"
    ],
    "A340": [
        "Four engines: The A340 has four engines, while the A310 has two.",
        "Winglets: The A340 often features winglets, which are absent in the A310.",
        "Airbus logo on the tail or fuselage (if visible)",
        "Winglets shape (A340 winglets are different compared to A320)",
        "Four engines (A340 has four engines, whereas Boeing 757 has two)",
        "Different tail configurations (the A340 often has a slightly higher vertical stabilizer)",
        "More modern and sleek fuselage design",
        "The A340 has a longer fuselage with a different window arrangement compared to the 777",
        "Slightly larger size and more elongated shape",
        "Winglets (A340 often has winglets that are upward-angled)",
        "Unique landing gear arrangement (A340 has a center main gear on some models)",
        "Logo and branding specific to Airbus (Airbus logos and design elements may differ from those of Boeing)",
        "Longer fuselage: The A340 generally has a longer fuselage than the A310.",
        "Aircraft tail height (A340 generally taller)",
        "Wingspan (A340 has a larger wingspan than A320)"
    ],
    "A380": [
        "The Airbus logo near the front section",
        "A distinctive hump at the front of the plane where the upper deck ends",
        "larger, more rounded nose",
        "absence of a hump on the upper deck (Boeing 747 has a distinctive hump)",
        "The A380 often has a more bulbous nose compared to the sleeker nose of the Boeing 757",
        "Distinctively larger and more rounded nose",
        "Wingtip fences or winglets that are larger and more vertical",
        "Distinctive hump due to the upper deck extending towards the tail.",
        "Distinctive hump on the upper deck (A380)",
        "Distinctive hump on the upper deck",
        "slightly different tail design",
        "Emirates and other specific airlines' logos often associated with A380",
        "Larger size and wingspan (A380)",
        "Two full passenger decks",
        "Generally more massive and larger fuselage"
    ],
    "ATR-42": [
        "Shape of the nose: The ATR-42 generally has a more rounded nose.",
        "Propeller engines (ATR-42 has turboprop engines, while BAE-125 has jet engines)",
        "Four-bladed propellers (ATR-42 usually has four-bladed, Fokker 50 has six-bladed)",
        "Size: The ATR-42 is larger in size and length compared to the DHC-6.",
        "Nose shape: The ATR-42 has a more rounded nose, whereas the DHC-6 has a more angular shape.",
        "Different engine nacelle shapes (ATR-42 has more teardrop-shaped nacelles)",
        "Twin-engine configuration (the An-12 has four engines)",
        "More modern, sleeker appearance",
        "Shorter landing gear",
        "No T-tail, as the horizontal stabilizer is at the base of the vertical stabilizer",
        "Twin turboprop engines",
        "T-tail (ATR-42 has a conventional tail, whereas BAE-125 has a T-tail configuration)",
        "Single overwing emergency exit on each side",
        "Rounded, shorter nose",
        "Engine nacelles: ATR-42 has distinct circular engine nacelles compared to the longer, more streamlined nacelles on the Dash 8."
    ],
    "ATR-72": [
        "A noticeably T-shaped tail with a horizontal stabilizer set atop the vertical stabilizer.",
        "Four jet engines mounted on pylons under the wings.",
        "High-wing configuration as well but with jet engines.",
        "Airline livery or logos (if present)",
        "Sharper, more angular tail: The ATR-72 features a prominent, angular vertical stabilizer.",
        "A more compact, rounded fuselage.",
        "Four-blade propellers (as opposed to six-blade for Fokker 50)",
        "Number of engines (both have two, but different types)",
        "High-wing configuration: The ATR-72 has wings mounted high on the fuselage.",
        "Swept-back vertical stabilizer",
        "Absence of jet engines mounted at the rear of the fuselage",
        "Longer fuselage for passenger cabin (indicative of a regional airliner)",
        "Engine nacelle shape",
        "Longer, narrower fuselage: The ATR-72 has a sleeker, elongated fuselage compared to the stubbier appearance of the BAE 146.",
        "T-tail"
    ],
    "An-12": [
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "Propellers: The An-12 has four turboprop engines with visible propellers, while the A300 has two jet engines.",
        "Four turboprop engines",
        "Four turboprop engines versus one piston engine",
        "Four turboprop engines mounted on the wings, versus the two turbofan engines of an A320",
        "Number of propeller blades (An-12 typically has four-blade propellers)",
        "Four engines compared to one (An-12 typically has four turboprop engines, while DHC-1 has one piston engine)",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "Landing gear (An-12 has retractable landing gear, PA-28 usually has fixed gear)",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "An-12 has a rear loading ramp, while DHC-1 does not",
        "Ramp/cargo door on An-12",
        "Shorter fuselage than MD-11",
        "Fuselage: The An-12 has a bulkier, more rugged-looking fuselage, while the A300 has a more streamlined, modern design."
    ],
    "BAE 146": [
        "fewer propellers (since Saab 340 is a turboprop aircraft)",
        "Steeper landing gear",
        "Steep landing and takeoff capabilities",
        "Landing gear configuration (BAE 146 has landing gear that retracts into pods on the fuselage; Dash 8 has landing gear that retracts into the engine nacelles)",
        "four engines (two on each wing)",
        "Stubbier, more rounded nose",
        "Distinctive airbrake on the tail (sometimes deployed)",
        "Low-wing configuration",
        "T-tail configuration",
        "Four jet engines mounted under the wings",
        "Longer main landing gear legs and slightly shorter aircraft length compared to a DC-9",
        "High wing position relative to the fuselage",
        "Steeper nose profile",
        "Four engines mounted under the wings",
        "Distinctive, more rounded nose shape"
    ],
    "BAE-125": [
        "small, twin-engine business jet",
        "Fewer windows, typically associated with business jets",
        "winglets at the tips",
        "Jet engines instead of turboprops",
        "Straight wings with winglets or no winglets at all",
        "Brand logos and registration markings: Look for specific airline logos, registration numbers, or other identifiers that might be visible on the aircraft.",
        "Distinctive larger and more prominent winglets (on some models)",
        "Propeller engines",
        "Swept-back wings with winglets",
        "lacks propellers (as ATR-72 is a turboprop)",
        "Engine placement: The BAE-125 has engines mounted on the rear fuselage, while the ERJ 145 also has rear-fuselage-mounted engines but can be identified by their specific placement and size.",
        "swept wings",
        "Sleeker, more aerodynamic shape",
        "Wing-mounted engines (turboprop in most cases)",
        "**Number of Engines**: The BAE-125 usually has two engines, whereas the DC-8 has four."
    ],
    "Beechcraft 1900": [
        "Beechcraft logo or specific airline markings (if visible)",
        "Smaller size with a length of approximately 57 feet",
        "Fixed landing gear visible when the aircraft is in the air",
        "Straight wings rather than swept wings",
        "T-tail structure",
        "Twin turboprop engines (as opposed to jet engines on the Legacy 600)",
        "T-tail configuration",
        "Single crew door on the left side of the fuselage",
        "More pronounced nose",
        "Smaller size with a capacity of around 19 passengers",
        "Typically used for regional and short-haul flights",
        "Narrower fuselage",
        "Longer fuselage",
        "Landing gear configuration",
        "Twin propellers instead of jet engines"
    ],
    "Boeing 707": [
        "Swept-back tail fin",
        "Older liveries often found on 707 models compared to newer liveries on 717 models",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)",
        "Larger fuselage",
        "Fuselage length: The Boeing 707 typically has a longer fuselage than the Boeing 727.",
        "Smaller fuselage diameter in Boeing 707",
        "Larger and more pronounced tail fin",
        "Wider body",
        "T-tail design present in DC-10 versus conventional tail design in Boeing 707",
        "Four engines suspended on pylons under the wings (position and shape can be a clue)",
        "Narrower fuselage compared to modern 737 versions",
        "Wings: The Boeing 707's wings are higher and more swept than the 727's.",
        "Single-deck fuselage",
        "More rounded and shorter fuselage",
        "Location of the wings: On certain Boeing 707 models, the wings may appear slightly higher on the fuselage compared to the DC-8."
    ],
    "Boeing 717": [
        "Winglets (if present, though some 717s may not have winglets)",
        "Modern livery: Boeing 717 typically has more modern airline liveries compared to the older liveries commonly found on DC-9 aircraft.",
        "Distinctive Boeing 717 branding and livery (depending on airline)",
        "Length: The Boeing 717 is longer compared to many variants of the DC-9.",
        "Winglets (optional but more common in retrofitted 717s)",
        "Smaller winglets or none, compared to MD-80 variations",
        "Absence of a third engine in the tail section",
        "Winglets at the wingtips (optional on Boeing 717 but not available on Fokker 100)",
        "Nose shape (more pointed on the Boeing 717)",
        "Lack of winglets",
        "T-tail configuration",
        "T-tail design",
        "Newer design and more modern appearance",
        "Fuselage Shape: The Boeing 717 typically has a shorter and more slender fuselage compared to most versions of the Boeing 737.",
        "Winglets: Boeing 717 often has small winglets at the tips of the wings, while earlier DC-9 models typically do not."
    ],
    "Boeing 727": [
        "Winglets (in some models, but not all)",
        "Narrower fuselage diameter compared to the DC-8",
        "Slightly swept wings with fewer pylons for engines",
        "Longer, more slender fuselage",
        "Shorter fuselage compared to the 757",
        "Smaller winglets or sometimes none at all",
        "Generally shorter wingspan and fuselage length compared to most DC-8 models",
        "A slightly longer fuselage",
        "Smaller and shorter landing gear compared to the 737",
        "Boeing 727 often has a more pointed nose",
        "Narrow body",
        "Three engines (two mounted on the rear fuselage and one at the base of the tail)",
        "Three engines: one on each side of the fuselage near the rear and one in the tail",
        "Slimmer fuselage",
        "Longer fuselage compared to Boeing 717"
    ],
    "Boeing 737": [
        "Specific registration and airline liveries, often related to the aircraft model",
        "Winglets: Check the winglets if present. The Boeing 737 may have blended winglets or split scimitar winglets, while the Boeing 757 often has winglets with a steeper angle.",
        "Winglets at the wingtips (737s often have winglets, 717s typically do not)",
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)",
        "Length of the fuselage (737 tends to be longer than 717)",
        "Winglets on the wingtips (specific models)",
        "Landing gear: The Boeing 737 typically has a shorter landing gear, keeping the fuselage closer to the ground compared to the taller landing gear of the Boeing 757.",
        "Winglets on the wingtips (depending on the model and generation)",
        "landing gear with a distinct arrangement and lower height (close to the ground)",
        "Distinctive pointed tailcone",
        "flattened or blended rear tail cone",
        "Aircraft nose shape (Boeing 737 generally has a more rounded nose)",
        "pointed nose design",
        "distinct split scimitar winglets",
        "Tail fin design"
    ],
    "Boeing 747": [
        "Shorter and less pronounced landing gear (767)",
        "Boeing branding or airline livery associated with 747s",
        "The A330 typically has two engines",
        "Distinctive nose shape, flatter and broader compared to the A340",
        "Winglets at the ends of the wings (depending on specific 747 model)",
        "More pointed nose shape",
        "pronounced wing sweep",
        "Swept-back wings with a larger span",
        "Single-deck fuselage without a hump (767)",
        "more prominent winglets",
        "Airbus logo or specific airline markings typically seen on A380s",
        "Shorter and more robust fuselage compared to the more elongated fuselage of the 757",
        "Winglets on the ends of the wings (in newer models)",
        "Boeing logo or specific airline markings typically seen on 747s",
        "Longer fuselage compared to the height of the tail (747)"
    ],
    "Boeing 757": [
        "T-tail absent",
        "winglets at the wingtips (on most 757 models)",
        "Nose shape (Boeing 757 has a more pointed nose)",
        "Pointed nose shape",
        "more slender and pointed nose",
        "No winglets",
        "Longer, slimmer appearance",
        "Tail design (Boeing 757 vertical stabilizer is more angular)",
        "Length of fuselage (Boeing 757 is longer)",
        "Wing span: The 757 has a narrower wingspan compared to the 767.",
        "Shorter landing gear and tail height",
        "**Wingspan**: The Boeing 777 has a larger wingspan than the 757.",
        "Typically fewer and smaller doors on the fuselage compared to A330",
        "Distinctive nose shape (more pointed and elongated)",
        "Longer, more slender fuselage"
    ],
    "Boeing 767": [
        "Length: The Boeing 767 is usually longer than the A320.",
        "Tail Height: Boeing 767 has a shorter tail height compared to the Boeing 777.",
        "Winglets on the tips of the wings (in some models)",
        "The shape of the nose (the 767 has a more pointed nose compared to the 747)",
        "Lack of a noticeable hump on the upper fuselage",
        "Modern, wing-mounted engines (versus the more classic, under-wing engines of the 707)",
        "Winglets at the tips of the wings (in newer models)",
        "Wingspan: Boeing 767 has a shorter wingspan compared to the Boeing 777.",
        "Two jet engines under each wing (versus four engines for the 707)",
        "Winglets that are typically larger on the 757 (if both are equipped with winglets)",
        "Differences in engine shape and mounting depending on specific engine models used",
        "Bigger engines, often with a more elongated, oval shape",
        "A wider fuselage (767 is a wide-body aircraft)",
        "Larger, more rounded nose shape",
        "winglets"
    ],
    "Boeing 777": [
        "**Fuselage Shape**: The Boeing 777 has a wider fuselage.",
        "**Wingspan**: The Boeing 777 has a larger wingspan.",
        "Engine count: Boeing 777 has two engines, while the Airbus A340 has four engines.",
        "Fuselage: Boeing 777 has a longer, wider fuselage.",
        "Fuselage shape: The Boeing 777 has a wider, more rounded fuselage in contrast to the narrower fuselage of the Boeing 737.",
        "Winglets: Boeing 777 typically does not have winglets, while the A340 often features winglets.",
        "Engine: Boeing 777 has larger, twin engines under the wings.",
        "Wingtip design: Many Boeing 777 models feature raked wingtips, whereas the Boeing 737 often has winglets.",
        "Modern, more streamlined design (Boeing 777)",
        "Raked wingtips (A330 has winglets)",
        "Wider fuselage for greater passenger capacity (Boeing 777)",
        "Wingspan: Boeing 777 has a wider wingspan compared to Boeing 717.",
        "Advanced, high-bypass turbofan engines (Boeing 777)",
        "more modern, elongated fuselage shape",
        "larger, more rounded nose"
    ],
    "C-130": [
        "Two piston engines",
        "Four turboprop engines",
        "Shorter, stockier landing gear suited for rough airstrips",
        "Short, robust landing gear",
        "Sleek, modern appearance suitable for commercial aviation",
        "Wider and more robust landing gear",
        "Shorter landing gear",
        "Two turbofan engines",
        "Tailwheel landing gear configuration",
        "Longer wingspan compared to the DHC-6",
        "No rear loading ramp, designed for passenger or freight transport",
        "T-tail configuration",
        "Shorter overall length",
        "T-tail structure",
        "Bulky and rugged appearance for tactical airlift operations"
    ],
    "C-47": [
        "Two engines: The C-47 has two engines, whereas the DC-6 has four.",
        "Shorter fuselage: The C-47 has a shorter fuselage than the DC-6.",
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "Absence of modern jet engines",
        "Propellers (C-47 has propellers, A310 has jet engines)",
        "Tailwheel landing gear",
        "larger wingspan relative to fuselage",
        "Straight, non-swept wings",
        "Landing gear: The C-47 features a tailwheel landing gear configuration, while the DC-6 typically has a tricycle landing gear system.",
        "WWII-era design (C-47 has a vintage, older design typical of WWII aircraft)",
        "Radial piston engines",
        "Trijet configuration (three engines)",
        "Twin-engine setup",
        "Tail wheel landing gear",
        "Twin radial engines"
    ],
    "CRJ-200": [
        "T-tail configuration but with more pronounced tail structure",
        "Size and Length: The CRJ-200 is smaller and shorter than the MD-90.",
        "A single propeller engine mounted at the front",
        "Absence of winglets (on most CRJ-200 models)",
        "Rounder, less pointed nose",
        "Wings: The wings of the CRJ-200 are mounted lower on the body compared to the MD-90.",
        "Absence of winglets",
        "Distinctive sharp, pointed nose",
        "T-tail configuration ",
        "T-tail configuration",
        "different tail height",
        "single overwing emergency exit on each side",
        "Winglets on the tips of the wings",
        "No winglets on many models",
        "Engines also at the rear but slightly different mounting"
    ],
    "CRJ-700": [
        "Larger, more pronounced winglets",
        "Tail Design: The CRJ-700 typically features a T-tail design, while the MD-80 often has a low tailplane or horizontal stabilizer.",
        "Winglets at the tips of the wings (though some CRJ-200 models can also have them, they are more common on the CRJ-700)",
        "T-tail configuration",
        "T-tail structure with slight differences in size and angle",
        "Winglets or small vertical extensions at the wingtips",
        "Different landing gear configuration (the CRJ-700 has taller landing gear)",
        "Winglets on the tips of the wings",
        "Winglets on the wingtips",
        "Classic, older aircraft design features",
        "T-tail design as well, but a more robust fuselage",
        "More complex landing gear structure",
        "Regional jet design with a lower height profile",
        "Generally absence of winglets",
        "Shorter and more pointed nose"
    ],
    "Cessna 172": [
        "Fixed landing gear (compared to the often retractable gear on the DHC-1)",
        "fixed landing gear",
        "Fixed landing gear",
        "Traditional ‘tail-dragger’ or tricycle gear setup",
        "Generally found in a lighter, simpler paint scheme",
        "Tricycle landing gear (nose wheel included)",
        "Fixed, non-retractable landing gear",
        "Tailwheel or tricycle landing gear configuration",
        "single engine with a propeller in the front",
        "Smaller size and more compact",
        "Single exhaust",
        "twin engines with propellers",
        "Smaller size compared to the DHC-6",
        "Multiple engines (usually four propellers)",
        "Smaller size and simpler design"
    ],
    "Cessna 208": [
        "Fixed landing gear",
        "fixed landing gear",
        "Fixed landing gear (non-retractable)",
        "Fixed landing gear (Cessna 208) vs. retractable landing gear (Dash 8)",
        "Number of seats (Cessna 208 seats up to around 14, Boeing 737 seats over 130)",
        "High-wing design (Cessna 208) vs. low-wing design (Dash 8)",
        "Single-engine propeller (Cessna 208) vs. twin-engine turboprop (Dash 8)",
        "Engine nacelles: The DHC-6's engine nacelles on the wings may help identify it, whereas the Cessna 208 lacks these due to its single-engine configuration.",
        "Turboprop engine rather than jet engines",
        "sleeker, more compact fuselage",
        "Shorter fuselage compared to Beechcraft 1900",
        "Size of the aircraft (Cessna 208 is significantly smaller)",
        "Single turboprop engine",
        "Longer fuselage compared to Cessna 208",
        "lack of jet engines"
    ],
    "Cessna Citation": [
        "**Tail design:** Cessna Citations usually have a T-tail design.",
        "**Number of engines:** Cessna Citations typically have two engines.",
        "**Size:** Cessna Citations are generally smaller.",
        "**Distinctive Features:** Check for any model-specific features or markings.",
        "swept wings",
        "Swept wings",
        "Winglets on the wingtips (on some models)",
        "landing gear configuration",
        "swept-back wings",
        "**Nose Shape:** Cessna Citations often have a more pointed nose. ",
        "Distinctive winglets (depending on specific Cessna Citation model)",
        "**Engine position**: Cessna Citation typically has engines mounted on the rear fuselage, while Beechcraft 1900 has engines mounted on the wings.",
        "winglets on some models",
        "**Number of engines**: The Cessna Citation is a jet with typically two jet engines, whereas the Beechcraft 1900 is a turboprop with two propeller engines.",
        "**Tail design**: The Cessna Citation often features a T-tail configuration, whereas the Beechcraft 1900 has a conventional tail design."
    ],
    "Challenger 600": [
        "Swept-back wings",
        "Winglets may or may not be present (as opposed to the CRJ-700 which consistently has winglets)",
        "Winglets that are less pronounced or sometimes absent",
        "Twin jet engines (mounted on the rear fuselage) ",
        "T-tail configuration on Challenger 600",
        "Distinctive, shorter landing gear",
        "More spacious, shorter landing gear",
        "Generally smaller overall size compared to the CRJ-700",
        "T-tail configuration",
        "Fuselage mounted engines (closer to the tail)",
        "Challenger 600 typically has a sleeker, more streamlined appearance",
        "Rear-mounted engines",
        "Distinctive T-tail configuration",
        "Distinctive rounded nose",
        "Tail design: The Challenger 600 has a T-tail design, whereas the DC-10 has a conventional tail with the third engine mounted."
    ],
    "DC-10": [
        "Less pronounced curve or angle in the nose section compared to the MD-11",
        "landing gear (DC-10 has retractable tricycle landing gear, DC-3 has fixed landing gear)",
        "Larger wingspan and overall size.",
        "T-tail configuration.",
        "fuselage shape (DC-10 has a wider, more modern fuselage)",
        "Wider fuselage.",
        "Lack of winglets on the wingtips",
        "Tail design: The DC-10 has a T-tail design, while the DC-8 has a more traditional tailplane.",
        "Three engines: one under each wing and one at the base of the vertical stabilizer.",
        "Wing-mounted engines: Both aircraft have two wing-mounted engines, but the overall design of the tail and center engine can still help in identification.",
        "More rounded nose compared to the more pointed nose of the DC-9",
        "Tail engine intake: The DC-10's tail-mounted engine has a prominent S-duct intake design.",
        "Three engines: one on each wing and a third in the tail (distinctive for the DC-10)",
        "Three engines (one on each wing and one at the base of the vertical stabilizer)",
        "Large, distinctive tail engine intake."
    ],
    "DC-3": [
        "Tailwheel (as opposed to nosewheel)",
        "Tailwheel landing gear (DC-3) instead of tricycle landing gear (DHC-6)",
        "Single vertical stabilizer with rudder",
        "tailwheel landing gear (taildragger)",
        "Tailwheel landing gear",
        "Number of engines (DC-3 has 2 engines, DC-9 typically has 2 engines located at the rear)",
        "Tandem main gear and single tail wheel configuration",
        "absence of a cargo door",
        "twin-engine configuration",
        "Twin-engine configuration",
        "Tail configuration (DC-3 has a conventional tailplane, DC-9 has a T-tail)",
        "Distinctive un-swept, straight wings",
        "propeller-driven engines",
        "distinctive, spatted main landing gear",
        "commonly used for cargo or vintage flights"
    ],
    "DC-6": [
        "Four engines: The DC-6 has four engines, while the DC-3 has two.",
        "Four propeller engines (DC-6) compared to jet engines (DC-10)",
        "Tailwheel landing gear (in some variants)",
        "Propeller engines (DC-6 has four propeller engines while the Boeing 757 has jet engines)",
        "Propeller engines (DC-6) instead of jet engines (DC-9)",
        "Lower ground clearance",
        "Swept wings",
        "Larger wingspan: The DC-6 has a larger wingspan relative to the DC-3.",
        "Tail-dragger type landing gear",
        "Tail-wheel landing gear",
        "Landing gear with smaller, less robust wheels",
        "Four engines (DC-6) as opposed to two (DC-9)",
        "Four propeller engines",
        "Four-engine configuration",
        "Propeller engines"
    ],
    "DC-8": [
        "Number of engines: The DC-8 typically has four engines, while the DC-10 has three engines.",
        "Four engines mounted under the wings (compared to the A320's two engines)",
        "Lack of modern winglets found on many newer planes, such as those on the A320",
        "Turbojet engines (DC-8)",
        "Swept-back wings (DC-8)",
        "Longer and thinner profile compared to the more compact, modern look of the A320",
        "Single story cabin (compared to the 747's distinctive hump for the upper deck)",
        "Lack of T-tail (DC-8 has a conventional tail, whereas DC-9 has a T-tail)",
        "Four more narrow engines (DC-8 vs. DC-6, which has more rounded piston engines)",
        "Four engines mounted under the wings (both have this, but different configurations)",
        "Narrower fuselage compared to the A310",
        "Narrower fuselage",
        "Older, more tapered wing design",
        "Narrower fuselage (DC-8) vs. wider fuselage (Boeing 767)",
        "Generally smaller and fewer windows on the DC-8 compared to the Boeing 767"
    ],
    "DC-9": [
        "Jet engines (as opposed to propellers)",
        "Limited number of emergency exits (typically 3 on each side)",
        "No winglets at the wingtips (whereas many Boeing 767 models have winglets)",
        "Absence of aerodynamic improvements like winglets",
        "Number of engines: The DC-9 has two engines, while the DC-6 has four engines.",
        "Lower tail height in comparison to the MD-80",
        "Landing gear with a simpler, single-bogey main gear setup",
        "Sleeker, more modern fuselage",
        "Generally simpler, more compact appearance",
        "T-tail design: The DC-9 has a distinctive T-tail, while the DC-6 has a conventional tail.",
        "Fewer sets of landing gear (typically two main landing gears compared to the 727's three)",
        "Absence of an engine on the vertical stabilizer (tail)",
        "Distinctive engine nacelles closer to the tail",
        "T-tail configuration",
        "Shorter, more narrow fuselage"
    ],
    "DH-82": [
        "Fixed tailwheel landing gear",
        "Fixed landing gear with a tailwheel",
        "fixed landing gear with tailwheel",
        "Fixed landing gear with tailwheel",
        "Tailwheel landing gear configuration",
        "Fixed, non-retractable landing gear with a tailwheel",
        "Often painted in bright, eye-catching colors",
        "Historic look, often associated with vintage aircraft from the 1930s",
        "radial engine (often visible)",
        "fixed landing gear",
        "Smaller size and lighter weight",
        "Biplane configuration (two sets of wings)",
        "Biplane design (two sets of wings)",
        "biplane design",
        "Radial engine mounted at the front"
    ],
    "DHC-1": [
        "Radial engine cowling (distinctive engine shape)",
        "Tailwheel undercarriage",
        "Tailwheel landing gear",
        "Conventional tailwheel (tail-dragger) landing gear",
        "Taildragger configuration (main landing gear under the wings, with a small tailwheel)",
        "Number of engines: The DHC-1 has one engine, whereas the A310 has two jet engines.",
        "Landing gear (Conventional gear on DHC-1, Tricycle gear on Hawk T1)",
        "Fixed landing gear",
        "Vintage, military trainer appearance",
        "More streamlined and less pronounced engine cowling",
        "Smaller size and light aircraft build",
        "Propeller-driven engine",
        "Tricycle landing gear in some models (DHC-1) vs. taildragger landing gear (DH-82)",
        "Propeller at the front of the aircraft",
        "Dual exhaust pipes that often protrude from both sides of the cowling"
    ],
    "DHC-6": [
        "Sturdy, rugged appearance suitable for STOL (Short Takeoff and Landing) operations",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "Short takeoff and landing (STOL) design features",
        "T-tail (horizontal stabilizer mounted on the top of the vertical stabilizer) ",
        "Longer fuselage designed for carrying more passengers or cargo",
        "fixed, non-retractable landing gear",
        "Fixed landing gear (non-retractable)",
        "Fixed, non-retractable landing gear (DHC-6)",
        "Straight wings: The wings of a DHC-6 are straight and high-mounted, compared to the slightly different wing structure of a Cessna 208.",
        "Dual tail fins in the horizontal stabilizer configuration",
        "Tail design: The DHC-6 has twin tail fins, while the Cessna 208 has a single tail fin.",
        "Twin engines: The DHC-6 has two engines mounted on the wings, whereas the Cessna 208 typically has a single engine.",
        "Twin-engine piston or turboprop engines",
        "Twin-engine setup",
        "Squared-off vertical stabilizer"
    ],
    "DR-400": [
        "**Bubble canopy**: The DR-400 usually has a clear bubble canopy that provides a panoramic view for the occupants.",
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "retractable gear (in some DR-400 models)",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "Size: The DR-400 is much smaller compared to the A300.",
        "Fixed tricycle landing gear",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "different door placement (PA-28 has doors on the side, DR-400 tends to be more centralized access)",
        "Tricycle landing gear with the nose wheel set further back",
        "**Fixed landing gear**: The DR-400 typically has non-retractable landing gear.",
        "Traditional cockpit with mostly analog instruments",
        "Usage: The DR-400 is used for general aviation, while the A300 is designed for commercial airline service.",
        "Positioned for general aviation or private flying",
        "Larger size intended for regional airline service",
        "Canopy opens sideways for pilot and passenger access"
    ],
    "Dash 8": [
        "Distinctive engine nacelles (engine housings on wings) ",
        "Propellers (Dash 8 has turboprop engines, whereas the DC-8 has jet engines)",
        "Four-bladed propellers (depending on the specific Dash 8 model)",
        "Presence of nacelles for turboprop engines near the wings",
        "Propeller engines (Dash 8 typically has two propeller engines, BAE-125 has jet engines)",
        "Four-bladed propellers",
        "Landing gear (Dash 8 has larger, more robust landing gear suitable for rugged runways)",
        "Protruding landing gear (due to high wings)",
        "Fixed landing gear (in some models)",
        "Propeller engines (Dash 8 typically has turboprop engines while BAE 146 has jet engines)",
        "Two turboprop engines",
        "Twin-engine turboprop",
        "Four-bladed propellers on each engine (primarily in the Dash 8 series)",
        "Slightly different nose shape (Dash 8 has a more angular nose)",
        "Twin-engine turboprop configuration"
    ],
    "Dornier 328": [
        "twin turboprop engines (usually visible on the wings)",
        "Turboprop engines (as opposed to jet engines)",
        "Distinctive propeller shape (often 4-blade on Dornier 328, versus 6-blade on ATR-72)",
        "Rounded, bulbous nose",
        "Two propeller blades on each engine",
        "T-tail design on the Dornier 328 vs. conventional tail on the Beechcraft 1900",
        "propeller engines",
        "Four propeller blades on each engine",
        "More compact and shorter fuselage on the Dornier 328 compared to the BAE 146",
        "High wing design on the Dornier 328 versus the low wing on the BAE 146",
        "Wing dihedral (a noticeable upward angle of the wings)",
        "Engine placement (Dornier 328 has engines mounted on pylons beneath the wings)",
        "sleeker and more streamlined fuselage",
        "Twin turboprop engines mounted on the wings",
        "Smaller size (seats about 30-33 passengers)"
    ],
    "EMB-120": [
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Size and Body Shape: The EMB-120 is a smaller, turboprop aircraft, while the MD-90 is a larger, twin-jet commercial airliner.",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the MD-90 has two jet engines mounted at the rear of the fuselage.",
        "Logo or airline markings (often seen on regional jets like EMB-120)",
        "Airline Livery: Many MD-90s are painted with commercial airline liveries, while EMB-120s can also be found in regional airline or corporate liveries.",
        "Turboprop engines (propellers) instead of jet engines",
        "turboprop engines",
        "Turboprop engines",
        "twin turboprop engines (visible propellers)",
        "Larger passenger capacity (typically for regional flights)",
        "Landing Gear: The EMB-120 commonly has its landing gear mounted on the wings and fuselage, while the MD-90's landing gear is mounted under the fuselage and wing roots.",
        "twin turboprop engines",
        "fewer and smaller windows compared to the A320",
        "Size: The EMB-120 is significantly smaller than the DC-10.",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the DC-10 has three jet engines (two on the wings and one on the tail)."
    ],
    "Embraer E-Jet": [
        "Winglets: Embraer E-Jets typically have winglets, while Fokker 100s do not.",
        "absence of propellers (Beechcraft 1900 has twin turboprop engines)",
        "Main Landing Gear: The E-Jets have a shorter, more compact main landing gear compared to the longer and more visible landing gear of the Fokker 100.",
        "Tail Design: The E-Jets usually have a slightly more swept-back horizontal stabilizer and a different tail fin design in comparison to the Fokker 100.",
        "Fuselage Shape: The fuselage of the E-Jet is typically sleeker and more streamlined, while the Fokker 100 has a slightly bulkier, older design.",
        "Less pronounced swept wings",
        "two or more emergency exits over the wings",
        "Engines: The E-Jets have engines that are mounted under the wings, whereas the Fokker 100 has rear-mounted engines.",
        "Nose Shape: The E-Jets have a more pointed, sleek nose, compared to the more rounded nose of the Fokker 100.",
        "Distinctive \"T-tail\" configuration in some E-Jet models (e.g., E170)",
        "Winglets: Most Embraer E-Jets have distinctive upward winglets, whereas the DC-9 typically does not.",
        "longer landing gear legs",
        "less pronounced nose shape",
        "fewer or no emergency exits over the wings",
        "Fuselage Shape: The Embraer E-Jet tends to have a more modern appearance with a smoother, more streamlined fuselage compared to the older, more cylindrical shape of the DC-9."
    ],
    "Embraer ERJ 145": [
        "Length: The ERJ 145 is considerably longer than the Beechcraft 1900.",
        "Length: The ERJ 145 tends to be slightly longer than the CRJ-200.",
        "Landing gear: Differences in the landing gear configuration can help differentiate between the two aircraft.",
        "Wing Design: The wings of the ERJ 145 have a slightly swept-back design, whereas the Beechcraft 1900 has straighter wings.",
        "Winglets: The ERJ 145 often lacks the winglets found on the Legacy 600",
        "Jet Engines: The ERJ 145 has two rear-mounted jet engines, whereas the Beechcraft 1900 has two turboprop engines mounted on the wings.",
        "Absence of winglets",
        "Shorter length (around 98 feet for the ERJ 145)",
        "Distinctive pointed nose shape",
        "Short and thin landing gear struts",
        "landing gear configuration",
        "T-tail configuration",
        "Wing configuration: Look at the wing shape and placement relative to the fuselage. The Embraer ERJ 145 has swept wings, while the Fokker 70 may have a different wing configuration.",
        "T-shaped tail",
        "Length of the aircraft: The Embraer ERJ 145 is generally longer than the Fokker 70."
    ],
    "Embraer Legacy 600": [
        "Swept wings",
        "Longer landing gear",
        "Winglets: The Legacy 600 usually has a more pronounced upward curve on its winglets compared to the relatively simpler winglets on the E-Jet series.",
        "Landing gear configuration (Embraer has a different stance and wheel setup)",
        "Winglets on the tips of the wings",
        "Winglets on the ends of the wings",
        "More pronounced nose shape",
        "Size: The Legacy 600 is generally smaller and more streamlined compared to the E-Jet, which is a regional jet with a larger capacity.",
        "Winglets",
        "Swept tail fin (vertical stabilizer)",
        "Winglets (small upward extensions at the wingtips) on the wings",
        "T-tail configuration",
        "Presence of winglets at wingtips",
        "Three engines (one on each rear side and one in the tail)",
        "A more rounded nose"
    ],
    "Eurofighter Typhoon": [
        "civilian livery and design",
        "military-grade camouflage or gray paint scheme",
        "Presence of modern radar and sensor systems",
        "presence of underwing stores (weapons or fuel tanks)",
        "Military camouflage or jet grey coloring",
        "Low-visibility gray paint scheme",
        "Canards (small forewings near the front)",
        "Military markings and insignia",
        "Distinctive airline liveries or branding",
        "Canard foreplanes (small, wing-like structures near the nose)",
        "canards (small forward wings near the nose)",
        "Delta wing configuration",
        "delta wing configuration",
        "Absence of large commercial airline windows",
        "Delta wing design"
    ],
    "F-16": [
        "Military markings (e.g., camouflage paint, military insignia)",
        "Presence of weaponry or pylons for attaching bombs/missiles",
        "Use and markings: F-16 is often seen with U.S. Air Force markings, while F/A-18 is commonly marked with U.S. Navy or Marine Corps insignia.",
        "Compact and agile airframe",
        "Military camouflage or markings",
        "LERX (Leading Edge Root Extensions): Both aircraft have these, but their shapes differ and can be used as distinguishing characteristics.",
        "Presence of weapons and external fuel tanks (F-16)",
        "Military markings or camouflage paint",
        "Military markings and insignia",
        "smaller size and sleeker profile",
        "Smaller size and sharper profile (F-16)",
        "Smaller size compared to commercial aircraft",
        "Single-engine configuration",
        "presence of external armament (bombs, missiles)",
        "Presence of weapons or weapon hardpoints (if visible)"
    ],
    "F/A-18": [
        "Tailhook (for carrier-based landing)",
        "Wingtip missile rails or pylons",
        "folding wingtips (for carrier storage)",
        "Tactical paint schemes (often gray or camouflage) ",
        "military-grade weaponry and pylons",
        "swept-back wings with a more aggressive angle",
        "external weaponry or pylons for missiles and bombs",
        "Twin tail fins (vertical stabilizers)",
        "Twin tail fins",
        "shorter, more robust landing gear",
        "Carrier-capable tailhook",
        "Distinctive twin vertical stabilizers (tail fins)",
        "LEX (Leading Edge Extensions) running from the fuselage",
        "Twin-engine configuration",
        "Larger landing gear designed for airport runways"
    ],
    "Falcon 2000": [
        "**Winglets**: Some models of the Falcon 2000 have distinct winglets, while the CRJ-200 commonly has raked wingtips or no winglets.",
        "Twin-engine jet vs. single-engine propeller",
        "Low-wing aircraft vs. low-wing (with visible struts supporting wings)",
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure.",
        "Nose shape (sleeker for Falcon 2000)",
        "Swept wings with a slight upward angle",
        "Winglets: The Falcon 2000 often features winglets (upward-pointing extensions on the wingtips), while older models of the Challenger 600 may have none or smaller versions.",
        "Position of engines (mounted on the fuselage for Falcon 2000, not on the wings)",
        "Manufacturer logo (Dassault for Falcon 2000)",
        "Distinctive winglets on the wingtips (in some models)",
        "**Size and Length**: The Falcon 2000 is generally smaller than the CRJ-200.",
        "Winglets on the ends of the wings",
        "Sleeker, more modern design",
        "private jet design (luxurious and compact appearance)",
        "Two jet engines (as opposed to three in the Falcon 900)"
    ],
    "Falcon 900": [
        "Signature windows characteristic of Dassault Falcon jets",
        "T-tail: The Falcon 900 features a distinctive T-tail design.",
        "Swept-back winglets on the tips of the wings",
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "Dassault Falcon logo or branding",
        "More winglets or wing components",
        "Winglets at the end (Falcon 900)",
        "Swept wings (Falcon 900)",
        "Landing gear configuration ",
        "Distinctive winglets (blended into the wing)",
        "Manufacturer logos or specific livery",
        "Smaller, round windows",
        "engine configuration",
        "Trijet configuration (three engines)",
        "wing location (low wing for Falcon 900)"
    ],
    "Fokker 100": [
        "Landing gear placement and structure.",
        "T-tail (horizontal stabilizer mounted on top of the vertical stabilizer).",
        "Winglets: Fokker 100 often has small winglets at the tips, while the DC-9 does not.",
        "Two engines mounted on the rear of the fuselage (Fokker 100 has this configuration).",
        "Tail cone: The design of the tail cone or APU exhaust might be different.",
        "Larger size and longer fuselage.",
        "Absence of a third engine in the tail (Boeing 727 has three engines)",
        "T-tail configuration",
        "wing-mounted engines (Fokker 50 has none; it has turboprop engines instead)",
        "length of the fuselage (Fokker 100 has a longer fuselage)",
        "shape and size of tail section (Fokker 100's tail is larger and differently shaped)",
        "T-tail design",
        "Lack of winglets on the wings (Boeing 757 often has winglets)",
        "Different wing design and landing gear configuration",
        "Fuselage length: Fokker 100 generally appears longer and more slender compared to the DC-9's shorter, stubbier fuselage."
    ],
    "Fokker 50": [
        "4-bladed propellers (Fokker 50) vs. 6-bladed propellers (Dornier 328)",
        "Propellers: The Fokker 50 has two turboprop engines with visible propellers, whereas the Fokker 70 is a jet aircraft with turbofan engines and no propellers.",
        "**Propellers**: The Fokker 50 is a turboprop aircraft and has large propellers on its wings, while the Embraer ERJ 145 is a jet and has jet engines.",
        "Propeller Count: The Fokker 50 typically has twin turboprop engines, while the Saab 2000 also has twin turboprops but may show differences in blade design and count.",
        "Typically four-blade propellers on engines (ATR-42 generally has six-blade propellers)",
        "Four-bladed propellers",
        "Two turboprop engines (one on each wing)",
        "Twin-turboprop engines",
        "Propellers on the engines, indicating a turboprop aircraft",
        "Landing Gear: The landing gear configuration of the Fokker 50 could differ; for instance, the number and placement of wheels may vary in comparison to the Saab 2000.",
        "Fokker 50 has a more pronounced upward curve at the end of the tail section",
        "Propeller engines (Fokker 50) vs. jet engines (Fokker 100)",
        "Presence of a small \"shark fin\" antenna on top of the fuselage",
        "Fokker 50 has a more rounded nose",
        "Dual main landing gear closer to the fuselage"
    ],
    "Fokker 70": [
        "Swept-back wings as opposed to the straighter wings of the Fokker 50.",
        "T-tail configuration.",
        "Lack of a straightforward nose cone seen on the MD-80",
        "Turbojet engines mounted on the rear fuselage rather than propellers on the wings.",
        "Landing gear (Fokker 70 has a simpler landing gear setup compared to the Boeing 727)",
        "Winglets: Some Boeing 737 models have winglets at the tips of the wings, which are less common on the Fokker 70.",
        "Sleek, rear-mounted twinjet design.",
        "Pointed nose shape",
        "Size: The Fokker 70 is generally shorter and smaller than the Boeing 737.",
        "Conventional tail (not T-tail)",
        "Smaller wingspan relative to the MD-80",
        "Distinctive larger winglets",
        "Main landing gear closer to the wings",
        "Landing gear: The Fokker 70 typically has a simpler main landing gear configuration compared to the Boeing 737.",
        "T-tail design"
    ],
    "Global Express": [
        "manufacturer logo (Bombardier for Global Express, Dassault for Falcon 900)",
        "Landing Gear: The Global Express has retractable landing gear with a different configuration compared to the CRJ-200.",
        "Landing gear configuration",
        "Landing gear configuration and design",
        "additional antenna arrays and sensors",
        "Window layout (Global Express might have different window spacings or shapes)",
        "Nose shape (Global Express has a more pointed nose)",
        "distinctive landing gear configuration",
        "Fuselage Length: The Global Express has a longer fuselage compared to the CRJ-200.",
        "Nose shape: The Global Express often has a sleeker, more pointed nose.",
        "Winglets on the tips of the wings",
        "Longer and more pointed nose",
        "a T-tail with a more pronounced curve",
        "Swept-back wings",
        "tail design (Global Express has a T-tail, Falcon 900 has an H-tail configuration)"
    ],
    "Gulfstream": [
        "Trijet or twinjet configuration (if specifically the Falcon 2000, it’s a twinjet)",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Distinct Gulfstream logo/branding",
        "Winglets with a different design compared to Gulfstream",
        "landing gear configuration",
        "Wingtip winglets (on some Gulfstream models)",
        "winglets",
        "logo/branding",
        "Different nose shape, less pointed than Gulfstream",
        "placement of engines (rear-mounted for Gulfstream)",
        "Jet engines mounted on the rear fuselage",
        "T-tail",
        "Signature \"G\" logo on tail (if present)",
        "Smaller fuselage relative to Gulfstream aircraft",
        "Dual engines mounted close to the rear of the fuselage"
    ],
    "Hawk T1": [
        "Red Arrows or similar military aerobatics team markings ",
        "Red, white, and blue color scheme (common for Hawk T1 in RAF service)",
        "Canopy designed for two tandem seats (instructor and trainee)",
        "Longer, sleeker fuselage typical of a jet trainer",
        "Military markings or insignia, often used by air forces for training (Hawk T1)",
        "Single jet engine exhaust at the rear (Hawk T1)",
        "short landing gear",
        "Military markings and paint schemes",
        "Military markings",
        "Single jet engine",
        "Pointed nose",
        "Turbine jet engine exhaust",
        "sharp, swept-back wings",
        "Small, pointed nose",
        "military color scheme or markings"
    ],
    "Il-76": [
        "Three engines (two on the wings and one in the tail)",
        "Bulky landing gear located in fairings on the fuselage sides",
        "Tall, boxy fuselage",
        "Rear cargo ramp/door",
        "Four engines mounted under the wings",
        "Large, robust landing gear designed for rough airstrips",
        "T-shaped tail (horizontal stabilizer located at the top of the vertical stabilizer)",
        "Long fuselage with a pointed nose",
        "Four engines mounted on underwing pylons",
        "Distinctive radome (dome-shaped weather radar cover) on the nose",
        "Number of engines: The Il-76 typically has four engines mounted under its wings.",
        "Conventional tail (not a T-tail)",
        "Generally bulkier and larger fuselage",
        "Shorter nose and overall fuselage length",
        "Four engines mounted on pylons under the wings"
    ],
    "King Air": [
        "Propellers (King Air has turboprop engines, while Cessna Citation has jet engines)",
        "Landing gear: The landing gear design and placement might vary between the two, with King Air models often having simpler, less robust landing gear compared to the more substantial gear on Gulfstream jets.",
        "Propellers: King Air aircraft typically have propellers, while Gulfstream jets are known for their turbofan engines.",
        "Twin turboprop engines",
        "More contemporary design with modern avionics",
        "Twin jet engines",
        "Wider fuselage for passengers/comfort",
        "Turboprop engines with prominent propeller spinners",
        "Propeller engines (King Air has twin turboprop engines, while Falcon 2000 has jet engines)",
        "Retractable landing gear that is more streamlined with the wings",
        "Single piston engine",
        "Landing gear (King Air often has retractable tricycle landing gear including the forward gear, while Falcon 2000 has a more robust and streamlined landing gear system adjusted for jet performance)",
        "Two turboprop engines mounted on the wings",
        "Retractable landing gear",
        "Winglets at the tips of the wings"
    ],
    "L-1011": [
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "Number of engines: The L-1011 typically has three engines, whereas the A340 has four.",
        "Winglets or absence thereof (Boeing 757 often has winglets)",
        "L-1011 often has a more rounded nose compared to the DC-9's more pointed design",
        "Third engine in the tail cone (L-1011)",
        "Larger wing span in proportion to fuselage compared to A310",
        "Three engines (as opposed to four on the DC-8)",
        "More angular-wing planes at the wing root",
        "Longer landing gear struts",
        "**Winglets**: The A300 might have winglets on the tips of its wings depending on the variant, while the L-1011 does not feature winglets.",
        "Generally larger size compared to the A320",
        "T-tail design on the DC-9 (L-1011 has a conventional tail)",
        "Dual main landing gear bogies (each with 2 wheels) on each side",
        "Larger fuselage and wingspan of the L-1011",
        "Three engines (one on each wing and one at the base of the vertical stabilizer)"
    ],
    "MD-11": [
        "Length: The MD-11 is generally longer compared to the MD-80.",
        "Winglets on the tips of the wings (some MD-90 models may not have winglets)",
        "Nose shape: the MD-11 has a slightly more pointed nose compared to the A310.",
        "Extended fuselage: the MD-11 typically has a longer fuselage compared to the A310.",
        "Shorter fuselage compared to the A340",
        "Sharp, angled winglets (on some models)",
        "Longer fuselage compared to the A320",
        "Different winglets or wingtip design",
        "Distinctive engine nacelle shape",
        "Winglets: the MD-11 has winglets (small vertical stabilizers) at the tips of the wings, whereas the A310 does not.",
        "Trijet engine configuration (one engine on the tail and two under the wings)",
        "Tailplane with a smaller span",
        "T-tail configuration",
        "winglets at the end of the wings",
        "Winglets on the wingtips"
    ],
    "MD-80": [
        "Distinctive nose shape (MD-80 has a more pointed nose)",
        "T-tail configuration (prominent in MD-80)",
        "More modern and sleeker design overall",
        "Landing gear configuration (MD-80 has a more robust landing gear)",
        "T-tail configuration",
        "Shorter wingspan without winglets (MD-11 often has winglets)",
        "Older, more angular design elements",
        "Aircraft nose shape (MD-80 has a more rounded nose)",
        "More slightly swept-back wings",
        "Single overwing emergency exit (while many DC-8s have four overwing exits)",
        "T-tail design",
        "Longer fuselage compared to the Boeing 717",
        "Length of the fuselage (MD-80 is longer)",
        "Slightly different emergency exit configuration",
        "Length of the aircraft (MD-80 is longer)"
    ],
    "MD-90": [
        "Winglets (some MD-90s have winglets while MD-80s generally do not)",
        "T-tail configuration on the CRJ-700 (not present on the MD-90)",
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "Nose shape: The MD-90 usually has a more pointed nose compared to the A300.",
        "absence of the third engine at the tail (MD-90).",
        "generally smaller size and narrower body of the MD-90.",
        "Length of the aircraft: The MD-90 is typically longer and slimmer than the A300.",
        "Extended fuselage: The MD-90 is longer than the DC-9.",
        "Tail cone shape (MD-90 often has a different tail cone configuration)",
        "The absence of the third window exit on both sides of the fuselage right behind the wings, which the MD-90 lacks and the DC-9 usually has.",
        "Winglets (on some models)",
        "Tail-mounted engines: The MD-90 typically has engines mounted at the rear of the fuselage.",
        "Winglets: The MD-11 typically has winglets at the tips of its wings, while the MD-90 does not.",
        "Fuselage length: The MD-11 has a longer fuselage compared to the MD-90.",
        "Winglets: The MD-90 may have small winglets at the tips of its wings, which the DC-9 does not generally have."
    ],
    "Metroliner": [
        "Smaller, regional airline markings or livery",
        "commuter airline livery",
        "Propeller-driven engines ",
        "Twin turboprop engines (Metroliner)",
        "Propellers",
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "Turboprop engines on the wings",
        "Landing gear position (retractable gear in the wings for Metroliner)",
        "landing gear with fairings",
        "Fixed landing gear (in some models)",
        "Landing gear positioned under the wings",
        "Presence of propeller blades on engines",
        "twin turboprop engines",
        "Fixed (non-retractable) landing gear on some models",
        "High horizontal stabilizer (T-tail) "
    ],
    "PA-28": [
        "Fixed landing gear (usually)",
        "fixed landing gear (most models)",
        "Single-engine aircraft",
        "single-engine configuration",
        "fewer windows",
        "Fixed landing gear",
        "Small, single-engine design",
        "**Distinctive Paint Schemes and Logos:** Look for any distinctive paint schemes or logos that might be characteristic of Piper and Cirrus aircraft.",
        "Single-engine design",
        "**Canopy Design:** The PA-28 often has a more traditional, smaller cockpit side window design compared to the larger, single-piece bubble canopy of the SR-20.",
        "Wings: The PA-28 has low wings, while the An-12 has high wings.",
        "Number of engines (PA-28 typically has one propeller engine; A300 has two jet engines)",
        "Landing gear: The PA-28 usually has fixed tricycle landing gear with the nose wheel located under the nose, while the DR-400 also has fixed tricycle landing gear but with slight design differences.",
        "The tail section with a more traditional, less swept-back design",
        "Smaller, more compact body design in PA-28 vs. larger, spacious body in A310"
    ],
    "SR-20": [
        "Cirrus Aircraft logo",
        "Cirrus logo",
        "Generally used for personal or flight training purposes",
        "Cirrus Airframe Parachute System (CAPS) handle",
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Single-engine piston aircraft",
        "T-tail configuration (PA-28 has a conventional tail)",
        "Smaller, single-engine aircraft design",
        "Four-seater cockpit",
        "Single-engine (propeller) aircraft",
        "Fixed landing gear",
        "fixed landing gear",
        "Single propeller at the front",
        "Composite materials (SR-20 often uses composite materials, while PA-28 usually has a metal airframe)",
        "Single propeller at the nose"
    ],
    "Saab 2000": [
        "Presence of winglets at the tips of the wings (Saab 2000)",
        "Number of propellers (Saab 2000 typically has 4 or 5 blades on its propellers.)",
        "Logo and branding (Airlines operating these aircraft may have distinct liveries.)",
        "T-tail design but different in shape compared to Saab 2000",
        "Fewer windows along the side (around 50 seats vs. around 70 seats in ATR-72)",
        "smaller overall size compared to the BAE 146, which has four jet engines",
        "Propeller engines (Saab 2000) vs. jet engines (Embraer ERJ 145)",
        "Winglets on the wingtips",
        "Typically equipped with 5-bladed propellers (ATR-72 usually has 6-bladed propellers)",
        "General aircraft livery and airline branding (if visible)",
        "Swept wings",
        "Landing gear (Differences in landing gear placement and visibility can also help in distinguishing them.)",
        "Propeller engines (The Saab 2000 has turboprop engines, whereas the Fokker 100 has jet engines.)",
        "slightly pointed nose",
        "Turboprop engines (two propellers)"
    ],
    "Saab 340": [
        "Two Pratt & Whitney Canada PW100 series engines with longer nacelles",
        "Saab logo or specific airline livery indicative of Saab 340 operators",
        "**Fuselage Length**: The Saab 2000 has a longer fuselage compared to the Saab 340.",
        "**Landing Gear**: Differences in the landing gear configuration can also be observed, with the Saab 2000 typically having a more robust design owing to its higher performance characteristics.",
        "T-tail design",
        "Lower landing gear structure",
        "T-tail configuration",
        "Distinctive T-tail",
        "High wing design",
        "High wing configuration",
        "T-tail with horizontal stabilizers mounted at the top of the vertical tail fin",
        "**Landing Gear**: The landing gear of the Saab 340 is typically more prominent and may be more visible in photos compared to the sleeker design of the landing gear of the Embraer ERJ 145.",
        "**Fuselage Length**: The Saab 340 has a shorter, stubbier fuselage compared to the longer, more slender fuselage of the Embraer ERJ 145.",
        "**Propellers**: The Saab 340 has two turboprop engines with large, visible propellers, while the Embraer ERJ 145 has jet engines without propellers.",
        "high-wing design"
    ],
    "Spitfire": [
        "piston engine exhaust stacks",
        "Classic tailplane (Spitfire) vs. swept-back tailplane (Hawk T1)",
        "tailwheel landing gear",
        "Tailwheel landing gear",
        "Lack of turboprop engines",
        "Single-engine piston aircraft",
        "Canopy with a more classic, rounded design",
        "WWII-era military markings and camouflage",
        "Lack of modern avionics and weapons systems",
        "Tailwheel undercarriage",
        "propeller engine",
        "RAF (Royal Air Force) roundels and markings",
        "Exhaust stacks on the sides of the nose",
        "Narrow landing gear (retractable)",
        "Propeller blades (typically three-bladed for early models)"
    ],
    "Tornado": [
        "Camouflage or gray paint scheme (typical of military aircraft)",
        "smaller, more compact airframe",
        "absence of solid structure and wings typical of aircraft",
        "single or tandem cockpit configuration",
        "Canopy for pilot and co-pilot",
        "twin-engine configuration",
        "Twin-engine configuration",
        "absence of wings or fuselage",
        "Camouflage paint scheme",
        "Military jet profile",
        "swept wings with variable geometry (adjustable sweep angle)",
        "Compact and aerodynamic airframe",
        "twin-engine design with afterburners",
        "Swept wings",
        "military jet design"
    ],
    "Tu-134": [
        "Landing gear located in pods on rear fuselage (Tu-134)",
        "Windows arrangement: The Tu-134 might have a different alignment and number of passenger windows compared to the Boeing 727.",
        "Length and fuselage: The Tu-134 is generally shorter in length compared to the Boeing 727.",
        "Wing placement: Both have low-mounted wings, but the details in wing design differ.",
        "Landing Gear: The landing gear of the Tu-134 typically retracts into pods on the wings, while the Tu-154’s gear retracts into the fuselage.",
        "Fuselage Length: The Tu-134 has a shorter fuselage in comparison to the longer Tu-154.",
        "narrower fuselage (Tu-134)",
        "Distinctive nose shape with radar dome (in Tu-134)",
        "Landing gear design: The design and placement of the landing gear can also be a distinguishing feature.",
        "T-tail design with higher position (Yak-42)",
        "3-wheeled main landing gear (Tu-134)",
        "Distinctive glass navigator's nose",
        "Lower passenger capacity",
        "Fewer windows along the fuselage",
        "Typically, single-aisle passenger jet"
    ],
    "Tu-154": [
        "Landing gear configuration (Tu-154 has a different setup compared to the Boeing 707)",
        "A sleeker, more modern appearance with less sweep on the wings",
        "Number and spacing of cabin windows: The Tu-154 often has less spacing between windows compared to the Boeing 727.",
        "Swept-back wings with pronounced anhedral (downward angle)",
        "Wing sweepback angle is more pronounced",
        "Narrow-body: The Tu-154 is a narrow-body jet, whereas the A340 is a wide-body jet.",
        "Longer fuselage in comparison to the DC-9",
        "National or airline markings typical of Russian or Eastern Bloc aviation during its era",
        "Main landing gear in the wings and tail region",
        "Wing-mounted landing lights",
        "Cockpit window shape: The cockpit windows on the Tu-154 might have different shapes and arrangements compared to the 727.",
        "Shorter, more rounded nose compared to the DC-8",
        "Swept-back wings with a slight kink near the root",
        "A narrower fuselage relative to the Tu-154",
        "Landing gear: Tu-154 has 12 main tires in a six-wheel main landing gear truck on each side vs. the DC-9's main landing gear setup"
    ],
    "Yak-42": [
        "No propellers (Saab 2000 is a turboprop aircraft, while Yak-42 is a jet)",
        "Landing gear (Yak-42's landing gear configuration differs from that of Saab 340's)",
        "Number of engines (Yak-42 has three jet engines, Saab 340 has two propeller engines)",
        "lack of visible propellers (ATR-72 has two propellers)",
        "Engine type (Yak-42 has jet engines, Saab 340 has turboprop engines)",
        "Tail design (Yak-42 has a T-tail, Saab 340 has a conventional tail)",
        "Wing placement (Yak-42 has low-wing configuration, Saab 340 has high-wing configuration)",
        "Wing-mounted air brakes (Yak-42 has these, while the Tu-134 does not)",
        "Designated winglets or different wing shapes",
        "Smaller overall size and wingspan compared to the Boeing 717",
        "single-aft entry door vs. multiple side entry doors on the ATR-72",
        "Yak-42 generally has fewer windows along the fuselage than the Tu-154",
        "No external propellers: The Yak-42 is a jet and lacks the large, visible propellers seen on the An-12.",
        "More bulbous nose shape (Yak-42 nose is less pointed than Tu-134's)",
        "Fuselage shape (Yak-42’s fuselage is typically more rounded, Saab 340’s fuselage has a more cylindrical shape)"
    ]
}