{
    "A300": [
        "Airbus logo or livery markings",
        "Lack of wingtip fences or sharklets (classic A300s)",
        "Airbus logo or markings on the aircraft",
        "Winglets (depending on the model/version of A300)",
        "Airbus logo or markings",
        "A300 typically does not feature a T-tail (MD-90 has a T-tail configuration)",
        "Airbus A300 logo or markings if visible",
        "different engine types (A300 typically has older engine models)",
        "Tail design (differences in vertical stabilizer and rudder)",
        "Winglets at the wingtips (depending on the version)",
        "Signature Airbus \"bulbous\" nose shape",
        "Slight dihedral wings (wings angled slightly upwards) ",
        "Winglets (on some models, though not as pronounced as modern aircraft)",
        "A broader and shorter fuselage relative to the A320",
        "different tail design"
    ],
    "A310": [
        "Winglets on the wings if present (later models may have them).",
        "winglets on the wingtips (present on some A310 models)",
        "Winglets at the end of the wings (on some models)",
        "Winglets on the A310, which are usually absent on the DC-10",
        "Single full passenger deck (no partial upper deck as in some larger aircraft)",
        "T-tails (tailplane)",
        "distinctive tailcone shape (more pointed on A310)",
        "A wider and shorter fuselage compared to the DC-8.",
        "Two engines mounted under the wings, rather than four engines.",
        "shorter fuselage",
        "Shorter fuselage",
        "Absence of the distinctive tail engine found on the DC-10",
        "Shorter fuselage (A310) compared to the longer fuselage (DC-10)",
        "less prominent winglets",
        "distinctively curved winglets (if equipped)"
    ],
    "A320": [
        "Airbus logo or specific airline livery known to operate A320s",
        "Winglets with a vertical upturn instead of raked wingtips (common in some 767 models)",
        "Distinctive Airbus nose shape (more rounded compared to the 767's more pointed nose)",
        "Sharklet winglets  ",
        "T-tail design",
        "sharklets (tip extensions) on wings (A320 typically has these)",
        "Wingtips or Sharklets on the end of the wings",
        "registration number (Airbus A320 models usually start with an \"F\" in the registration markings for commercial aircraft from Europe, while U.S. aircraft start with an \"N\")",
        "Sharklet wingtip devices (winglets)",
        "Winglets on the ends of the wings",
        "landing gear design (A320 has a simpler main landing gear structure)",
        "The absence of an extra set of landing gear near the wing roots  ",
        "Rounded nose  ",
        "Absence of rear fuselage-mounted engines",
        "A more noticeable curve in the upturn of the leading edge of the tail fin"
    ],
    "A330": [
        "Winglets: The A330 often features larger, more prominent winglets compared to the A310.",
        "**Wingtips:** A330 typically has wingtip devices known as winglets or sharklets, while early models of the Boeing 737 have no winglets and later models may have split scimitar winglets.",
        "Number of engines: A330 has two engines, while A380 has four.",
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "**Livery and Logos:** Identifiable airline branding might provide clues specific to the types of aircraft they predominantly use.",
        "Engine size: The A330 typically has larger engines compared to the A310.",
        "Wing span: The A330 has longer wings compared to the A310.",
        "Typically a slightly shorter and higher tail compared to the Boeing 767",
        "Two engines (The A330 has two engines, while the DC-8 typically has four)",
        "Tail height: The vertical tail fin of the A330 is often taller than that of the A310.",
        "Different wingtip design (depending on the variant)",
        "Airbus branding or insignia on the fuselage",
        "Winglets with a distinctive upward curve (sharklets)",
        "Six-wheel main landing gear bogies (as opposed to the four-wheel bogies on the A300)",
        "Newer design with longer range and more passenger capacity"
    ],
    "A340": [
        "Four engines: The A340 has four engines, while the A310 has two.",
        "Winglets: The A340 often features winglets, which are absent in the A310.",
        "Different tail configurations (the A340 often has a slightly higher vertical stabilizer)",
        "Four engines (A340 has four engines, whereas Boeing 757 has two)",
        "Unique landing gear arrangement (A340 has a center main gear on some models)",
        "More modern and sleek fuselage design",
        "The A340 has a longer fuselage with a different window arrangement compared to the 777",
        "Winglets shape (A340 winglets are different compared to A320)",
        "Tapered nose and narrow fuselage",
        "Aircraft tail height (A340 generally taller)",
        "Airbus logo on the tail or fuselage (if visible)",
        "Tail design: Subtle differences in tail design can also help distinguish between the models.",
        "Winglets (A340 often has winglets that are upward-angled)",
        "Four engines (A340 has four engines, while the Boeing 777 has two)",
        "Four engines (two on each wing) "
    ],
    "A380": [
        "Distinctive hump due to the upper deck extending towards the tail.",
        "Distinctively larger and more rounded nose",
        "Wingtip fences or winglets that are larger and more vertical",
        "larger, more rounded nose",
        "A distinctive hump at the front of the plane where the upper deck ends",
        "The Airbus logo near the front section",
        "Emirates and other specific airlines' logos often associated with A380",
        "absence of a hump on the upper deck (Boeing 747 has a distinctive hump)",
        "Distinctive hump on the upper deck",
        "Distinctive hump on the upper deck (A380)",
        "slightly different tail design",
        "The A380 often has a more bulbous nose compared to the sleeker nose of the Boeing 757",
        "Winglets at the tips of the wings",
        "Larger size and wingspan (A380)",
        "Often a more prominent nose design"
    ],
    "ATR-42": [
        "Four-bladed propellers (ATR-42 usually has four-bladed, Fokker 50 has six-bladed)",
        "Shape of the nose: The ATR-42 generally has a more rounded nose.",
        "Propeller engines (ATR-42 has turboprop engines, while BAE-125 has jet engines)",
        "Different engine nacelle shapes (ATR-42 has more teardrop-shaped nacelles)",
        "No T-tail, as the horizontal stabilizer is at the base of the vertical stabilizer",
        "Nose shape: The ATR-42 has a more rounded nose, whereas the DHC-6 has a more angular shape.",
        "Specific airline liveries and logos that may correspond to either aircraft model",
        "Single overwing emergency exit on each side",
        "Size: The ATR-42 is larger in size and length compared to the DHC-6.",
        "Shorter landing gear",
        "Twin turboprop engines",
        "Twin-engine configuration (the An-12 has four engines)",
        "More modern, sleeker appearance",
        "More squared-off and robust fuselage",
        "Single vertical stabilizer"
    ],
    "ATR-72": [
        "A noticeably T-shaped tail with a horizontal stabilizer set atop the vertical stabilizer.",
        "Four jet engines mounted on pylons under the wings.",
        "Airline livery or logos (if present)",
        "High-wing configuration as well but with jet engines.",
        "Sharper, more angular tail: The ATR-72 features a prominent, angular vertical stabilizer.",
        "Four-blade propellers (as opposed to six-blade for Fokker 50)",
        "A more compact, rounded fuselage.",
        "Number of engines (both have two, but different types)",
        "Swept-back vertical stabilizer",
        "High-wing configuration: The ATR-72 has wings mounted high on the fuselage.",
        "Absence of jet engines mounted at the rear of the fuselage",
        "Longer fuselage for passenger cabin (indicative of a regional airliner)",
        "Four-blade propellers",
        "Engine nacelle shape",
        "T-tail"
    ],
    "An-12": [
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "Propellers: The An-12 has four turboprop engines with visible propellers, while the A300 has two jet engines.",
        "Four turboprop engines",
        "Four turboprop engines mounted on the wings, versus the two turbofan engines of an A320",
        "Landing gear (An-12 has retractable landing gear, PA-28 usually has fixed gear)",
        "Four turboprop engines versus one piston engine",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "Ramp/cargo door on An-12",
        "Number of propeller blades (An-12 typically has four-blade propellers)",
        "Shorter fuselage than MD-11",
        "Four engines compared to one (An-12 typically has four turboprop engines, while DHC-1 has one piston engine)",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "Fuselage: The An-12 has a bulkier, more rugged-looking fuselage, while the A300 has a more streamlined, modern design.",
        "Larger fuselage and cargo capacity in An-12"
    ],
    "BAE 146": [
        "fewer propellers (since Saab 340 is a turboprop aircraft)",
        "Steeper landing gear",
        "Longer main landing gear legs and slightly shorter aircraft length compared to a DC-9",
        "Landing gear configuration (BAE 146 has landing gear that retracts into pods on the fuselage; Dash 8 has landing gear that retracts into the engine nacelles)",
        "Steep landing and takeoff capabilities",
        "Landing gear: multiple wheels on main gear (BAE 146) vs simpler landing gear (BAE-125)",
        "T-tail (BAE 146 features a T-tail, while Dash 8 has a conventional tail)",
        "four engines (two on each wing)",
        "T-tail configuration",
        "High wing position relative to the fuselage",
        "Low-wing configuration",
        "Four jet engines mounted under the wings",
        "Stubbier, more rounded nose",
        "High-wing configuration",
        "Distinctive airbrake on the tail (sometimes deployed)"
    ],
    "BAE-125": [
        "small, twin-engine business jet",
        "Fewer windows, typically associated with business jets",
        "Jet engines instead of turboprops",
        "winglets at the tips",
        "Brand logos and registration markings: Look for specific airline logos, registration numbers, or other identifiers that might be visible on the aircraft.",
        "Straight wings with winglets or no winglets at all",
        "**Branding and Markings**: The BAE-125 often has corporate or private livery, whereas the DC-8 typically features commercial airline branding.",
        "**Number of Engines**: The BAE-125 usually has two engines, whereas the DC-8 has four.",
        "Engine placement: The BAE-125 has engines mounted on the rear fuselage, while the ERJ 145 also has rear-fuselage-mounted engines but can be identified by their specific placement and size.",
        "Propeller engines",
        "Swept-back wings with winglets",
        "Distinctive larger and more prominent winglets (on some models)",
        "lacks propellers (as ATR-72 is a turboprop)",
        "swept wings",
        "Smaller overall size compared to the DC-9"
    ],
    "Beechcraft 1900": [
        "Beechcraft logo or specific airline markings (if visible)",
        "Smaller size with a length of approximately 57 feet",
        "Single crew door on the left side of the fuselage",
        "Smaller size with a capacity of around 19 passengers",
        "Fixed landing gear visible when the aircraft is in the air",
        "Twin turboprop engines (as opposed to jet engines on the Legacy 600)",
        "T-tail configuration",
        "T-tail structure",
        "Straight wings rather than swept wings",
        "Landing gear configuration",
        "Typically used for regional and short-haul flights",
        "Twin-engine configuration",
        "Twin jet engines mounted under the wings",
        "Straight winglets on Beechcraft 1900 vs. raked or no winglets on Embraer ERJ 145",
        "A high T-tail design"
    ],
    "Boeing 707": [
        "Wings: The Boeing 707's wings are higher and more swept than the 727's.",
        "Fuselage length: The Boeing 707 typically has a longer fuselage than the Boeing 727.",
        "Swept-back tail fin",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)",
        "Larger fuselage",
        "Older liveries often found on 707 models compared to newer liveries on 717 models",
        "Smaller fuselage diameter in Boeing 707",
        "T-tail design present in DC-10 versus conventional tail design in Boeing 707",
        "Engine placement: Boeing 707 has four engines under the wings, whereas Boeing 727 has three engines, with two under the wings and one integrated into the rear fuselage.",
        "T-tail design (707’s tail design is slightly different)",
        "Larger and more pronounced tail fin",
        "Fuselage length: Depending on the variant, the overall fuselage length can differ; Boeing 707 has several variants with different lengths that may look distinct from any DC-8 model.",
        "Four engines under the wings",
        "T-tail tailplane",
        "Engine pylon design: The engine pylons on the Boeing 707 may differ in shape and attachment from those on the DC-8."
    ],
    "Boeing 717": [
        "Distinctive Boeing 717 branding and livery (depending on airline)",
        "Modern livery: Boeing 717 typically has more modern airline liveries compared to the older liveries commonly found on DC-9 aircraft.",
        "Winglets (if present, though some 717s may not have winglets)",
        "Smaller winglets or none, compared to MD-80 variations",
        "Newer design and more modern appearance",
        "Winglets (optional but more common in retrofitted 717s)",
        "Length: The Boeing 717 is longer compared to many variants of the DC-9.",
        "Winglets at the wingtips (optional on Boeing 717 but not available on Fokker 100)",
        "Nose shape (more pointed on the Boeing 717)",
        "Lack of winglets",
        "Absence of a third engine in the tail section",
        "Shorter fuselage",
        "T-tail configuration",
        "Smaller fuselage",
        "Slightly shorter fuselage length"
    ],
    "Boeing 727": [
        "Smaller and shorter landing gear compared to the 737",
        "Shorter fuselage compared to the 757",
        "Winglets (in some models, but not all)",
        "Smaller winglets or sometimes none at all",
        "Narrow body",
        "Slightly swept wings with fewer pylons for engines",
        "Boeing 727 often has a more pointed nose",
        "Longer, more slender fuselage",
        "Additional wing-mounted landing gear (in some variants)",
        "A slightly longer fuselage",
        "Typically older and having a more retro design style",
        "Conventional low tail",
        "Wide body",
        "Longer fuselage compared to Boeing 717",
        "Slimmer fuselage"
    ],
    "Boeing 737": [
        "Specific registration and airline liveries, often related to the aircraft model",
        "Winglets: Check the winglets if present. The Boeing 737 may have blended winglets or split scimitar winglets, while the Boeing 757 often has winglets with a steeper angle.",
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)",
        "Winglets on the wingtips (depending on the model and generation)",
        "pointed nose design",
        "Length of the fuselage (737 tends to be longer than 717)",
        "Distinctive pointed nose shape",
        "Winglets on the wingtips (specific models)",
        "Distinctive pointed tailcone",
        "Tail fin design",
        "Distinctive wing-mounted engines (closer to the wings)",
        "Winglets on the wingtips in many models",
        "Number of engines (Boeing 737: two engines; Boeing 727: three engines)",
        "Winglets at the wingtips (737s often have winglets, 717s typically do not)",
        "Aircraft nose shape (Boeing 737 generally has a more rounded nose)"
    ],
    "Boeing 747": [
        "Swept-back wings with a larger span",
        "Shorter and less pronounced landing gear (767)",
        "Shorter and more robust fuselage compared to the more elongated fuselage of the 757",
        "pronounced wing sweep",
        "Single-deck fuselage without a hump (767)",
        "Winglets at the ends of the wings (depending on specific 747 model)",
        "hump on the upper deck",
        "Hump on the upper deck",
        "Hump on the upper deck (747)",
        "Distinctive hump-like upper deck that extends only partway along the fuselage",
        "More pointed nose shape",
        "Longer fuselage compared to the height of the tail (747)",
        "Distinctive hump on the upper deck near the front",
        "larger fuselage",
        "distinctive hump on the upper deck"
    ],
    "Boeing 757": [
        "winglets at the wingtips (on most 757 models)",
        "T-tail absent",
        "Wing span: The 757 has a narrower wingspan compared to the 767.",
        "Tail design (Boeing 757 vertical stabilizer is more angular)",
        "Shorter landing gear and tail height",
        "**Wingspan**: The Boeing 777 has a larger wingspan than the 757.",
        "No winglets",
        "Tail (vertical stabilizer) typically higher and more swept-back",
        "Shorter landing gear",
        "Typically fewer and smaller doors on the fuselage compared to A330",
        "Length of fuselage (Boeing 757 is longer)",
        "Longer, slimmer appearance",
        "larger wingspan",
        "Landing gear: The Boeing 757 has a noticeable difference in the landing gear configuration compared to the Boeing 767.",
        "Nose shape (Boeing 757 has a more pointed nose)"
    ],
    "Boeing 767": [
        "Length: The Boeing 767 is usually longer than the A320.",
        "Winglets on the tips of the wings (in some models)",
        "Winglets that are typically larger on the 757 (if both are equipped with winglets)",
        "Tail Height: Boeing 767 has a shorter tail height compared to the Boeing 777.",
        "The shape of the nose (the 767 has a more pointed nose compared to the 747)",
        "Winglets at the tips of the wings (in newer models)",
        "Taller landing gear (767 has a higher stance)",
        "winglets",
        "A wider fuselage (767 is a wide-body aircraft)",
        "Lack of a noticeable hump on the upper fuselage",
        "More prominent wingspan",
        "Larger, slightly taller vertical stabilizer (tail fin)",
        "Wingspan: Boeing 767 has a shorter wingspan compared to the Boeing 777.",
        "tail fin shape",
        "Presence of a larger wingspan"
    ],
    "Boeing 777": [
        "**Wingspan**: The Boeing 777 has a larger wingspan.",
        "**Fuselage Shape**: The Boeing 777 has a wider fuselage.",
        "Engine count: Boeing 777 has two engines, while the Airbus A340 has four engines.",
        "Fuselage: Boeing 777 has a longer, wider fuselage.",
        "Engine: Boeing 777 has larger, twin engines under the wings.",
        "Fuselage shape: The Boeing 777 has a wider, more rounded fuselage in contrast to the narrower fuselage of the Boeing 737.",
        "Winglets: Boeing 777 typically does not have winglets, while the A340 often features winglets.",
        "Raked wingtips (A330 has winglets)",
        "Modern, more streamlined design (Boeing 777)",
        "Wingtip design: Many Boeing 777 models feature raked wingtips, whereas the Boeing 737 often has winglets.",
        "Wingspan: Boeing 777 has a wider wingspan compared to Boeing 717.",
        "Wider fuselage for greater passenger capacity (Boeing 777)",
        "Generally longer overall length",
        "Advanced, high-bypass turbofan engines (Boeing 777)",
        "larger, more rounded nose"
    ],
    "C-130": [
        "Two piston engines",
        "Four turboprop engines",
        "Shorter, stockier landing gear suited for rough airstrips",
        "Short, robust landing gear",
        "Shorter landing gear",
        "Tailwheel landing gear configuration",
        "Wider and more robust landing gear",
        "Sleek, modern appearance suitable for commercial aviation",
        "Longer wingspan compared to the DHC-6",
        "T-tail structure",
        "T-tail configuration",
        "Short, sturdy landing gear",
        "Loading ramp at the rear",
        "Squared-off fuselage rear for loading and unloading cargo",
        "Squat and utilitarian appearance"
    ],
    "C-47": [
        "Two engines: The C-47 has two engines, whereas the DC-6 has four.",
        "Shorter fuselage: The C-47 has a shorter fuselage than the DC-6.",
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "Tailwheel landing gear",
        "Landing gear: The C-47 features a tailwheel landing gear configuration, while the DC-6 typically has a tricycle landing gear system.",
        "Absence of modern jet engines",
        "larger wingspan relative to fuselage",
        "Propellers (C-47 has propellers, A310 has jet engines)",
        "Landing gear with tailwheel configuration",
        "Tailwheel landing gear configuration",
        "Tail wheel landing gear",
        "Trijet configuration (three engines)",
        "Straight, non-swept wings",
        "retractable landing gear",
        "Radial piston engines"
    ],
    "CRJ-200": [
        "T-tail configuration but with more pronounced tail structure",
        "A single propeller engine mounted at the front",
        "Absence of winglets (on most CRJ-200 models)",
        "Distinctive sharp, pointed nose",
        "Size and Length: The CRJ-200 is smaller and shorter than the MD-90.",
        "T-tail configuration ",
        "T-tail configuration",
        "Rounder, less pointed nose",
        "different tail height",
        "Absence of winglets",
        "Winglets on the tips of the wings",
        "No winglets on many models",
        "single overwing emergency exit on each side",
        "Engines also at the rear but slightly different mounting",
        "Wings: The wings of the CRJ-200 are mounted lower on the body compared to the MD-90."
    ],
    "CRJ-700": [
        "Larger, more pronounced winglets",
        "T-tail design as well, but a more robust fuselage",
        "T-tail structure with slight differences in size and angle",
        "T-tail configuration",
        "Winglets at the tips of the wings (though some CRJ-200 models can also have them, they are more common on the CRJ-700)",
        "Winglets on the tips of the wings",
        "Tail Design: The CRJ-700 typically features a T-tail design, while the MD-80 often has a low tailplane or horizontal stabilizer.",
        "Distinctive T-tail",
        "Classic, older aircraft design features",
        "Different landing gear configuration (the CRJ-700 has taller landing gear)",
        "Distinctive winglets at the tips of the wings",
        "More complex landing gear structure",
        "Generally absence of winglets",
        "T-tail design",
        "Shorter and more pointed nose"
    ],
    "Cessna 172": [
        "Fixed landing gear (compared to the often retractable gear on the DHC-1)",
        "Fixed landing gear",
        "fixed landing gear",
        "Traditional ‘tail-dragger’ or tricycle gear setup",
        "Generally found in a lighter, simpler paint scheme",
        "Tricycle landing gear (nose wheel included)",
        "Smaller size and more compact",
        "Fixed, non-retractable landing gear",
        "Single exhaust",
        "Smaller size and simpler design",
        "single engine with a propeller in the front",
        "Tailwheel or tricycle landing gear configuration",
        "Tricycle landing gear with a single nose wheel",
        "twin engines with propellers",
        "Single-engine with a propeller at the nose"
    ],
    "Cessna 208": [
        "Engine nacelles: The DHC-6's engine nacelles on the wings may help identify it, whereas the Cessna 208 lacks these due to its single-engine configuration.",
        "Single-engine propeller (Cessna 208) vs. twin-engine turboprop (Dash 8)",
        "Turboprop engine rather than jet engines",
        "Fixed landing gear (Cessna 208) vs. retractable landing gear (Dash 8)",
        "Fixed landing gear",
        "fixed landing gear",
        "High-wing design (Cessna 208) vs. low-wing design (Dash 8)",
        "Single turboprop engine",
        "Fixed landing gear (non-retractable)",
        "Twin-engine turboprop",
        "lack of jet engines",
        "Single-engine turboprop",
        "Tail design (Cessna 208 has a single vertical stabilizer and a simpler tail)",
        "Tail design: The Cessna 208 usually features a single vertical stabilizer, while the DHC-6 has a larger vertical stabilizer and may have a more complex tail design.",
        "Visible cargo pod under the fuselage (often on a Cessna 208, may vary)"
    ],
    "Cessna Citation": [
        "**Size:** Cessna Citations are generally smaller.",
        "**Tail design:** Cessna Citations usually have a T-tail design.",
        "**Number of engines:** Cessna Citations typically have two engines.",
        "swept-back wings",
        "**Distinctive Features:** Check for any model-specific features or markings.",
        "Winglets on the wingtips (on some models)",
        "landing gear configuration",
        "Swept wings",
        "swept wings",
        "winglets on some models",
        "differences in landing gearplacement",
        "smaller size",
        "Smaller size",
        "Distinctive winglets (depending on specific Cessna Citation model)",
        "**Nose Shape:** Cessna Citations often have a more pointed nose. "
    ],
    "Challenger 600": [
        "Winglets that are less pronounced or sometimes absent",
        "Swept-back wings",
        "Winglets may or may not be present (as opposed to the CRJ-700 which consistently has winglets)",
        "Generally smaller overall size compared to the CRJ-700",
        "Distinctive, shorter landing gear",
        "T-tail configuration on Challenger 600",
        "More spacious, shorter landing gear",
        "Twin jet engines (mounted on the rear fuselage) ",
        "T-tail configuration",
        "Rear-mounted engines",
        "Standard tail fin rather than a T-tail",
        "Challenger 600 typically has a sleeker, more streamlined appearance",
        "Larger, tail-mounted engines",
        "Distinctive T-tail configuration",
        "Distinctive rounded nose"
    ],
    "DC-10": [
        "landing gear (DC-10 has retractable tricycle landing gear, DC-3 has fixed landing gear)",
        "Tail design: The DC-10 has a T-tail design, while the DC-8 has a more traditional tailplane.",
        "Less pronounced curve or angle in the nose section compared to the MD-11",
        "More rounded nose compared to the more pointed nose of the DC-9",
        "Larger wingspan and overall size.",
        "Three engines: one under each wing and one at the base of the vertical stabilizer.",
        "Wider fuselage.",
        "T-tail configuration.",
        "number of engines (DC-10 has three, while DC-3 has two)",
        "Three engines (one on each wing and one at the base of the vertical stabilizer)",
        "Wing-mounted engines: Both aircraft have two wing-mounted engines, but the overall design of the tail and center engine can still help in identification.",
        "Three engines: one on each wing and a third in the tail (distinctive for the DC-10)",
        "Three engines (one in each wing and one at the base of the vertical stabilizer)",
        "Lack of winglets on the wingtips",
        "Number of wheels on landing gear: The DC-10 has four wheels on its main landing gear bogies (trucks), while the L-1011 has four-wheel bogies as well, but the arrangement can help in identifying if you focus on the tail structure."
    ],
    "DC-3": [
        "Single vertical stabilizer with rudder",
        "Tailwheel (as opposed to nosewheel)",
        "Tailwheel landing gear (DC-3) instead of tricycle landing gear (DHC-6)",
        "tailwheel landing gear (taildragger)",
        "Tailwheel landing gear",
        "Number of engines (DC-3 has 2 engines, DC-9 typically has 2 engines located at the rear)",
        "distinctive, spatted main landing gear",
        "Tail configuration (DC-3 has a conventional tailplane, DC-9 has a T-tail)",
        "Distinctive un-swept, straight wings",
        "Tandem main gear and single tail wheel configuration",
        "Landing gear: The DC-3 has a tail-dragger landing gear configuration with the main gear under the wings and a small tail wheel, whereas the Boeing 707 has tricycle landing gear with nose gear and main gear.",
        "absence of a cargo door",
        "Wing shape and placement (DC-3 has low wings, DC-9 has mid-wings)",
        "twin-engine configuration",
        "Twin-engine configuration"
    ],
    "DC-6": [
        "Four propeller engines (DC-6) compared to jet engines (DC-10)",
        "Propeller engines (DC-6) instead of jet engines (DC-9)",
        "Four engines: The DC-6 has four engines, while the DC-3 has two.",
        "Propeller engines (DC-6 has four propeller engines while the Boeing 757 has jet engines)",
        "Four propeller engines",
        "Tailwheel landing gear (in some variants)",
        "Propeller engines ",
        "Propeller engines",
        "Swept wings",
        "Four engines (DC-6) as opposed to two (DC-9)",
        "Propeller Blades: DC-6 has more propeller blades (commonly three or four-bladed) compared to the C-47 which typically has two-bladed or three-bladed propellers.",
        "Lower ground clearance",
        "Tail Design: DC-6 has a tricycle landing gear (nose gear), and a vertical stabilizer without a dorsal fillet, while the C-47 has a tailwheel landing gear and a more prominent dorsal fillet on the vertical stabilizer.",
        "Four-engine configuration",
        "Tail-dragger type landing gear"
    ],
    "DC-8": [
        "Number of engines: The DC-8 typically has four engines, while the DC-10 has three engines.",
        "Turbojet engines (DC-8)",
        "Four engines mounted under the wings (compared to the A320's two engines)",
        "Four more narrow engines (DC-8 vs. DC-6, which has more rounded piston engines)",
        "Lack of T-tail (DC-8 has a conventional tail, whereas DC-9 has a T-tail)",
        "Lack of modern winglets found on many newer planes, such as those on the A320",
        "Older, more tapered wing design",
        "Four engines mounted under the wings (both have this, but different configurations)",
        "The presence of a more prominent wing dihedral angle (DC-8)",
        "Presence of wing-mounted fuel tanks (in some DC-8 models)",
        "Longer and thinner profile compared to the more compact, modern look of the A320",
        "Swept-back wings (DC-8)",
        "Fuselage length: Typically, the DC-8 has a longer, more slender fuselage compared to the DC-10.",
        "Typically more rounded nose",
        "Wing design: The DC-8 tends to have shorter wings relative to its body length, whereas the DC-10 has longer wings with winglets (in some models) to support its heavy load."
    ],
    "DC-9": [
        "Limited number of emergency exits (typically 3 on each side)",
        "Jet engines (as opposed to propellers)",
        "T-tail design: The DC-9 has a distinctive T-tail, while the DC-6 has a conventional tail.",
        "Number of engines: The DC-9 has two engines, while the DC-6 has four engines.",
        "Sleeker, more modern fuselage",
        "Lower tail height in comparison to the MD-80",
        "Absence of aerodynamic improvements like winglets",
        "Distinctive engine nacelles closer to the tail",
        "T-tail configuration",
        "Absence of an engine on the vertical stabilizer (tail)",
        "No winglets at the wingtips (whereas many Boeing 767 models have winglets)",
        "Fewer sets of landing gear (typically two main landing gears compared to the 727's three)",
        "Generally simpler, more compact appearance",
        "Smaller diameter of engine nacelles",
        "Shorter fuselage compared to the Boeing 727"
    ],
    "DH-82": [
        "Fixed tailwheel landing gear",
        "Tailwheel landing gear configuration",
        "radial engine (often visible)",
        "Fixed landing gear with a tailwheel",
        "fixed landing gear with tailwheel",
        "Fixed landing gear with tailwheel",
        "Biplane configuration (two sets of wings)",
        "Biplane design (two sets of wings)",
        "Fixed, non-retractable landing gear with a tailwheel",
        "Historic look, often associated with vintage aircraft from the 1930s",
        "biplane design",
        "Biplane configuration (two wings stacked one above the other)",
        "biplane configuration (two wings stacked one above the other)",
        "biplane structure",
        "Smaller size and lighter weight"
    ],
    "DHC-1": [
        "Radial engine cowling (distinctive engine shape)",
        "Propeller at the front of the aircraft",
        "Relatively smaller and lighter frame",
        "Different placement and design of exhausts and air intakes",
        "Smaller size and light aircraft build",
        "Vintage, military trainer appearance",
        "Fixed landing gear",
        "Landing gear (Conventional gear on DHC-1, Tricycle gear on Hawk T1)",
        "Tailwheel undercarriage",
        "Tailwheel landing gear",
        "Propeller-driven engine",
        "Smaller overall size and lighter frame",
        "Conventional tailwheel (tail-dragger) landing gear",
        "Cockpit arrangement (Tandem seating in DHC-1, side-by-side in Hawk T1)",
        "More streamlined, military trainer appearance"
    ],
    "DHC-6": [
        "Sturdy, rugged appearance suitable for STOL (Short Takeoff and Landing) operations",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "T-tail (horizontal stabilizer mounted on the top of the vertical stabilizer) ",
        "Short takeoff and landing (STOL) design features",
        "Fixed, non-retractable landing gear (DHC-6)",
        "Fixed landing gear (non-retractable)",
        "Squared-off tail fin (DHC-6 has a distinct, squared-off vertical stabilizer)",
        "Twin-engine turboprop (DHC-6)",
        "fixed, non-retractable landing gear",
        "Longer fuselage designed for carrying more passengers or cargo",
        "Engine type (DHC-6 has turboprop engines, DC-8 has jet engines)",
        "Dual tail fins in the horizontal stabilizer configuration",
        "Twin-engine setup",
        "Twin-engine piston or turboprop engines",
        "Squared-off vertical stabilizer"
    ],
    "DR-400": [
        "**Bubble canopy**: The DR-400 usually has a clear bubble canopy that provides a panoramic view for the occupants.",
        "retractable gear (in some DR-400 models)",
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "Size: The DR-400 is much smaller compared to the A300.",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "Fixed tricycle landing gear",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "different door placement (PA-28 has doors on the side, DR-400 tends to be more centralized access)",
        "**Fixed landing gear**: The DR-400 typically has non-retractable landing gear.",
        "Tricycle landing gear with the nose wheel set further back",
        "Usage: The DR-400 is used for general aviation, while the A300 is designed for commercial airline service.",
        "Canopy opens sideways for pilot and passenger access",
        "Traditional cockpit with mostly analog instruments",
        "Retractable tricycle landing gear",
        "Positioned for general aviation or private flying"
    ],
    "Dash 8": [
        "Propellers (Dash 8 has turboprop engines, whereas the DC-8 has jet engines)",
        "Distinctive engine nacelles (engine housings on wings) ",
        "Landing gear (Dash 8 has larger, more robust landing gear suitable for rugged runways)",
        "Propeller engines (Dash 8 typically has two propeller engines, BAE-125 has jet engines)",
        "Protruding landing gear (due to high wings)",
        "Presence of nacelles for turboprop engines near the wings",
        "Four-bladed propellers (depending on the specific Dash 8 model)",
        "More boxy fuselage shape",
        "Swept, straight wings",
        "Slightly different nose shape (Dash 8 has a more angular nose)",
        "Landing gear housed within the engine nacelles",
        "Retractable landing gear",
        "Propeller engines (Dash 8 typically has turboprop engines while BAE 146 has jet engines)",
        "T-shaped tail",
        "Engine nacelles close to the aircraft body"
    ],
    "Dornier 328": [
        "twin turboprop engines (usually visible on the wings)",
        "Turboprop engines (as opposed to jet engines)",
        "Rounded, bulbous nose",
        "Smaller size (seats about 30-33 passengers)",
        "Engine placement (Dornier 328 has engines mounted on pylons beneath the wings)",
        "propeller engines",
        "sleeker and more streamlined fuselage",
        "often used for regional and short-haul flights",
        "Distinctive propeller shape (often 4-blade on Dornier 328, versus 6-blade on ATR-72)",
        "T-tail design on the Dornier 328 vs. conventional tail on the Beechcraft 1900",
        "More compact and shorter fuselage on the Dornier 328 compared to the BAE 146",
        "Two propeller blades on each engine",
        "T-tail configuration",
        "Four propeller blades on each engine",
        "T-tail: The Dornier 328 typically features a T-tail configuration, while the DHC-6 has a conventional tail design."
    ],
    "EMB-120": [
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Turboprop engines (propellers) instead of jet engines",
        "twin turboprop engines (visible propellers)",
        "turboprop engines",
        "Turboprop engines",
        "twin turboprop engines",
        "Size and Body Shape: The EMB-120 is a smaller, turboprop aircraft, while the MD-90 is a larger, twin-jet commercial airliner.",
        "Logo or airline markings (often seen on regional jets like EMB-120)",
        "Twin turboprop engines mounted on the wings",
        "Twin-engine turboprop with engines mounted on the wings",
        "Twin-turboprop engines mounted on the wings",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the MD-90 has two jet engines mounted at the rear of the fuselage.",
        "Larger passenger capacity (typically for regional flights)",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the DC-10 has three jet engines (two on the wings and one on the tail).",
        "Pressurized cabin"
    ],
    "Embraer E-Jet": [
        "Winglets: Embraer E-Jets typically have winglets, while Fokker 100s do not.",
        "Less pronounced swept wings",
        "absence of propellers (Beechcraft 1900 has twin turboprop engines)",
        "Tail Design: The E-Jets usually have a slightly more swept-back horizontal stabilizer and a different tail fin design in comparison to the Fokker 100.",
        "Main Landing Gear: The E-Jets have a shorter, more compact main landing gear compared to the longer and more visible landing gear of the Fokker 100.",
        "Fuselage Shape: The fuselage of the E-Jet is typically sleeker and more streamlined, while the Fokker 100 has a slightly bulkier, older design.",
        "Distinctive \"T-tail\" configuration in some E-Jet models (e.g., E170)",
        "Tapered nose design, not as rounded as the Boeing 737",
        "longer landing gear legs",
        "different winglet design",
        "Distinctive T-tail design (in some models)",
        "less pronounced nose shape",
        "T-tail configuration",
        "two or more emergency exits over the wings",
        "Longer, slender wings"
    ],
    "Embraer ERJ 145": [
        "Length: The ERJ 145 is considerably longer than the Beechcraft 1900.",
        "Length: The ERJ 145 tends to be slightly longer than the CRJ-200.",
        "Landing gear: Differences in the landing gear configuration can help differentiate between the two aircraft.",
        "Absence of winglets",
        "Shorter length (around 98 feet for the ERJ 145)",
        "Winglets: The ERJ 145 often lacks the winglets found on the Legacy 600",
        "Wing Design: The wings of the ERJ 145 have a slightly swept-back design, whereas the Beechcraft 1900 has straighter wings.",
        "Short and thin landing gear struts",
        "T-tail configuration",
        "Distinctive pointed nose shape",
        "landing gear configuration",
        "Jet Engines: The ERJ 145 has two rear-mounted jet engines, whereas the Beechcraft 1900 has two turboprop engines mounted on the wings.",
        "T-shaped tail",
        "Length of the aircraft: The Embraer ERJ 145 is generally longer than the Fokker 70.",
        "Smaller overall size compared to CRJ-700"
    ],
    "Embraer Legacy 600": [
        "Swept wings",
        "Landing gear configuration (Embraer has a different stance and wheel setup)",
        "Longer landing gear",
        "Winglets: The Legacy 600 usually has a more pronounced upward curve on its winglets compared to the relatively simpler winglets on the E-Jet series.",
        "More pronounced nose shape",
        "Size: The Legacy 600 is generally smaller and more streamlined compared to the E-Jet, which is a regional jet with a larger capacity.",
        "Luxurious, executive cabin windows arrangement",
        "Slightly elongated and sleek body shape",
        "General aircraft size and proportion, Legacy 600 is typically shorter",
        "Winglets on the tips of the wings",
        "Three engines (one on each rear side and one in the tail)",
        "T-tail configuration",
        "A more rounded nose",
        "Winglets on the ends of the wings",
        "T-tail with smaller size stabilizers"
    ],
    "Eurofighter Typhoon": [
        "presence of underwing stores (weapons or fuel tanks)",
        "Presence of modern radar and sensor systems",
        "civilian livery and design",
        "military-grade camouflage or gray paint scheme",
        "Canards (small forewings near the front)",
        "Military camouflage or jet grey coloring",
        "canards (small forward wings near the nose)",
        "Military markings and insignia",
        "Canard foreplanes (small, wing-like structures near the nose)",
        "Low-visibility gray paint scheme",
        "Military insignia or camouflage",
        "Presence of weapons or weapon mounts",
        "Distinctive airline liveries or branding",
        "Canards (small forward wings)",
        "Absence of large commercial airline windows"
    ],
    "F-16": [
        "Military markings (e.g., camouflage paint, military insignia)",
        "Presence of weaponry or pylons for attaching bombs/missiles",
        "Compact and agile airframe",
        "smaller size and sleeker profile",
        "Military camouflage or markings",
        "Military markings or camouflage paint",
        "Use and markings: F-16 is often seen with U.S. Air Force markings, while F/A-18 is commonly marked with U.S. Navy or Marine Corps insignia.",
        "Military markings and insignia",
        "LERX (Leading Edge Root Extensions): Both aircraft have these, but their shapes differ and can be used as distinguishing characteristics.",
        "Single-engine configuration",
        "Smaller size compared to commercial aircraft",
        "Smaller size and sharper profile (F-16)",
        "distinctive vertical stabilizer shape with a sharp leading edge",
        "Delta-shaped wings (or with one vertical stabilizer and two horizontal stabilizers)",
        "Landing gear design: F-16 and F/A-18 have different landing gear configurations and wheel setups."
    ],
    "F/A-18": [
        "Tailhook (for carrier-based landing)",
        "Wingtip missile rails or pylons",
        "Landing gear: The F/A-18 has landing gear designed for carrier takeoffs and landings, often appearing more rugged, while the Boeing 767 has landing gear suited for standard runway operations.",
        "swept-back wings with a more aggressive angle",
        "folding wingtips (for carrier storage)",
        "shorter, more robust landing gear",
        "Larger landing gear designed for airport runways",
        "Tactical paint schemes (often gray or camouflage) ",
        "military-grade weaponry and pylons",
        "Twin tail fins",
        "Carrier-capable tailhook",
        "external weaponry or pylons for missiles and bombs",
        "Twin tail fins (vertical stabilizers)",
        "Compact and agile design suitable for carrier operations",
        "Absence of visible weaponry or military features"
    ],
    "Falcon 2000": [
        "Twin-engine jet vs. single-engine propeller",
        "**Winglets**: Some models of the Falcon 2000 have distinct winglets, while the CRJ-200 commonly has raked wingtips or no winglets.",
        "Manufacturer logo (Dassault for Falcon 2000)",
        "Low-wing aircraft vs. low-wing (with visible struts supporting wings)",
        "Swept wings with a slight upward angle",
        "Dassault Falcon logo or markings",
        "Nose shape (sleeker for Falcon 2000)",
        "Position of engines (mounted on the fuselage for Falcon 2000, not on the wings)",
        "Distinctive winglets on the wingtips (in some models)",
        "Winglets on the ends of the wings",
        "twin-engine configuration (mounted under the wings)",
        "Sleeker, more modern design",
        "T-tail configuration",
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure.",
        "Business jet appearance rather than commercial airliner"
    ],
    "Falcon 900": [
        "Signature windows characteristic of Dassault Falcon jets",
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "Swept-back winglets on the tips of the wings",
        "Dassault Falcon logo or branding",
        "Landing gear configuration ",
        "T-tail: The Falcon 900 features a distinctive T-tail design.",
        "More winglets or wing components",
        "Winglets: The Embraer Legacy 600 often has noticeable winglets at the wingtips, whereas the Falcon 900 typically does not.",
        "Swept wings (Falcon 900)",
        "Winglets at the end (Falcon 900)",
        "Window configuration: The arrangement and shape of the windows may differ, with the Falcon 900 having a more scattered arrangement and the Embraer Legacy 600 having a more uniform row.",
        "Distinctive winglets (blended into the wing)",
        "landing gear placement",
        "engine configuration",
        "Trijet configuration (three engines)"
    ],
    "Fokker 100": [
        "Winglets: Fokker 100 often has small winglets at the tips, while the DC-9 does not.",
        "Landing gear placement and structure.",
        "Two engines mounted on the rear of the fuselage (Fokker 100 has this configuration).",
        "Tail cone: The design of the tail cone or APU exhaust might be different.",
        "T-tail (horizontal stabilizer mounted on top of the vertical stabilizer).",
        "Absence of a third engine in the tail (Boeing 727 has three engines)",
        "T-tail configuration",
        "length of the fuselage (Fokker 100 has a longer fuselage)",
        "Different wing design and landing gear configuration",
        "T-tail design",
        "Usually distinctive serial or model number associated with Fokker 100",
        "Larger size and longer fuselage.",
        "Lack of winglets on the wings (Boeing 757 often has winglets)",
        "wing-mounted engines (Fokker 50 has none; it has turboprop engines instead)",
        "shape and size of tail section (Fokker 100's tail is larger and differently shaped)"
    ],
    "Fokker 50": [
        "4-bladed propellers (Fokker 50) vs. 6-bladed propellers (Dornier 328)",
        "Propeller Count: The Fokker 50 typically has twin turboprop engines, while the Saab 2000 also has twin turboprops but may show differences in blade design and count.",
        "Landing Gear: The landing gear configuration of the Fokker 50 could differ; for instance, the number and placement of wheels may vary in comparison to the Saab 2000.",
        "Four-bladed propellers",
        "Typically four-blade propellers on engines (ATR-42 generally has six-blade propellers)",
        "Propellers: The Fokker 50 has two turboprop engines with visible propellers, whereas the Fokker 70 is a jet aircraft with turbofan engines and no propellers.",
        "Presence of a small \"shark fin\" antenna on top of the fuselage",
        "Two turboprop engines (one on each wing)",
        "Fokker 50 has a more pronounced upward curve at the end of the tail section",
        "Tail Design: The Fokker 50 has a more rounded tail fin, whereas the Saab 2000's tail fin is generally more angular and upright.",
        "T-tail (the horizontal stabilizer is mounted at the top of the vertical stabilizer)",
        "Dual tail fins on Fokker 50 vs. single vertical tail fin on Dornier 328",
        "Fokker 50 has a more rounded nose",
        "**Propellers**: The Fokker 50 is a turboprop aircraft and has large propellers on its wings, while the Embraer ERJ 145 is a jet and has jet engines.",
        "Engine Placement: The engines on the Fokker 50 are mounted closer to the fuselage, while on the Saab 2000, they are mounted slightly farther out on the wings."
    ],
    "Fokker 70": [
        "T-tail configuration.",
        "Swept-back wings as opposed to the straighter wings of the Fokker 50.",
        "Turbojet engines mounted on the rear fuselage rather than propellers on the wings.",
        "Winglets: Some Boeing 737 models have winglets at the tips of the wings, which are less common on the Fokker 70.",
        "Lack of a straightforward nose cone seen on the MD-80",
        "Sleek, rear-mounted twinjet design.",
        "Landing gear (Fokker 70 has a simpler landing gear setup compared to the Boeing 727)",
        "Size: The Fokker 70 is generally shorter and smaller than the Boeing 737.",
        "Pointed nose shape",
        "Distinctive Fokker logo often found on the aircraft’s tail or fuselage",
        "T-tail design",
        "Distinctive larger winglets",
        "T-tail configuration",
        "Low wing design",
        "Conventional tail (not T-tail)"
    ],
    "Global Express": [
        "Landing Gear: The Global Express has retractable landing gear with a different configuration compared to the CRJ-200.",
        "manufacturer logo (Bombardier for Global Express, Dassault for Falcon 900)",
        "Landing gear configuration",
        "Landing gear configuration and design",
        "Fuselage Length: The Global Express has a longer fuselage compared to the CRJ-200.",
        "Engine Placement: On the Global Express, the engines are mounted closer to the fuselage compared to the more pronounced placement on the CRJ-200.",
        "additional antenna arrays and sensors",
        "distinctive landing gear configuration",
        "Nose shape (Global Express has a more pointed nose)",
        "Window layout (Global Express might have different window spacings or shapes)",
        "Winglets on the tips of the wings",
        "Swept-back wings",
        "Different engine placement and nacelle design",
        "Window Configuration: The Global Express has a different window layout with larger, more widely spaced windows compared to the CRJ-200.",
        "Longer and more pointed nose"
    ],
    "Gulfstream": [
        "Trijet or twinjet configuration (if specifically the Falcon 2000, it’s a twinjet)",
        "landing gear configuration",
        "Distinct Gulfstream logo/branding",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Winglets with a different design compared to Gulfstream",
        "Wingtip winglets (on some Gulfstream models)",
        "winglets",
        "logo/branding",
        "Signature \"G\" logo on tail (if present)",
        "T-tail",
        "T-tail configuration",
        "Smaller fuselage relative to Gulfstream aircraft",
        "Distinctive winglets (on newer Gulfstream models)",
        "Different nose shape, less pointed than Gulfstream",
        "more modern design features"
    ],
    "Hawk T1": [
        "Red Arrows or similar military aerobatics team markings ",
        "Red, white, and blue color scheme (common for Hawk T1 in RAF service)",
        "Canopy designed for two tandem seats (instructor and trainee)",
        "Longer, sleeker fuselage typical of a jet trainer",
        "Single jet engine exhaust at the rear (Hawk T1)",
        "Military markings or insignia, often used by air forces for training (Hawk T1)",
        "Single jet engine",
        "short landing gear",
        "Military markings",
        "Military markings and paint schemes",
        "Single-engine jet",
        "Turbine jet engine exhaust",
        "Pointed nose",
        "sharp, swept-back wings",
        "Advanced avionics and instrumentation"
    ],
    "Il-76": [
        "Bulky landing gear located in fairings on the fuselage sides",
        "Three engines (two on the wings and one in the tail)",
        "Large, robust landing gear designed for rough airstrips",
        "Tall, boxy fuselage",
        "Four engines mounted under the wings",
        "Rear cargo ramp/door",
        "Four jet engines mounted on wings (Il-76) vs. four turboprop engines (An-12)",
        "Distinctive radome (dome-shaped weather radar cover) on the nose",
        "T-shaped tail (horizontal stabilizer located at the top of the vertical stabilizer)",
        "Number of engines: The Il-76 typically has four engines mounted under its wings.",
        "Bulky, multi-wheel landing gear",
        "Nose gear located in a forward fuselage nosewheel configuration",
        "Typically larger size compared to BAE-125",
        "Four engines mounted on pylons under the wings",
        "Generally bulkier and larger fuselage"
    ],
    "King Air": [
        "Propellers (King Air has turboprop engines, while Cessna Citation has jet engines)",
        "Landing gear: The landing gear design and placement might vary between the two, with King Air models often having simpler, less robust landing gear compared to the more substantial gear on Gulfstream jets.",
        "Twin turboprop engines",
        "More contemporary design with modern avionics",
        "Turboprop engines with prominent propeller spinners",
        "Propeller engines (King Air has twin turboprop engines, while Falcon 2000 has jet engines)",
        "Propellers: King Air aircraft typically have propellers, while Gulfstream jets are known for their turbofan engines.",
        "Twin jet engines",
        "Wider fuselage for passengers/comfort",
        "Two turboprop engines mounted on the wings",
        "Winglets at the tips of the wings",
        "Single piston engine",
        "Retractable landing gear that is more streamlined with the wings",
        "Landing gear (King Air often has retractable tricycle landing gear including the forward gear, while Falcon 2000 has a more robust and streamlined landing gear system adjusted for jet performance)",
        "Engine nacelle shape and location (King Air's engines are mounted under the wings, while Falcon 2000's engines are mounted at the rear of the fuselage)"
    ],
    "L-1011": [
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "Number of engines: The L-1011 typically has three engines, whereas the A340 has four.",
        "Longer landing gear struts",
        "L-1011 often has a more rounded nose compared to the DC-9's more pointed design",
        "Third engine in the tail cone (L-1011)",
        "Winglets or absence thereof (Boeing 757 often has winglets)",
        "Three engines (as opposed to four on the DC-8)",
        "Generally larger size compared to the A320",
        "Dual main landing gear bogies (each with 2 wheels) on each side",
        "More angular-wing planes at the wing root",
        "T-tail design on the DC-9 (L-1011 has a conventional tail)",
        "**Winglets**: The A300 might have winglets on the tips of its wings depending on the variant, while the L-1011 does not feature winglets.",
        "**Landing gear arrangement**: The L-1011 has a unique landing gear arrangement with an extra set of landing gear in the center for better weight distribution, while the A300 has a more conventional two-bogie arrangement.",
        "Three engines (with one engine in the tail and two under the wings)",
        "Larger, more rounded nose"
    ],
    "MD-11": [
        "Winglets on the tips of the wings (some MD-90 models may not have winglets)",
        "Length: The MD-11 is generally longer compared to the MD-80.",
        "Sharp, angled winglets (on some models)",
        "Nose shape: the MD-11 has a slightly more pointed nose compared to the A310.",
        "Winglets: the MD-11 has winglets (small vertical stabilizers) at the tips of the wings, whereas the A310 does not.",
        "Winglets that curve upwards at the wingtips",
        "a more modern, aerodynamic shape",
        "Different winglets or wingtip design",
        "Trijet engine configuration (one engine on the tail and two under the wings)",
        "Winglets on the wingtips",
        "Tailplane with a smaller span",
        "Extended fuselage: the MD-11 typically has a longer fuselage compared to the A310.",
        "Tail Structure: The MD-11 often has a more pronounced T-tail with a larger horizontal stabilizer compared to the MD-80.",
        "The MD-11 typically has a slightly wider and longer tail with a distinct APU exhaust at the tail cone, whereas the MD-90 does not have this feature",
        "T-tail design (tailplane mounted at the top of the tail fin)"
    ],
    "MD-80": [
        "Landing gear configuration (MD-80 has a more robust landing gear)",
        "Distinctive nose shape (MD-80 has a more pointed nose)",
        "T-tail configuration (prominent in MD-80)",
        "More modern and sleeker design overall",
        "Older, more angular design elements",
        "More slightly swept-back wings",
        "T-tail configuration",
        "Aircraft nose shape (MD-80 has a more rounded nose)",
        "Shorter wingspan without winglets (MD-11 often has winglets)",
        "Single overwing emergency exit (while many DC-8s have four overwing exits)",
        "smaller, less powerful engines",
        "Longer fuselage compared to CRJ-700",
        "Length of the fuselage (MD-80 is longer)",
        "landing gear doors",
        "tailcone design (DC-9 \"screwdriver\" tail on some MD-80 models)"
    ],
    "MD-90": [
        "absence of the third engine at the tail (MD-90).",
        "Winglets (some MD-90s have winglets while MD-80s generally do not)",
        "T-tail configuration on the CRJ-700 (not present on the MD-90)",
        "generally smaller size and narrower body of the MD-90.",
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "Nose shape: The MD-90 usually has a more pointed nose compared to the A300.",
        "Extended fuselage: The MD-90 is longer than the DC-9.",
        "The absence of the third window exit on both sides of the fuselage right behind the wings, which the MD-90 lacks and the DC-9 usually has.",
        "Winglets: The MD-11 typically has winglets at the tips of its wings, while the MD-90 does not.",
        "Fuselage length: The MD-11 has a longer fuselage compared to the MD-90.",
        "Length of the aircraft: The MD-90 is typically longer and slimmer than the A300.",
        "T-tail design (MD-90) vs. conventional tail (DC-10).",
        "Winglets: The MD-90 may have small winglets at the tips of its wings, which the DC-9 does not generally have.",
        "Tail-mounted engines: The MD-90 typically has engines mounted at the rear of the fuselage.",
        "Single-aisle fuselage (MD-90) vs. wide-body fuselage (DC-10)."
    ],
    "Metroliner": [
        "Smaller, regional airline markings or livery",
        "Fixed landing gear (in some models)",
        "commuter airline livery",
        "Landing gear position (retractable gear in the wings for Metroliner)",
        "Twin turboprop engines (Metroliner)",
        "Landing gear positioned under the wings",
        "Turboprop engines on the wings",
        "Propeller-driven engines ",
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "Fixed (non-retractable) landing gear on some models",
        "landing gear with fairings",
        "Propellers",
        "High horizontal stabilizer (T-tail) ",
        "T-tail design (Metroliner)",
        "twin turboprop engines"
    ],
    "PA-28": [
        "**Distinctive Paint Schemes and Logos:** Look for any distinctive paint schemes or logos that might be characteristic of Piper and Cirrus aircraft.",
        "Fixed landing gear (usually)",
        "fixed landing gear (most models)",
        "**Canopy Design:** The PA-28 often has a more traditional, smaller cockpit side window design compared to the larger, single-piece bubble canopy of the SR-20.",
        "Landing gear: The PA-28 usually has fixed tricycle landing gear with the nose wheel located under the nose, while the DR-400 also has fixed tricycle landing gear but with slight design differences.",
        "The tail section with a more traditional, less swept-back design",
        "Number of engines (PA-28 typically has one propeller engine; A300 has two jet engines)",
        "Small, single-engine design",
        "Private aircraft markings instead of commercial airline livery",
        "single-engine configuration",
        "Single-engine aircraft",
        "Fixed landing gear",
        "**Wing Tips:** The PA-28 has more traditional wing tips, whereas the SR-20 often has winglets or more advanced aerodynamic designs.",
        "Single-engine design",
        "**High Wing vs. Low Wing:** PA-28 typically has a low wing configuration, meaning the wings are mounted below the fuselage."
    ],
    "SR-20": [
        "Cirrus Aircraft logo",
        "Generally used for personal or flight training purposes",
        "Cirrus logo",
        "Cirrus Airframe Parachute System (CAPS) handle",
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Single-engine piston aircraft",
        "T-tail configuration (PA-28 has a conventional tail)",
        "Four-seater cockpit",
        "Smaller, single-engine aircraft design",
        "Single-engine (propeller) aircraft",
        "Fixed landing gear",
        "fixed landing gear",
        "Single propeller at the front",
        "Composite materials (SR-20 often uses composite materials, while PA-28 usually has a metal airframe)",
        "single-engine propeller"
    ],
    "Saab 2000": [
        "Number of propellers (Saab 2000 typically has 4 or 5 blades on its propellers.)",
        "Logo and branding (Airlines operating these aircraft may have distinct liveries.)",
        "Presence of winglets at the tips of the wings (Saab 2000)",
        "Typically equipped with 5-bladed propellers (ATR-72 usually has 6-bladed propellers)",
        "Propeller engines (The Saab 2000 has turboprop engines, whereas the Fokker 100 has jet engines.)",
        "Winglets on the wingtips",
        "Turboprop engines (two propellers)",
        "T-tail design but different in shape compared to Saab 2000",
        "Landing gear (Differences in landing gear placement and visibility can also help in distinguishing them.)",
        "Propeller engines (Saab 2000) vs. jet engines (Embraer ERJ 145)",
        "Six-bladed propellers (compared to the 340's four-bladed propellers)",
        "Swept wings",
        "Six-bladed propellers",
        "slightly pointed nose",
        "Jet engines (no propellers)"
    ],
    "Saab 340": [
        "Two Pratt & Whitney Canada PW100 series engines with longer nacelles",
        "**Fuselage Length**: The Saab 2000 has a longer fuselage compared to the Saab 340.",
        "**Landing Gear**: Differences in the landing gear configuration can also be observed, with the Saab 2000 typically having a more robust design owing to its higher performance characteristics.",
        "Saab logo or specific airline livery indicative of Saab 340 operators",
        "Lower landing gear structure",
        "T-tail configuration",
        "T-tail design",
        "Smaller size compared to the BAE 146",
        "Distinctive T-tail",
        "More elongated fuselage",
        "T-tail with horizontal stabilizers mounted at the top of the vertical tail fin",
        "**Landing Gear**: The landing gear of the Saab 340 is typically more prominent and may be more visible in photos compared to the sleeker design of the landing gear of the Embraer ERJ 145.",
        "Sleek, narrow nose profile",
        "**Propellers**: The Saab 340 has two turboprop engines with large, visible propellers, while the Embraer ERJ 145 has jet engines without propellers.",
        "Twin turboprop engines"
    ],
    "Spitfire": [
        "Lack of turboprop engines",
        "piston engine exhaust stacks",
        "WWII-era military markings and camouflage",
        "Single-engine piston aircraft",
        "Lack of modern avionics and weapons systems",
        "Tailwheel landing gear",
        "tailwheel landing gear",
        "Classic tailplane (Spitfire) vs. swept-back tailplane (Hawk T1)",
        "Canopy with a more classic, rounded design",
        "Propeller blades (typically three-bladed for early models)",
        "propeller engine",
        "Single propeller engine at the nose",
        "Propeller-driven engine",
        "Single-engine propeller",
        "Exhaust stacks on the sides of the nose"
    ],
    "Tornado": [
        "smaller, more compact airframe",
        "single or tandem cockpit configuration",
        "absence of solid structure and wings typical of aircraft",
        "Camouflage or gray paint scheme (typical of military aircraft)",
        "Canopy for pilot and co-pilot",
        "twin-engine configuration",
        "Twin-engine configuration",
        "absence of wings or fuselage",
        "Compact and aerodynamic airframe",
        "swept wings with variable geometry (adjustable sweep angle)",
        "no visible cockpit or engines",
        "twin-engine design with afterburners",
        "landing gear (if visible in a static or landing/takeoff photo)",
        "Camouflage paint scheme",
        "Swept wings"
    ],
    "Tu-134": [
        "Windows arrangement: The Tu-134 might have a different alignment and number of passenger windows compared to the Boeing 727.",
        "Landing gear located in pods on rear fuselage (Tu-134)",
        "Length and fuselage: The Tu-134 is generally shorter in length compared to the Boeing 727.",
        "narrower fuselage (Tu-134)",
        "Fuselage Length: The Tu-134 has a shorter fuselage in comparison to the longer Tu-154.",
        "Fewer windows along the fuselage",
        "More compact fuselage",
        "Wing placement: Both have low-mounted wings, but the details in wing design differ.",
        "anhedral tailplanes (Tu-134) versus horizontal tailplanes (Yak-42)",
        "Rear-mounted engines (closer to the fuselage in the Tu-134)",
        "Shorter fuselage",
        "Lower passenger capacity",
        "3-wheeled main landing gear (Tu-134)",
        "Fewer windows along the aircraft (Tu-134 typically has fewer windows)",
        "rear-mounted engines closer to tailplane (Tu-134) versus more forward-mounted engines (Yak-42)"
    ],
    "Tu-154": [
        "Landing gear configuration (Tu-154 has a different setup compared to the Boeing 707)",
        "Longer fuselage in comparison to the DC-9",
        "A sleeker, more modern appearance with less sweep on the wings",
        "Swept-back wings with pronounced anhedral (downward angle)",
        "Number and spacing of cabin windows: The Tu-154 often has less spacing between windows compared to the Boeing 727.",
        "Narrow-body: The Tu-154 is a narrow-body jet, whereas the A340 is a wide-body jet.",
        "Wing sweepback angle is more pronounced",
        "Main landing gear in the wings and tail region",
        "National or airline markings typical of Russian or Eastern Bloc aviation during its era",
        "Shorter, more rounded nose compared to the DC-8",
        "Landing gear: Tu-154 has 12 main tires in a six-wheel main landing gear truck on each side vs. the DC-9's main landing gear setup",
        "Swept-back wings with a slight kink near the root",
        "Wing-mounted landing lights",
        "Narrow fuselage compared to the Boeing 707",
        "Swept wings"
    ],
    "Yak-42": [
        "Landing gear (Yak-42's landing gear configuration differs from that of Saab 340's)",
        "No propellers (Saab 2000 is a turboprop aircraft, while Yak-42 is a jet)",
        "Tail design (Yak-42 has a T-tail, Saab 340 has a conventional tail)",
        "Number of engines (Yak-42 has three jet engines, Saab 340 has two propeller engines)",
        "Engine type (Yak-42 has jet engines, Saab 340 has turboprop engines)",
        "Wing placement (Yak-42 has low-wing configuration, Saab 340 has high-wing configuration)",
        "lack of visible propellers (ATR-72 has two propellers)",
        "Wing-mounted air brakes (Yak-42 has these, while the Tu-134 does not)",
        "Yak-42 generally has fewer windows along the fuselage than the Tu-154",
        "More bulbous nose shape (Yak-42 nose is less pointed than Tu-134's)",
        "Smaller overall size and wingspan compared to the Boeing 717",
        "Designated winglets or different wing shapes",
        "single-aft entry door vs. multiple side entry doors on the ATR-72",
        "Fuselage shape (Yak-42’s fuselage is typically more rounded, Saab 340’s fuselage has a more cylindrical shape)",
        "Size (Yak-42 is generally larger than Saab 340)"
    ]
}