{
    "Abyssinian": [
        "Short coat with a silky texture",
        "Solid blue-gray coat",
        "short, dense coat with a \"ticked\" tabby pattern",
        "short, fine coat with a distinct \"ticked\" pattern",
        "Sleek, short coat with a ticked pattern",
        "short, fine coat",
        "Ticked tabby pattern",
        "Short, ticked coat",
        "large pointed ears",
        "Dark spots or rosettes over a lighter background",
        "Lithe, agile appearance",
        "Large, pointed ears",
        "large, pointed ears",
        "Short, sleek fur",
        "overall warm, ruddy coloration with no distinct points on the face, ears, paws, or tail",
        "Typically no distinctive facial mask markings",
        "Small paws without long hair clumps or tufts",
        "Green eyes",
        "ruddy or warm reddish-brown coloration",
        "Warm, ruddy coat (often golden, red, or fawn)"
    ],
    "Bengal": [
        "Overall golden or brownish hue",
        "Wrinkled appearance",
        "Rosetted spots or horizontal stripes",
        "Markings on the legs and tail, including spots or bands",
        "distinctively patterned coat with varying colors ",
        "Spotted or rosetted coat patterns",
        "High-energy, active posture",
        "Lighter eye color, often green or gold",
        "Rosetted or marbled coat patterns",
        "short, sleek coat with a distinctive spotted or marbled pattern",
        "Larger size compared to a chihuahua",
        "muscular body and slender build",
        "a cobby, stocky body",
        "Prominent cheekbones",
        "Horizontal striping on legs and tail",
        "Usually a more elongated body shape",
        "Pointed ears with rounded tips",
        "Wild-looking facial markings, including a pronounced M shape on the forehead",
        "Pointed ears",
        "Short, thick tail with a blunt tip"
    ],
    "Birman": [
        "Birmans have distinctive blue eyes, while boxers have dark brown eyes.",
        "A Birman has a long, silky coat, whereas a boxer has short, smooth fur.",
        "A Birman generally displays a calm, serene demeanor, while a boxer often has a more energetic and playful appearance.",
        "A Birman is a cat with a slender, graceful body, compared to a boxer's muscular, robust canine build.",
        "Birmans typically have a pointed color pattern, with darker fur on the face, ears, paws, and tail, unlike boxers who usually have a solid or brindle coat with possible white markings.",
        "Birmans have a bushy tail, whereas boxers have a shorter, more straight tail.",
        "lack of the double coat seen in Keeshonds",
        "Stockier and more muscular build compared to the Ragdoll",
        "More muscular and stocky body build compared to the slender Siamese",
        "typically larger size compared to a Pomeranian",
        "Color point pattern with darker extremities (face, ears, paws, tail)",
        "Absence of a distinct, pushed-in nose typically seen in Japanese Chins",
        "pointed color pattern (darker ears, face, paws, and tail)",
        "Color-point coat pattern (darker face, ears, paws, and tail)",
        "Pointed coat pattern (darker ears, face, paws, and tail with lighter body)",
        "Stocky and muscular body",
        "Silkier, lighter coat texture",
        "Medium-length, slightly wavy coat",
        "Defined color points on ears, face, paws, and tail",
        "Coat color and patterns (Birmans usually have color points on their ears, face, paws, and tail)"
    ],
    "Bombay": [
        "Light-colored body with darker points (ears, face, paws, tail)",
        "Medium-sized, rounded ears",
        "Black nose and paw pads",
        "Short, close-lying fur",
        "rounded head with a short muzzle",
        "paw structure",
        "short, flat nose",
        "Short, smooth fur",
        "Whiskers (visible due to fur)",
        "short, close-lying, and shiny fur",
        "Rounded head and short muzzle (Bombay)",
        "Large, almond-shaped blue eyes",
        "fur texture",
        "Lack of a pronounced ruff around the neck (Persians often have a fluffy, ruffled neck)",
        "Long, dense double coat (Newfoundland)",
        "Rounded head with a shorter nose",
        "tail shape",
        "Boxer is a dog breed, typically recognized by its sturdy, medium-sized frame and expressive face.",
        "Absence of a fluffy tail and mane",
        "Short, sleek black fur"
    ],
    "British Shorthair": [
        "**German Shorthaired Pointer**:",
        "Typically medium to large size but smaller compared to an American Bulldog",
        "Dog-like body structure",
        "Solid coat colors (commonly blue-gray)",
        "Typically solid coat colors or a classic tabby pattern",
        "Stocky build",
        "Solid or classic tabby color varieties, often in blues, but many colors are possible",
        "Fox-like face",
        "Short nose",
        "Whisker pads prominent and well-defined",
        "Short, dense coat with a plush feel",
        "Tail short and thick but tapering at the end",
        "Cat-like features (as opposed to a dog's snout and ears)",
        "Ears set wide apart and slightly rounded at the tips",
        "Ears are broad at the base and slightly rounded at the tips",
        "Typically a lack of distinct color points (differentiating from the Birman's color-point pattern)",
        "Whisker pads prominent",
        "Calm and reserved demeanor in appearance",
        "Distinct color points on the ears, face, paws, and tail",
        "Longer legs and more pronounced muscles"
    ],
    "Egyptian Mau": [
        "Banding (striping) on the legs and tail",
        "Loose skin flap extending from the flank to the hind leg (provides greater agility)",
        "Visible skin flap extending from the flank to the back knee (allows for greater agility)",
        "Slender, agile frame",
        "Overall cat-like features versus dog-like features",
        "Round, broad-set eyes (often copper or blue)",
        "Short hair length",
        "Longer hind legs compared to the front legs",
        "Slender, agile body",
        "Large, pointed ears",
        "Spotted coat pattern",
        "Distinctive spotted coat pattern",
        "Longer tail relative to body size",
        "Generally lighter coat color with silver, bronze, or smoke tones",
        "Slightly longer hind legs compared to front legs",
        "Spotted coat",
        "spotted coat",
        "Long, slender body",
        "Ears are relatively large and pointed",
        "Solid or classic tabby coat patterns rather than spotted"
    ],
    "Maine Coon": [
        "Generally breed comes in a variety of colors and patterns, unlike Birman which is usually color-pointed with white \"gloves\" on the paws.",
        "Sleek, elongated body",
        "Large, expressive eyes",
        "Wide, expressive eyes",
        "prominent ruff",
        "rectangular body shape",
        "Pointed ears with tufts of fur at the tips",
        "prominent ruff around the neck (especially in males)",
        "Full, fluffy coat"
    ],
    "Persian": [
        "Pointed ears",
        "small, rounded ears",
        "Small, rounded ears",
        "Small, rounded ears that are set wide apart",
        "Prominent, large round eyes",
        "dense, plush appearance",
        "rounded ears",
        "Large, round eyes",
        "large, round eyes",
        "prominent, round eyes",
        "Calm and relaxed demeanor in appearance",
        "Round, large eyes",
        "short muzzle",
        "calm and laid-back demeanor",
        "Stocky build with short legs",
        "round eyes",
        "stocky and cobby body type",
        "Short, flat nose",
        "Compact, cobby body shape",
        "Cat-like paw structure"
    ],
    "Ragdoll": [
        "distinctive color patterns such as colorpoints",
        "muscular, stocky build",
        "Smaller size and build compared to a dog",
        "prominent ruff around the neck",
        "Size: Ragdolls are much smaller compared to the large Newfoundland dogs.",
        "Body structure: Ragdolls have a more muscular and semi-longer body, whereas Bombays have a more compact and muscular build.",
        "A distinct \"V\" shape marking on the forehead (common in Ragdolls)",
        "No snout (flat-faced)",
        "Larger size and muscular build",
        "Color point contrast can be more pronounced in some Ragdoll varieties",
        "tendency to lie limp when picked up",
        "V-shaped marking on face",
        "typically cropped or naturally floppy ears",
        "square-shaped head",
        "broad muzzle",
        "Coat color: Ragdolls typically have lighter, color-pointed coats with shades of cream, lilac, blue, or chocolate, whereas Bombays have solid black coats.",
        "Facial structure: Ragdolls have a more wedge-shaped face with a soft expression, while Bombays have a more rounded face with a shorter muzzle.",
        "Point coloration with generally lighter body and darker extremities",
        "pointed ears",
        "Pointed ears"
    ],
    "Russian Blue": [
        "Distinctive patterned coat markings",
        "Relatively reserved or shy demeanor in photos",
        "Short, dense bluish-gray fur",
        "Short, dense, and plush bluish-gray coat",
        "Short, dense, bluish-gray fur",
        "Short, dense, and plush blue-gray coat",
        "Solid blue-grey coat",
        "Grey/blue fur color",
        "Silvery-blue, short, dense coat",
        "Dense, short, blue-gray coat",
        "Short, dense, blue-gray coat",
        "A stout, compact body",
        "Brown or amber eyes",
        "Facial features typical of cats, such as a short nose and whisker pads",
        "Short, smooth fur usually in fawn or black color",
        "Semi-long, soft fur usually with a pointed color pattern (darker on the ears, face, paws, and tail)",
        "Bright green, almond-shaped eyes",
        "Blue almond-shaped eyes",
        "Generally more athletic and active appearance",
        "Soft, dense grey fur"
    ],
    "Siamese": [
        "Light-colored body with darker points (ears, face, paws, tail)",
        "Light-colored body with darker points (ears, face, paws, and tail)",
        "pointed color pattern (darker ears, face, paws, and tail)",
        "Prominent, triangular-shaped head with large ears",
        "Large, pointed ears",
        "large, pointed ears",
        "erect, large ears",
        "triangular head with large ears",
        "Prominent, large ears",
        "triangular-shaped head",
        "wedge-shaped head",
        "darker points on the ears, face, paws, and tail",
        "darker points on ears, face, paws, and tail",
        "triangular head shape",
        "pointed coloration (darker extremities)",
        "slender body",
        "slender and elongated body",
        "slender, elongated body",
        "Triangular face shape",
        "Color point pattern: Both breeds can have color points, but Siamese cats generally have a more defined pattern with darker colors on the ears, face, paws, and tail."
    ],
    "Sphynx": [
        "Skin color may be pink or have spots, whereas a Russian Blue has a solid blue-gray coat",
        "Lack of a dense double coat, which is characteristic of the Russian Blue",
        "Elongated, slender body",
        "Slender, elongated body",
        "Long, tapered tail",
        "Absence of a bushy tail",
        "Slender, lean body",
        "Hairlessness or very fine, short coat",
        "Long, whip-like tail",
        "Large, pointed ears",
        "Prominent, large ears",
        "Slender, muscular body",
        "Slender, muscular build",
        "Slender build: Sphynx cats have a lean, muscular frame, unlike the stockier build of pugs.",
        "Lack of fur or very short fur",
        "Muscular body",
        "Cat-like facial structure (e.g., eyes, nose)",
        "Large ears"
    ],
    "american bulldog": [
        "Typically larger in size",
        "Typically a larger size",
        "Longer legs",
        "longer legs",
        "Canine appearance",
        "Shorter coat, typically white or with patches",
        "shorter ears that may be cropped or naturally folded",
        "Slender and more elongated body",
        "Long and thin tail",
        "Broader head",
        "generally larger size",
        "wider, more prominent head",
        "Larger overall size",
        "Short, smooth coat",
        "short and smooth coat",
        "Short, sleek coat",
        "Ear shape may vary, often natural and not cropped ",
        "Stocky legs",
        "Broad head",
        "Strong, stocky legs"
    ],
    "american pit bull terrier": [
        "Thick, fluffy, white coat",
        "Stockier stature",
        "Less pronounced snout length compared to beagles",
        "Bushy tail that curls over the back",
        "Slender, elegant build",
        "Wider, more blocky head",
        "Leaner, more athletic build",
        "Non-curled tail",
        "Shorter and smoother coat",
        "shorter snout",
        "Generally solid or brindle coat colors, often with white markings ",
        "shorter coat",
        "Noticeable jaw strength",
        "Short coat without the double layer",
        "Erect or semi-prick ears",
        "Generally more energetic and alert demeanor",
        "Cropped or natural ears that are not as floppy as a pug's",
        "Longer snout and well-defined jawline",
        "Medium to large size",
        "Higher energy level and more muscular definition"
    ],
    "basset hound": [
        "Speckled or \"belton\" coat pattern",
        "White and brown or tri-color coat pattern",
        "Leaner, more elongated body compared to the boxer's muscular, stocky build",
        "Tri-color coat patterns often with large patches of white, black, and brown",
        "Tricolor or bicolor coat, often with a dominant presence of white, brown, and black",
        "tricolor fur pattern (usually black, white, and brown)",
        "Leaner, more athletic build",
        "Tricolor or bicolor coat, often with a combination of browns, black, and white",
        "Short, stocky legs",
        "Smooth coat with tricolor (black, white, and brown) or bicolor patterns",
        "Longer legs and taller stature",
        "Typically longer, more curved tail",
        "Medium to long coat with feathering",
        "Smooth, short coat",
        "long, droopy ears",
        "Long, droopy ears",
        "Long body",
        "Tricolor coat (often seen in basset hounds)",
        "Shorter, more compact body",
        "elongated body"
    ],
    "beagle": [
        "Long, fluffy coat",
        "Large, sturdy body",
        "Smaller size and shorter build",
        "Medium-sized body compared to the smaller, stockier body of a pug",
        "Outdoor or active setting (common for dogs)",
        "tri-color coat (white, black, and brown)",
        "Distinct hound-like appearance",
        "sturdier build",
        "Short, smooth coat",
        "Short and smooth fur",
        "short, smooth fur",
        "smaller stature",
        "Distinctive white-tipped tail",
        "Short, square muzzel",
        "Longer legs",
        "shorter legs",
        "Tricolor coat (typically white, brown, and black)",
        "Fox-like appearance",
        "long, droopy ears",
        "Long, droopy ears"
    ],
    "boxer": [
        "Docked tail (in some regions)",
        "a smaller, more compact body",
        "ears that can be cropped or left natural (cropped ears are pointed and stand up)",
        "larger size",
        "Upright ears (sometimes cropped)",
        "docked tail (often seen in boxers)",
        "Sturdy, medium-sized body",
        "docked tail (in many cases)",
        "typically docked tail (though not always)",
        "Narrower and longer muzzle",
        "cropped ears (sometimes seen in boxers)",
        "Medium size ",
        "Cropped ears (though may also be seen with natural ears)",
        "tricolored coat (usually black, white, and brown)",
        "Wide, rounded body",
        "high-set ears, often cropped",
        "Erect or cropped ears (often seen in boxers)",
        "docked tail",
        "Tapered, docked tail (though it can vary)",
        "Docked tail (common in boxers)"
    ],
    "chihuahua": [
        "Short, smooth coat (though some chihuahuas have long hair, it's typically finer)",
        "Short, smooth coat (although some Chihuahuas have long hair)",
        "Less fluffy tail (compared to the pomeranian's bushy tail)",
        "Smooth or long fur coat (different from the typically sleek coat of a Siamese cat)",
        "smooth or long coat",
        "short or long coat, often smooth",
        "short coat (though they can have long coats too)",
        "tendency to appear \"shivery\" or delicate",
        "Absence of whiskers (or less pronounced compared to a cat)",
        "Short coat",
        "Typically lighter weight and more fragile appearance",
        "Proportionate snout",
        "Pointed muzzle",
        "Short snout",
        "short, pointed muzzle",
        "Lack of pronounced muzzle",
        "Longer snout",
        "longer snout",
        "more prominent, defined facial features",
        "lighter overall build"
    ],
    "english cocker spaniel": [
        "Solid color or parti-color coat patterns, often with roan markings",
        "generally solid coat colors or roan patterns",
        "Dense, medium-length fur",
        "Stocky, compact build",
        "Smaller size and more compact build",
        "More varied coat colors and patterns",
        "Longer, wavy or curly coat",
        "Longer, wavy or curly fur",
        "Leaner and more athletic build",
        "Longer, more flowing fur",
        "Short, smooth coat",
        "Compact, athletic build",
        "Silky, medium to long fur",
        "Generally larger size",
        "fuller, denser coat",
        "Athletic build",
        "Medium-sized build",
        "Larger size",
        "Long, wavy fur",
        "Slender, athletic build"
    ],
    "english setter": [
        "Overall body structure: English Setters have a more slender, athletic build, whereas Leonbergers are larger and more robust with a powerful build.",
        "Overall build: English Setters exhibit a leaner, more athletic build compared to the robust, muscular build of Saint Bernards.",
        "Muzzle: English Setters have a more refined, narrow muzzle, while Leonbergers have a broader and more robust muzzle.",
        "Coat pattern: English Setters usually have a speckled or \"ticked\" coat pattern, while Leonbergers have a solid or slightly shaded coat.",
        "Ear shape and position: English Setters have medium-length, drooping ears that are set lower on the head, whereas Leonbergers have medium-length, triangular ears set higher.",
        "Coat: English Setters often have long, silky coats with feathered ears, legs, and tail, while Saint Bernards have dense, thick coats.",
        "Medium to large body size typical of a setter",
        "Large and robust build",
        "Thick, double coat primarily white in color, sometimes with gray, badger, reddish-brown, or tan markings",
        "medium to large size",
        "Medium-sized build",
        "Size: English Setters are typically larger than English Cocker Spaniels.",
        "Head and facial structure: English Setters have a more refined and elongated head structure, while Saint Bernards have a broader, more massive head with a pronounced muzzle.",
        "longer, more athletic build",
        "Tail: English Setters have a feathered tail that is usually carried horizontally, while Leonbergers have a bushy tail that may be carried slightly higher but not curled over the back.",
        "Size: English Setters are generally smaller and lighter than Leonbergers.",
        "longer coat",
        "Body build: English Setters have a more slender and athletic build, whereas English Cocker Spaniels appear more compact and robust.",
        "Leaner and taller body structure",
        "leaner body"
    ],
    "german shorthaired": [
        "**British Shorthair**:",
        "Presence of a dog in the photo (German shorthaired is a dog breed, while Russian Blue is a cat breed)",
        "Docked tail",
        "**Long tail, typically not docked**",
        "Docked tail (though not in all cases)",
        "**Short, dense fur with a distinctive liver (brown) and white coat pattern**",
        "Typically has a docked tail (though this can vary)",
        "Long, straight tail",
        "Tails are typically docked but are medium in length, whereas Miniature Pinschers often have very short, docked tails",
        "Tail: German Shorthaired Pointers often have a docked tail that is medium in length and carried horizontally, while English Cocker Spaniels have a thicker, feathered tail that is typically of medium length.",
        "Lean, elongated body",
        "Cropped or naturally short tail",
        "Short tail, docked in some regions but naturally medium in length",
        "Shorter tail, often docked",
        "Generally taller and leaner body",
        "Long, slender legs",
        "Sleek, short coat with fine hair",
        "**Eyes that can be of various colors but are often large and almond-shaped**",
        "Distinctive ticking or speckled pattern on the coat",
        "Short, dense coat with liver (dark brown) and white coloration"
    ],
    "great pyrenees": [
        "Less defined musculature compared to a pit bull",
        "Dark eyes with almond shape",
        "leveled topline",
        "Erect ears that can be rounded at the tips or slightly folded",
        "Large size",
        "Broad head with a relatively flat skull",
        "Solid or mostly white coloring, occasionally with badger or tan markings",
        "Predominantly white fur, potentially with patches of yellow, badger, or gray",
        "Larger size",
        "Medium to large size",
        "Predominantly white coat (slight other coloration possible but rare)",
        "slimmer build",
        "predominantly white fur, sometimes with gray or tan markings",
        "longer snout",
        "More slender and graceful build",
        "smaller, more angular head",
        "Dewclaws on the hind legs (double in some cases)",
        "Droopy ears",
        "Solid white coat (though some may have hints of grey or tan)",
        "larger overall size"
    ],
    "havanese": [
        "Sturdier and slightly larger build",
        "lacks the long ears and droopy appearance of a basset hound",
        "Longer, wavy or curly coat",
        "Sturdier build",
        "large, muscular body",
        "Longer muzzle",
        "Less pronounced drooping ears compared to the English Cocker Spaniel",
        "long, silky coat",
        "Long, silky coat",
        "Larger size",
        "Broader head with a shorter muzzle",
        "Compact and sturdy build",
        "long, shaggy coat",
        "curly or wavy coat",
        "Longer, silky hair",
        "Smaller and more delicate build",
        "Broad, sturdy build",
        "Sleek, elongated head with a pointed muzzle",
        "long tail carried over the back",
        "Shorter muzzle"
    ],
    "japanese chin": [
        "Proportionally longer and denser fur on the tail",
        "Smaller and finer-boned body structure compared to the more robust and fluffy appearance of a Pomeranian",
        "Long, silky fur",
        "Large, round eyes",
        "large, round eyes",
        "Long, flowing fur around the face and neck",
        "Prominent, large, round eyes",
        "Long, silky fur primarily around the body, chest, and tail",
        "Feathered tail that arches over the back",
        "Long, flowing fur particularly on ears and tail",
        "Long, flowing, and silky coat",
        "Feathered tail that curls over the back",
        "distinctive \"mane\" of longer fur around the neck and shoulders",
        "Slightly larger, more rounded head in proportion to body",
        "Heavier feathering on ears and tail",
        "Plumed tail carried over the back",
        "Feathered tail carried over the back",
        "Often a lively, alert expression",
        "short, upturned nose",
        "Longer, silky coat that often looks more voluminous "
    ],
    "keeshond": [
        "A keeshond has a fox-like face with a dark muzzle; a Ragdoll has a more rounded face.",
        "typically gray, black, and cream coloration",
        "Grey, black, and cream coloration",
        "Darker coloration, typically a mix of gray, black, and cream",
        "Dense, double coat with a plush, mane-like ruff",
        "Compact and square-shaped body",
        "Gray, black, and cream fur coloration",
        "Grey, black, and cream fur colors",
        "Compact body structure",
        "Spitz-like appearance with a curled tail",
        "Black and white or red and white fur colors",
        "Small size",
        "Dog-like appearance",
        "wedge-shaped head",
        "compact and smaller body size",
        "Typically grey, black, and cream-colored fur",
        "fox-like face",
        "Fox-like face",
        "Medium to large size",
        "medium to large size"
    ],
    "leonberger": [
        "Rectangular body shape",
        "dark mask on a lighter-colored face",
        "color: usually golden to reddish-brown",
        "Double coat with a longer, shaggier outer coat",
        "Brown or black coloration with a characteristic black mask over the face",
        "Droopy, triangular ears",
        "Coat color: Leonbergers typically have a golden to reddish-brown coat, while Saint Bernards often have a white coat with red, black, or brindle spots.",
        "face: black mask on the face",
        "coloration (Leonbergers usually have a black mask and a golden-brown coat)",
        "coat: thicker, longer, and often darker",
        "Reddish-brown or golden-yellow fur color",
        "face shape (Leonbergers have a more elongated face)",
        "Head shape: Leonbergers have a more rectangular head shape, while Saint Bernards have a broader, rounder head.",
        "Darker fur (typically a mix of yellow, red, brown, and black)",
        "thick double coat",
        "Canine body structure",
        "coat length (Leonbergers have a long and thick double coat)",
        "Black mask around the face",
        "Black mask on the face",
        "Distinct facial features of a dog"
    ],
    "miniature pinscher": [
        "Proportionally longer legs compared to a cat",
        "Red, sesame, black and tan, or cream-colored coats with distinct Urajiro (white to cream markings).",
        "overall size (typically larger than a Sphynx cat)",
        "fur coat",
        "Tail that may be docked",
        "paws with claws",
        "Curled tail",
        "Docked or naturally short tail (often erect)",
        "docked tail (commonly seen in miniature pinschers)",
        "Proportionately longer legs",
        "Sleek, muscular build",
        "Tail typically docked",
        "short, sleek coat",
        "alert and slightly intense expression"
    ],
    "newfoundland": [
        "Droopy jowls and facial expression compared to a cat's more defined features",
        "Overall dog-like appearance with a muscular build, contrasting a Persian cat's smaller, more delicate frame",
        "Similar appearance to a miniature black panther",
        "Large size, generally much larger than any cat",
        "Webbed feet (not easily visible, but can be a distinguishing feature)",
        "Large, bushy tail",
        "Sleek, short, black coat that is often described as \"patent leather\"",
        "Large size and robust build",
        "Copper or gold eyes that are strikingly large and round",
        "Larger and more robust frame",
        "Proportionally longer and broader body",
        "Large brown or black color palette",
        "Broad head with a distinct stop (the point where the forehead meets the muzzle)",
        "Large size",
        "Generally dark-colored fur (often black or brown)",
        "Large, muscular body",
        "Smooth, glossy fur",
        "Large, robust body",
        "Broad head and strong neck",
        "larger size"
    ],
    "pomeranian": [
        "Different color variations (e.g., oranges, creams, and blacks compared to Samoyed's typically white coat)",
        "Longer snout",
        "dense, fluffy coat",
        "shorter legs relative to body size",
        "absence of feline features (e.g., whiskers, cat-like eyes)",
        "Generally more energetic and lively posture compared to a typically calmer Persian cat",
        "Shorter snout",
        "shorter snout",
        "plume-like tail that arches over the back",
        "Fluffy, dense coat",
        "fluffy, dense coat",
        "typically a canine collar",
        "Variety of coat colors, often solid or with distinct patterning",
        "pointed snout",
        "Compact, sturdy body",
        "thicker body build",
        "Typically a plume-like tail that curls over the back",
        "Smaller, more delicate frame",
        "canine features (such as snout and paws) instead of feline features",
        "dense double coat"
    ],
    "pug": [
        "a short, curly tail",
        "short and stocky build",
        "Curly tail",
        "Stocky body",
        "short, smooth coat",
        "Short coat",
        "Smooth coat",
        "Typically seen with a dog collar or leash",
        "short, smooth fur",
        "short fur",
        "Stocky, muscular body",
        "Smaller stature",
        "Curved tail",
        "Smooth, fine coat",
        "Typically fawn or black coat color ",
        "Fawn or black coat color",
        "Short muzzle",
        "shorter muzzle"
    ],
    "saint bernard": [
        "Tail that is thick at the base and usually carried low",
        "Bushy tail, usually carried low or level with the back",
        "relatively thin, long tail",
        "Long, bushy tail",
        "Short, dense coat",
        "short or long coat but typically with distinct patches of color",
        "distinct white markings on chest and face combined with a brown, black, or brindle-colored coat",
        "Large size",
        "Long, thick fur, often with black, white, and brown markings",
        "Broad head",
        "thick, dense coat",
        "Stockier build compared to the sleeker samoyed",
        "Broad head with a pronounced stop (the transition from the skull to the muzzle)",
        "Broad, wide head",
        "more narrow muzzle compared to the broader snout of a Newfoundland",
        "Distinctive white and brown (or reddish-brown) coat",
        "Tri-color coat (typically white with brown and black markings)",
        "Barrel-shaped body",
        "broad, squared muzzle",
        "Distinctive tri-color coat (white with brown and black markings)"
    ],
    "samoyed": [
        "More compact build",
        "Presence of a collar or leash (indicative of a dog)",
        "pointed ears",
        "Elegant, slender build",
        "Upright, less triangular ears",
        "Erect, triangular ears",
        "a short, smooth coat",
        "wedge-shaped head",
        "larger size",
        "Larger size",
        "smaller and more compact body",
        "Upright, triangular ears"
    ],
    "scottish terrier": [
        "Distinctive long beard and eyebrows",
        "distinct beard and eyebrows",
        "Distinctive beard and eyebrows",
        "distinctive beard and eyebrows",
        "Bushy eyebrows",
        "Bristly eyebrows",
        "a prominent beard and eyebrows",
        "Prominent eyebrows and beard",
        "a rectangular-shaped, elongated body",
        "Elongated body shape",
        "Wiry, coarse coat",
        "Pointed ears that stand erect",
        "Black, wheaten, or brindle coloration",
        "longer, wiry fur",
        "Distinctive \"whiskered\" face look",
        "erect, pointed ears ",
        "a docked or naturally short tail",
        "Rectangular body shape",
        "Wiry, dense coat",
        "Pointed ears"
    ],
    "shiba inu": [
        "presence of a snout and whiskers (Sphynx cats have a more defined and slender facial structure)",
        "overall build (Shiba Inus are more robust compared to the slender physique of a Sphynx cat)",
        "erect, triangular ears",
        "Erect, triangular ears",
        "Pointed ears",
        "thick double coat with a soft undercoat",
        "upright, triangular ears",
        "broader and sturdier build",
        "Curled, bushy tail",
        "Upright triangular ears",
        "curled tail that rests over the back",
        "Smaller, more compact body structure",
        "thick, double-layered coat",
        "erect ears",
        "shorter, denser coat",
        "upright ears",
        "thick double coat",
        "Thick double coat",
        "ears (Shiba Inu has small, erect, triangular ears)",
        "typically exhibit a fox-like appearance"
    ],
    "staffordshire bull terrier": [
        "Tail is relatively thick and tapers to a point, carried low but not docked",
        "Square-shaped build",
        "Broad head with a short muzzle",
        "Often a broader stance",
        "Wide, short head",
        "shorter, wider muzzle",
        "smaller size overall",
        "broader, more pronounced head",
        "broad head",
        "Broad, shorter muzzle",
        "Rounded, medium-sized ears that may partially or fully stand up",
        "Ears that are sometimes cropped or naturally semi-erect",
        "Typically has a smooth, short coat",
        "Medium size (typically 13-16 inches in height)",
        "Presence of whiskers (Staffordshire Bull Terriers have prominent whiskers, while Sphynx cats have sparse or no whiskers)",
        "tapered tail (pugs usually have a curled tail)",
        "Typically smooth and short coat",
        "relatively longer muzzle (pugs have a short, flat muzzle)",
        "Less pronounced jaw and shorter muzzle",
        "Block-shaped head"
    ],
    "wheaten terrier": [
        "Usually, docked tail (though sometimes natural)",
        "Tail held up and usually docked (shortened) in some regions",
        "Short tail, often docked",
        "A double coat, which may be either wavy or curly",
        "Smaller and leaner body structure",
        "Often a natural tail that is curled over the back",
        "Energetic and alert posture",
        "fuller, bushier tail",
        "Rectangular body shape",
        "overall sturdier build",
        "Lack of undercoat (single coat, unlike the double coat of Havanese)",
        "pendant ears that hang downward",
        "Medium-sized body",
        "Light wheaten or beige color",
        "Medium size",
        "larger size",
        "Square build, relatively compact body",
        "Tendencies of being smaller and more compact",
        "Less feathering on legs and tail compared to an English Setter",
        "medium to large size with a sturdy build"
    ],
    "yorkshire terrier": [
        "Typically hair coloring that includes shades of black, tan, and blue",
        "Often has a topknot or hair bow",
        "Silky, long coat",
        "often has a topknot or hair bow",
        "Distinct topknot often tied with a bow",
        "Long, silky coat",
        "Silky, shiny coat",
        "Long, silky, straight coat",
        "Long, silky hair",
        "Typically dark steel blue and tan colors",
        "Long, flowing hair on the top of its head, often tied in a decorative topknot",
        "Tail often carried high and may be docked",
        "silky, long hair",
        "Distinctive \"topknot\" hair on the head",
        "Round, dark eyes",
        "Small size",
        "Silky, long, straight fur",
        "Sturdier build with a square profile",
        "Tail is usually docked and held erect",
        "tan and blue or black coat"
    ]
}