{
    "Abyssinian": [
        "Short coat with a silky texture",
        "short, fine coat with a distinct \"ticked\" pattern",
        "Dark spots or rosettes over a lighter background",
        "short, dense coat with a \"ticked\" tabby pattern",
        "short, fine coat",
        "Solid blue-gray coat",
        "Sleek, short coat with a ticked pattern",
        "Ticked tabby pattern",
        "Short, ticked coat",
        "Lithe, agile appearance",
        "Green eyes",
        "Short, sleek fur",
        "Typically no distinctive facial mask markings",
        "overall warm, ruddy coloration with no distinct points on the face, ears, paws, or tail",
        "Ticked coat pattern (fur with bands of different colors on each hair)",
        "large pointed ears",
        "Overall well-groomed appearance",
        "Reddish-brown or ruddy coat color",
        "ruddy or warm reddish-brown coloration",
        "Rosetted or marbled coat patterns"
    ],
    "Bengal": [
        "Overall golden or brownish hue",
        "Wrinkled appearance",
        "Rosetted spots or horizontal stripes",
        "High-energy, active posture",
        "Markings on the legs and tail, including spots or bands",
        "Spotted or rosetted coat patterns",
        "Lighter eye color, often green or gold",
        "muscular body and slender build",
        "distinctively patterned coat with varying colors ",
        "Larger size compared to a chihuahua",
        "Rosetted or marbled coat patterns",
        "Strong, muscular body",
        "Sleek and lean body build",
        "short, sleek coat with a distinctive spotted or marbled pattern",
        "a cobby, stocky body",
        "Sleek, muscular body",
        "Pointed ears with rounded tips",
        "Usually a more elongated body shape",
        "Prominent cheekbones",
        "Pointed ears"
    ],
    "Birman": [
        "Birmans have distinctive blue eyes, while boxers have dark brown eyes.",
        "A Birman has a long, silky coat, whereas a boxer has short, smooth fur.",
        "A Birman generally displays a calm, serene demeanor, while a boxer often has a more energetic and playful appearance.",
        "Birmans typically have a pointed color pattern, with darker fur on the face, ears, paws, and tail, unlike boxers who usually have a solid or brindle coat with possible white markings.",
        "A Birman is a cat with a slender, graceful body, compared to a boxer's muscular, robust canine build.",
        "Birmans have a bushy tail, whereas boxers have a shorter, more straight tail.",
        "lack of the double coat seen in Keeshonds",
        "Absence of a distinct, pushed-in nose typically seen in Japanese Chins",
        "typically larger size compared to a Pomeranian",
        "Stockier and more muscular build compared to the Ragdoll",
        "Color point pattern with darker extremities (face, ears, paws, tail)",
        "Color-point coat pattern (darker face, ears, paws, and tail)",
        "Defined color points on ears, face, paws, and tail",
        "pointed color pattern (darker ears, face, paws, and tail)",
        "More muscular and stocky body build compared to the slender Siamese",
        "Medium-length, slightly wavy coat",
        "Pointed coat pattern (darker ears, face, paws, and tail with lighter body)",
        "Coat color and patterns (Birmans usually have color points on their ears, face, paws, and tail)",
        "Silkier, lighter coat texture",
        "Stocky and muscular body"
    ],
    "Bombay": [
        "Light-colored body with darker points (ears, face, paws, tail)",
        "Medium-sized, rounded ears",
        "Short, close-lying fur",
        "Black nose and paw pads",
        "paw structure",
        "rounded head with a short muzzle",
        "Short, smooth fur",
        "Whiskers (visible due to fur)",
        "tail shape",
        "short, flat nose",
        "short, close-lying, and shiny fur",
        "Lack of a pronounced ruff around the neck (Persians often have a fluffy, ruffled neck)",
        "Rounded head and short muzzle (Bombay)",
        "fur texture",
        "Long, thin tail",
        "Absence of a fluffy tail and mane",
        "Long, dense double coat (Newfoundland)",
        "Large, almond-shaped blue eyes",
        "Large, pointed ears",
        "Short, sleek black fur"
    ],
    "British Shorthair": [
        "Typically medium to large size but smaller compared to an American Bulldog",
        "**German Shorthaired Pointer**:",
        "Dog-like body structure",
        "Solid coat colors (commonly blue-gray)",
        "Typically solid coat colors or a classic tabby pattern",
        "Stocky build",
        "Tail short and thick but tapering at the end",
        "Short, dense coat with a plush feel",
        "Solid or classic tabby color varieties, often in blues, but many colors are possible",
        "Fox-like face",
        "Short nose",
        "Typically a lack of distinct color points (differentiating from the Birman's color-point pattern)",
        "Shorter legs",
        "Ears are broad at the base and slightly rounded at the tips",
        "Ears set wide apart and slightly rounded at the tips",
        "Short, stocky body",
        "Short legs",
        "Longer legs and more pronounced muscles",
        "Cat-like features (as opposed to a dog's snout and ears)",
        "Whisker pads prominent and well-defined"
    ],
    "Egyptian Mau": [
        "Slender, agile frame",
        "Visible skin flap extending from the flank to the back knee (allows for greater agility)",
        "Loose skin flap extending from the flank to the hind leg (provides greater agility)",
        "Banding (striping) on the legs and tail",
        "Overall cat-like features versus dog-like features",
        "Short hair length",
        "Slender, agile body",
        "Solid or classic tabby coat patterns rather than spotted",
        "Distinctive spotted coat pattern",
        "Round, broad-set eyes (often copper or blue)",
        "Spotted coat pattern",
        "Smaller, cat-like body",
        "spotted coat",
        "Spotted coat",
        "Long, slender body",
        "Long, lean legs",
        "Longer tail relative to body size",
        "Longer hind legs compared to the front legs",
        "Generally lighter coat color with silver, bronze, or smoke tones",
        "Banding on legs and tail"
    ],
    "Maine Coon": [
        "Generally breed comes in a variety of colors and patterns, unlike Birman which is usually color-pointed with white \"gloves\" on the paws.",
        "Large, expressive eyes",
        "Sleek, elongated body",
        "prominent ruff",
        "Pointed ears with tufts of fur at the tips",
        "rectangular body shape",
        "Shaggy, water-repellent fur",
        "prominent ruff around the neck (especially in males)",
        "Wide, expressive eyes",
        "Fur patterns and texture (Maine Coons have long, fluffy fur)",
        "Full, fluffy coat",
        "feline face structure",
        "Whisker pads (distinctive in cats, less so in dogs)",
        "Whiskers (Maine Coons have long, prominent whiskers)",
        "Feline facial structure",
        "feline facial structure",
        "Gentle and friendly expression",
        "Eye shape (cats have more almond-shaped eyes compared to dogs)",
        "High cheekbones and a square muzzle"
    ],
    "Persian": [
        "Pointed ears",
        "Small, rounded ears",
        "small, rounded ears",
        "Small, rounded ears that are set wide apart",
        "Prominent, large round eyes",
        "dense, plush appearance",
        "Large, round eyes",
        "large, round eyes",
        "Calm and relaxed demeanor in appearance",
        "prominent, round eyes",
        "rounded ears",
        "Round, large eyes",
        "calm and laid-back demeanor",
        "short muzzle",
        "Compact, cobby body shape",
        "Stocky build with short legs",
        "stocky and cobby body type",
        "Cat-like paw structure",
        "Short, flat nose",
        "round eyes"
    ],
    "Ragdoll": [
        "distinctive color patterns such as colorpoints",
        "muscular, stocky build",
        "Smaller size and build compared to a dog",
        "Body structure: Ragdolls have a more muscular and semi-longer body, whereas Bombays have a more compact and muscular build.",
        "Larger size and muscular build",
        "Size: Ragdolls are much smaller compared to the large Newfoundland dogs.",
        "prominent ruff around the neck",
        "Color point contrast can be more pronounced in some Ragdoll varieties",
        "tendency to lie limp when picked up",
        "No snout (flat-faced)",
        "A distinct \"V\" shape marking on the forehead (common in Ragdolls)",
        "Point coloration with generally lighter body and darker extremities",
        "typically cropped or naturally floppy ears",
        "Coat color: Ragdolls typically have lighter, color-pointed coats with shades of cream, lilac, blue, or chocolate, whereas Bombays have solid black coats.",
        "Size: Ragdolls are generally larger and more robust compared to the smaller, more compact Bombay.",
        "broad muzzle",
        "square-shaped head",
        "Facial structure: Ragdolls have a more wedge-shaped face with a soft expression, while Bombays have a more rounded face with a shorter muzzle.",
        "Body shape: Ragdolls have a long, lean, and flexible body, contrasting with the Newfoundland’s broad, bulky, and muscular build.",
        "V-shaped marking on face"
    ],
    "Russian Blue": [
        "Distinctive patterned coat markings",
        "Silvery-blue, short, dense coat",
        "Short, dense bluish-gray fur",
        "Grey/blue fur color",
        "A stout, compact body",
        "Short, dense, bluish-gray fur",
        "Short, dense, and plush bluish-gray coat",
        "Solid blue-grey coat",
        "Short, dense, and plush blue-gray coat",
        "Relatively reserved or shy demeanor in photos",
        "Semi-long, soft fur usually with a pointed color pattern (darker on the ears, face, paws, and tail)",
        "Dense, short, blue-gray coat",
        "Short, dense, blue-gray coat",
        "Short, sleek coat",
        "Soft, dense grey fur",
        "Short, smooth fur usually in fawn or black color",
        "Pointed coat pattern (darker colors on ears, face, paws, and tail)",
        "Tendency to be smaller in size",
        "Generally more athletic and active appearance",
        "Sleek and slender body"
    ],
    "Siamese": [
        "Light-colored body with darker points (ears, face, paws, tail)",
        "Prominent, triangular-shaped head with large ears",
        "Light-colored body with darker points (ears, face, paws, and tail)",
        "pointed color pattern (darker ears, face, paws, and tail)",
        "erect, large ears",
        "triangular head with large ears",
        "Prominent, large ears",
        "large, pointed ears",
        "Large, pointed ears",
        "triangular-shaped head",
        "wedge-shaped head",
        "darker points on the ears, face, paws, and tail",
        "darker points on ears, face, paws, and tail",
        "triangular head shape",
        "pointed coloration (darker extremities)",
        "slender and elongated body",
        "slender, elongated body",
        "slender body",
        "Color point pattern: Both breeds can have color points, but Siamese cats generally have a more defined pattern with darker colors on the ears, face, paws, and tail.",
        "Triangular face shape"
    ],
    "Sphynx": [
        "Skin color may be pink or have spots, whereas a Russian Blue has a solid blue-gray coat",
        "Lack of a dense double coat, which is characteristic of the Russian Blue",
        "Elongated, slender body",
        "Slender, elongated body",
        "Long, tapered tail",
        "Absence of a bushy tail",
        "Slender, lean body",
        "Hairlessness or very fine, short coat",
        "Long, whip-like tail",
        "Large, pointed ears",
        "Prominent, large ears",
        "Slender, muscular body",
        "Slender build: Sphynx cats have a lean, muscular frame, unlike the stockier build of pugs.",
        "Slender, muscular build"
    ],
    "american bulldog": [
        "shorter ears that may be cropped or naturally folded",
        "Canine appearance",
        "Less wrinkled face compared to a Pug",
        "Broader head",
        "wider, more prominent head",
        "Broad head",
        "Typically larger in size",
        "Shorter coat, typically white or with patches",
        "rounded, broad head",
        "Ear shape may vary, often natural and not cropped ",
        "longer legs",
        "Longer legs",
        "Shorter, wider muzzle",
        "Typically a larger size",
        "Longer snout",
        "short muzzle",
        "short and smooth coat",
        "Distinctive broad head with a pronounced stop (the area between the eyes)",
        "Short, smooth coat",
        "shorter muzzle"
    ],
    "american pit bull terrier": [
        "Thick, fluffy, white coat",
        "Less pronounced snout length compared to beagles",
        "Bushy tail that curls over the back",
        "Stockier stature",
        "Slender, elegant build",
        "Wider, more blocky head",
        "Cropped or natural ears that are not as floppy as a pug's",
        "Erect or semi-prick ears",
        "Shorter and smoother coat",
        "Longer snout and well-defined jawline",
        "Non-curled tail",
        "shorter snout",
        "Different head shape, with a less pronounced underbite",
        "Leaner, more athletic build",
        "Noticeable jaw strength",
        "shorter coat",
        "pointed ears (often cropped)",
        "Short coat without the double layer",
        "Short, smooth coat",
        "Generally more energetic and alert demeanor"
    ],
    "basset hound": [
        "Speckled or \"belton\" coat pattern",
        "Leaner, more elongated body compared to the boxer's muscular, stocky build",
        "White and brown or tri-color coat pattern",
        "Longer legs and taller stature",
        "Long body in proportion to height",
        "Tri-color coat patterns often with large patches of white, black, and brown",
        "elongated body",
        "Long body",
        "Short, stocky legs",
        "tricolor fur pattern (usually black, white, and brown)",
        "Tricolor or bicolor coat, often with a dominant presence of white, brown, and black",
        "Short legs and elongated body",
        "Shorter, more compact body",
        "Generally heavier and more compact build",
        "Medium to long coat with feathering",
        "Tricolor or bicolor coat, often with a combination of browns, black, and white",
        "Shorter coat length",
        "Smooth coat with tricolor (black, white, and brown) or bicolor patterns",
        "Typically longer, more curved tail",
        "Low-slung, elongated body"
    ],
    "beagle": [
        "Long, fluffy coat",
        "Large, sturdy body",
        "Smaller size and shorter build",
        "Outdoor or active setting (common for dogs)",
        "tri-color coat (white, black, and brown)",
        "Distinct hound-like appearance",
        "sturdier build",
        "Short, square muzzel",
        "Short, smooth coat",
        "Short and smooth fur",
        "smaller stature",
        "Distinctive white-tipped tail",
        "short, smooth fur",
        "Medium-sized body compared to the smaller, stockier body of a pug"
    ],
    "boxer": [
        "Docked tail (in some regions)",
        "larger size",
        "a smaller, more compact body",
        "Sturdy, medium-sized body",
        "docked tail (often seen in boxers)",
        "tricolored coat (usually black, white, and brown)",
        "Medium size ",
        "docked tail (in many cases)",
        "typically docked tail (though not always)",
        "ears that can be cropped or left natural (cropped ears are pointed and stand up)",
        "Proportionately longer legs",
        "Wide, rounded body",
        "Narrower and longer muzzle",
        "Upright ears (sometimes cropped)",
        "Tapered, docked tail (though it can vary)",
        "Docked tail (common in boxers)",
        "cropped ears (sometimes seen in boxers)",
        "docked tail",
        "Cropped ears (though may also be seen with natural ears)",
        "high-set ears, often cropped"
    ],
    "chihuahua": [
        "Short, smooth coat (though some chihuahuas have long hair, it's typically finer)",
        "Short, smooth coat (although some Chihuahuas have long hair)",
        "Less fluffy tail (compared to the pomeranian's bushy tail)",
        "Smooth or long fur coat (different from the typically sleek coat of a Siamese cat)",
        "short or long coat, often smooth",
        "smooth or long coat",
        "tendency to appear \"shivery\" or delicate",
        "Typically lighter weight and more fragile appearance",
        "lighter overall build",
        "short coat (though they can have long coats too)",
        "Proportionally larger head compared to body",
        "short, pointed muzzle",
        "Pointed muzzle",
        "Collar and leash (if visible)",
        "Tail usually carried high",
        "Short coat",
        "Thin, short or smooth coat",
        "more prominent, defined facial features",
        "wide variety of coat colors, often including solid colors",
        "Longer snout"
    ],
    "english cocker spaniel": [
        "Solid color or parti-color coat patterns, often with roan markings",
        "generally solid coat colors or roan patterns",
        "Stocky, compact build",
        "Smaller size and more compact build",
        "More varied coat colors and patterns",
        "Dense, medium-length fur",
        "Longer, wavy or curly coat",
        "Leaner and more athletic build",
        "Longer, wavy or curly fur",
        "Silky, medium to long fur",
        "Short, smooth coat",
        "Compact, athletic build",
        "Medium-sized build",
        "Longer, more flowing fur",
        "Athletic build",
        "Long, wavy fur",
        "Slender, athletic build",
        "fuller, denser coat",
        "Larger size",
        "Tail typically carried level with back or slightly higher"
    ],
    "english setter": [
        "Overall body structure: English Setters have a more slender, athletic build, whereas Leonbergers are larger and more robust with a powerful build.",
        "Overall build: English Setters exhibit a leaner, more athletic build compared to the robust, muscular build of Saint Bernards.",
        "Muzzle: English Setters have a more refined, narrow muzzle, while Leonbergers have a broader and more robust muzzle.",
        "Coat pattern: English Setters usually have a speckled or \"ticked\" coat pattern, while Leonbergers have a solid or slightly shaded coat.",
        "Ear shape and position: English Setters have medium-length, drooping ears that are set lower on the head, whereas Leonbergers have medium-length, triangular ears set higher.",
        "Coat: English Setters often have long, silky coats with feathered ears, legs, and tail, while Saint Bernards have dense, thick coats.",
        "Large and robust build",
        "Medium to large body size typical of a setter",
        "medium to large size",
        "Medium-sized build",
        "Body build: English Setters have a more slender and athletic build, whereas English Cocker Spaniels appear more compact and robust.",
        "Thick, double coat primarily white in color, sometimes with gray, badger, reddish-brown, or tan markings",
        "Size: English Setters are typically larger than English Cocker Spaniels.",
        "longer coat",
        "Head and facial structure: English Setters have a more refined and elongated head structure, while Saint Bernards have a broader, more massive head with a pronounced muzzle.",
        "longer, more athletic build",
        "Ears: English Setters have higher set and slightly shorter ears compared to the lower set, longer, and more feathered ears of English Cocker Spaniels.",
        "Leaner and taller body structure",
        "leaner body",
        "Size: English Setters are generally smaller and lighter compared to the much larger Saint Bernards."
    ],
    "german shorthaired": [
        "**British Shorthair**:",
        "Presence of a dog in the photo (German shorthaired is a dog breed, while Russian Blue is a cat breed)",
        "**Long tail, typically not docked**",
        "Docked tail",
        "Docked tail (though not in all cases)",
        "**Short, dense fur with a distinctive liver (brown) and white coat pattern**",
        "Typically has a docked tail (though this can vary)",
        "Tails are typically docked but are medium in length, whereas Miniature Pinschers often have very short, docked tails",
        "Long, straight tail",
        "Generally taller and leaner body",
        "Long, slender legs",
        "Tail: German Shorthaired Pointers often have a docked tail that is medium in length and carried horizontally, while English Cocker Spaniels have a thicker, feathered tail that is typically of medium length.",
        "Shorter tail, often docked",
        "Lean, elongated body",
        "Short tail, docked in some regions but naturally medium in length",
        "Cropped or naturally short tail",
        "**Slender, muscular build**",
        "Upright and alert ear positioning",
        "**Eyes that can be of various colors but are often large and almond-shaped**",
        "**Large, bat-like ears**"
    ],
    "great pyrenees": [
        "Dark eyes with almond shape",
        "Less defined musculature compared to a pit bull",
        "Erect ears that can be rounded at the tips or slightly folded",
        "Solid or mostly white coloring, occasionally with badger or tan markings",
        "leveled topline",
        "Predominantly white fur, potentially with patches of yellow, badger, or gray",
        "Broad head with a relatively flat skull",
        "Large size",
        "longer snout",
        "Predominantly white coat (slight other coloration possible but rare)",
        "smaller, more angular head",
        "More slender and graceful build",
        "Droopy ears",
        "Larger size",
        "predominantly white fur, sometimes with gray or tan markings",
        "Medium to large size",
        "Solid white coat (though some may have hints of grey or tan)",
        "slimmer build",
        "Dewclaws on the hind legs (double in some cases)",
        "Broad, rounded face with a slightly pointy chin"
    ],
    "havanese": [
        "Sturdier and slightly larger build",
        "lacks the long ears and droopy appearance of a basset hound",
        "Sturdier build",
        "Longer, wavy or curly coat",
        "Compact and sturdy build",
        "Tightly curled tail that often arches over the back",
        "Larger size",
        "Longer muzzle",
        "Long, silky coat",
        "long, silky coat",
        "large, muscular body",
        "Less pronounced drooping ears compared to the English Cocker Spaniel",
        "Smaller and more delicate build",
        "Tail often docked (in regions where this practice is legal)",
        "Broader head with a shorter muzzle",
        "Sleek, elongated head with a pointed muzzle",
        "curly or wavy coat",
        "Longer, silky hair",
        "Distinctive tail curled over the back",
        "Tail curled over the back, covered in long hair"
    ],
    "japanese chin": [
        "Proportionally longer and denser fur on the tail",
        "Smaller and finer-boned body structure compared to the more robust and fluffy appearance of a Pomeranian",
        "Long, silky fur",
        "Prominent, large, round eyes",
        "Large, round eyes",
        "large, round eyes",
        "Long, flowing fur around the face and neck",
        "Long, flowing, and silky coat",
        "Long, silky fur primarily around the body, chest, and tail",
        "Long, flowing fur particularly on ears and tail",
        "distinctive \"mane\" of longer fur around the neck and shoulders",
        "Often a lively, alert expression",
        "distinctive \"V\" shape white blaze on the face",
        "Slightly larger, more rounded head in proportion to body",
        "Feathered tail that curls over the back",
        "Heavier feathering on ears and tail",
        "Longer, silky coat that often looks more voluminous ",
        "Feathered tail that arches over the back",
        "short, upturned nose",
        "Large, expressive eyes"
    ],
    "keeshond": [
        "A keeshond has a fox-like face with a dark muzzle; a Ragdoll has a more rounded face.",
        "typically gray, black, and cream coloration",
        "Grey, black, and cream coloration",
        "Darker coloration, typically a mix of gray, black, and cream",
        "Black and white or red and white fur colors",
        "Dense, double coat with a plush, mane-like ruff",
        "Compact and square-shaped body",
        "Compact body structure",
        "Gray, black, and cream fur coloration",
        "Grey, black, and cream fur colors",
        "Spitz-like appearance with a curled tail",
        "Small size",
        "Dog-like appearance",
        "Broader head and muzzle",
        "Coat color: Keeshonds have a distinctive grey, black, and cream-colored coat, whereas Samoyeds are typically pure white.",
        "Typically grey, black, and cream-colored fur",
        "compact and smaller body size",
        "Compact and sturdy body",
        "Fox-like face",
        "fox-like face"
    ],
    "leonberger": [
        "Droopy, triangular ears",
        "face: black mask on the face",
        "Brown or black coloration with a characteristic black mask over the face",
        "Double coat with a longer, shaggier outer coat",
        "Rectangular body shape",
        "dark mask on a lighter-colored face",
        "color: usually golden to reddish-brown",
        "face shape (Leonbergers have a more elongated face)",
        "coloration (Leonbergers usually have a black mask and a golden-brown coat)",
        "Black mask around the face",
        "Black mask on the face",
        "coat: thicker, longer, and often darker",
        "Longer snout",
        "Darker fur (typically a mix of yellow, red, brown, and black)",
        "Reddish-brown or golden-yellow fur color",
        "Canine body structure"
    ],
    "miniature pinscher": [
        "Proportionally longer legs compared to a cat",
        "Red, sesame, black and tan, or cream-colored coats with distinct Urajiro (white to cream markings).",
        "overall size (typically larger than a Sphynx cat)",
        "fur coat",
        "paws with claws",
        "Sleek, muscular build",
        "Curled tail",
        "Tail that may be docked",
        "Docked or naturally short tail (often erect)"
    ],
    "newfoundland": [
        "Overall dog-like appearance with a muscular build, contrasting a Persian cat's smaller, more delicate frame",
        "Droopy jowls and facial expression compared to a cat's more defined features",
        "Similar appearance to a miniature black panther",
        "Large size, generally much larger than any cat",
        "Large, bushy tail",
        "Webbed feet (not easily visible, but can be a distinguishing feature)",
        "Large size and robust build",
        "Sleek, short, black coat that is often described as \"patent leather\"",
        "Proportionally longer and broader body",
        "Larger and more robust frame",
        "Large size",
        "Large, muscular body",
        "Large brown or black color palette",
        "Copper or gold eyes that are strikingly large and round",
        "Smooth, glossy fur",
        "Broad head and strong neck",
        "larger size",
        "Large, robust body",
        "Broad head with a distinct stop (the point where the forehead meets the muzzle)",
        "Wide, webbed feet"
    ],
    "pomeranian": [
        "Different color variations (e.g., oranges, creams, and blacks compared to Samoyed's typically white coat)",
        "dense, fluffy coat",
        "shorter legs relative to body size",
        "fluffy, dense coat",
        "Fluffy, dense coat",
        "Generally more energetic and lively posture compared to a typically calmer Persian cat",
        "Compact, sturdy body",
        "absence of feline features (e.g., whiskers, cat-like eyes)",
        "thicker body build",
        "Variety of coat colors, often solid or with distinct patterning",
        "plume-like tail that arches over the back",
        "typically a canine collar",
        "Longer snout",
        "Typically lighter colors (such as orange, cream, or white)",
        "Smaller, more delicate frame",
        "shorter snout",
        "Shorter snout",
        "dense double coat",
        "Typically a plume-like tail that curls over the back",
        "often orange, cream, or tan fur"
    ],
    "pug": [
        "short and stocky build",
        "a short, curly tail",
        "Curly tail",
        "Stocky body",
        "short, smooth coat",
        "Smooth coat",
        "short, smooth fur",
        "Short coat",
        "short fur",
        "Smaller stature",
        "Smooth, fine coat",
        "Typically seen with a dog collar or leash",
        "Stocky, muscular body",
        "Fawn or black coat color"
    ],
    "saint bernard": [
        "Tail that is thick at the base and usually carried low",
        "Stockier build compared to the sleeker samoyed",
        "Bushy tail, usually carried low or level with the back",
        "distinct white markings on chest and face combined with a brown, black, or brindle-colored coat",
        "Short, dense coat",
        "Broad head",
        "short or long coat but typically with distinct patches of color",
        "Long, bushy tail",
        "more narrow muzzle compared to the broader snout of a Newfoundland",
        "relatively thin, long tail",
        "thick, dense coat",
        "Large size",
        "Long, thick fur, often with black, white, and brown markings",
        "Broad head with a pronounced stop (the transition from the skull to the muzzle)",
        "broad, squared muzzle",
        "Distinctive white and brown (or reddish-brown) coat",
        "Tendency to have a rescue barrel collar",
        "Broad, wide head",
        "Tri-color coat (typically white with brown and black markings)",
        "Ears that are set high and hang close to the head"
    ],
    "samoyed": [
        "More compact build",
        "pointed ears",
        "Presence of a collar or leash (indicative of a dog)",
        "Erect, triangular ears",
        "Elegant, slender build",
        "Upright, less triangular ears",
        "Pointed, erect ears",
        "Upright, triangular ears",
        "wedge-shaped head",
        "Lack of dark facial markings"
    ],
    "scottish terrier": [
        "Distinctive long beard and eyebrows",
        "Bristly eyebrows",
        "distinctive beard and eyebrows",
        "Distinctive beard and eyebrows",
        "Bushy eyebrows",
        "distinct beard and eyebrows",
        "a prominent beard and eyebrows",
        "Prominent eyebrows and beard",
        "Wiry, coarse coat",
        "a rectangular-shaped, elongated body",
        "longer, wiry fur",
        "Wiry, dense coat",
        "Elongated body shape",
        "Pointed ears that stand erect",
        "a docked or naturally short tail",
        "Distinctive \"whiskered\" face look",
        "erect, pointed ears ",
        "Black, wheaten, or brindle coloration",
        "Rectangular body shape"
    ],
    "shiba inu": [
        "presence of a snout and whiskers (Sphynx cats have a more defined and slender facial structure)",
        "overall build (Shiba Inus are more robust compared to the slender physique of a Sphynx cat)",
        "Erect, triangular ears",
        "erect, triangular ears",
        "Pointed ears",
        "upright, triangular ears",
        "thick double coat with a soft undercoat",
        "broader and sturdier build",
        "Upright triangular ears",
        "Smaller, more compact body structure",
        "shorter, denser coat",
        "face shape (Shiba Inu has a fox-like face with triangular eyes)",
        "thick, double-layered coat",
        "typically exhibit a fox-like appearance",
        "ears (Shiba Inu has small, erect, triangular ears)",
        "Double coat (thick and plush undercoat with stiff outer coat)",
        "Thick double coat",
        "thick double coat",
        "upright ears",
        "curled tail that rests over the back"
    ],
    "staffordshire bull terrier": [
        "Tail is relatively thick and tapers to a point, carried low but not docked",
        "shorter, wider muzzle",
        "Broad, shorter muzzle",
        "Broad head with a short muzzle",
        "Square-shaped build",
        "Often a broader stance",
        "Wide, short head",
        "tapered tail (pugs usually have a curled tail)",
        "Medium size (typically 13-16 inches in height)",
        "Typically smooth and short coat",
        "smaller size overall",
        "Typically has a smooth, short coat",
        "broad head",
        "Rounded, medium-sized ears that may partially or fully stand up",
        "Well-muscled and athletic appearance",
        "Brindle, black, blue, fawn, or red coat colors",
        "Short, smooth coat",
        "short, smooth coat",
        "broader, more pronounced head",
        "strong, athletic stance"
    ],
    "wheaten terrier": [
        "Usually, docked tail (though sometimes natural)",
        "Tail held up and usually docked (shortened) in some regions",
        "Short tail, often docked",
        "A double coat, which may be either wavy or curly",
        "Energetic and alert posture",
        "Lack of undercoat (single coat, unlike the double coat of Havanese)",
        "Less feathering on legs and tail compared to an English Setter",
        "Rectangular body shape",
        "overall sturdier build",
        "Smaller and leaner body structure",
        "Medium size",
        "medium to large size with a sturdy build",
        "Light wheaten or beige color",
        "Often a natural tail that is curled over the back",
        "More elongated muzzle",
        "fuller, bushier tail",
        "Square build, relatively compact body",
        "Medium-sized body",
        "Rounded ears that typically flop down",
        "Soft, silky coat with a wheaten (light beige) color"
    ],
    "yorkshire terrier": [
        "Often has a topknot or hair bow",
        "Typically hair coloring that includes shades of black, tan, and blue",
        "often has a topknot or hair bow",
        "Small size",
        "Tail often carried high and may be docked",
        "Long, silky hair",
        "Typically dark steel blue and tan colors",
        "Sturdier build with a square profile",
        "Silky, long coat",
        "silky, long hair",
        "Small, compact size",
        "Distinct topknot often tied with a bow",
        "Long, silky coat",
        "Small, delicate frame",
        "Smaller size",
        "Silky, shiny coat",
        "Small, slender body frame",
        "Longer muzzle and facial hair",
        "Smaller size, usually weighing between 4 to 7 pounds",
        "Smaller, more delicate frame"
    ]
}