{
    "Abyssinian": [
        "Short coat with a silky texture",
        "short, fine coat with a distinct \"ticked\" pattern",
        "short, dense coat with a \"ticked\" tabby pattern",
        "Solid blue-gray coat",
        "short, fine coat",
        "Dark spots or rosettes over a lighter background",
        "Sleek, short coat with a ticked pattern",
        "Short, sleek fur",
        "Lithe, agile appearance",
        "Short, ticked coat",
        "Rosetted or marbled coat patterns",
        "overall warm, ruddy coloration with no distinct points on the face, ears, paws, or tail",
        "Ticked tabby pattern",
        "large pointed ears",
        "Ticked coat pattern (fur with bands of different colors on each hair)",
        "Reddish-brown or ruddy coat color",
        "Glittery, reflective fur",
        "Large, pointed ears",
        "large, pointed ears",
        "Overall well-groomed appearance"
    ],
    "Bengal": [
        "Overall golden or brownish hue",
        "Wrinkled appearance",
        "Rosetted spots or horizontal stripes",
        "Markings on the legs and tail, including spots or bands",
        "High-energy, active posture",
        "Larger size compared to a chihuahua",
        "Spotted or rosetted coat patterns",
        "distinctively patterned coat with varying colors ",
        "Rosetted or marbled coat patterns",
        "a cobby, stocky body",
        "smaller size compared to a dog",
        "muscular body and slender build",
        "Lighter eye color, often green or gold",
        "Horizontal striping on legs and tail",
        "Short, thick tail with a blunt tip",
        "short, sleek coat with a distinctive spotted or marbled pattern",
        "Strong, muscular body",
        "Pointed ears",
        "Usually a more elongated body shape",
        "Pointed ears with rounded tips"
    ],
    "Birman": [
        "Birmans have distinctive blue eyes, while boxers have dark brown eyes.",
        "A Birman has a long, silky coat, whereas a boxer has short, smooth fur.",
        "A Birman generally displays a calm, serene demeanor, while a boxer often has a more energetic and playful appearance.",
        "A Birman is a cat with a slender, graceful body, compared to a boxer's muscular, robust canine build.",
        "Birmans typically have a pointed color pattern, with darker fur on the face, ears, paws, and tail, unlike boxers who usually have a solid or brindle coat with possible white markings.",
        "Birmans have a bushy tail, whereas boxers have a shorter, more straight tail.",
        "lack of the double coat seen in Keeshonds",
        "Stockier and more muscular build compared to the Ragdoll",
        "typically larger size compared to a Pomeranian",
        "Absence of a distinct, pushed-in nose typically seen in Japanese Chins",
        "More muscular and stocky body build compared to the slender Siamese",
        "Color point pattern with darker extremities (face, ears, paws, tail)",
        "Stocky and muscular body",
        "pointed color pattern (darker ears, face, paws, and tail)",
        "Silkier, lighter coat texture",
        "Defined color points on ears, face, paws, and tail",
        "Color-point coat pattern (darker face, ears, paws, and tail)",
        "Medium-length, slightly wavy coat",
        "Coat color and patterns (Birmans usually have color points on their ears, face, paws, and tail)",
        "Pointed coat pattern (darker ears, face, paws, and tail with lighter body)"
    ],
    "Bombay": [
        "Light-colored body with darker points (ears, face, paws, tail)",
        "Medium-sized, rounded ears",
        "Short, close-lying fur",
        "Black nose and paw pads",
        "rounded head with a short muzzle",
        "paw structure",
        "short, flat nose",
        "Whiskers (visible due to fur)",
        "Rounded head and short muzzle (Bombay)",
        "Short, smooth fur",
        "Lack of a pronounced ruff around the neck (Persians often have a fluffy, ruffled neck)",
        "tail shape",
        "fur texture",
        "Large, almond-shaped blue eyes",
        "short, close-lying, and shiny fur",
        "Long, thin tail",
        "Rounded head with a shorter nose",
        "Absence of a fluffy tail and mane",
        "Long, dense double coat (Newfoundland)",
        "Large, pointed ears"
    ],
    "British Shorthair": [
        "**German Shorthaired Pointer**:",
        "Typically medium to large size but smaller compared to an American Bulldog",
        "Dog-like body structure",
        "Solid coat colors (commonly blue-gray)",
        "Typically solid coat colors or a classic tabby pattern",
        "Stocky build",
        "Solid or classic tabby color varieties, often in blues, but many colors are possible",
        "Short, dense coat with a plush feel",
        "Tail short and thick but tapering at the end",
        "Fox-like face",
        "Short nose",
        "Typically a lack of distinct color points (differentiating from the Birman's color-point pattern)",
        "Whisker pads prominent and well-defined",
        "Generally calm and reserved demeanor in photos",
        "Ears are broad at the base and slightly rounded at the tips",
        "Calm and reserved demeanor in appearance",
        "Ears set wide apart and slightly rounded at the tips",
        "Cat-like features (as opposed to a dog's snout and ears)",
        "Shorter legs",
        "Large, round eyes, often copper or gold in color"
    ],
    "Egyptian Mau": [
        "Overall cat-like features versus dog-like features",
        "Round, broad-set eyes (often copper or blue)",
        "Short hair length",
        "Large, pointed ears",
        "Loose skin flap extending from the flank to the hind leg (provides greater agility)",
        "Visible skin flap extending from the flank to the back knee (allows for greater agility)",
        "Large, almond-shaped green eyes",
        "Distinctive spotted coat pattern",
        "Slender, agile frame",
        "Solid or classic tabby coat patterns rather than spotted",
        "Banding (striping) on the legs and tail",
        "Ears are relatively large and pointed",
        "Generally lighter coat color with silver, bronze, or smoke tones",
        "Large ears set wide apart",
        "Distinctive \"M\" shape on the forehead",
        "Spotted coat",
        "spotted coat",
        "Spotted coat pattern",
        "Smaller, cat-like body",
        "Almond-shaped green eyes"
    ],
    "Maine Coon": [
        "Generally breed comes in a variety of colors and patterns, unlike Birman which is usually color-pointed with white \"gloves\" on the paws.",
        "Sleek, elongated body",
        "prominent ruff",
        "rectangular body shape",
        "Pointed ears with tufts of fur at the tips",
        "prominent ruff around the neck (especially in males)",
        "Whiskers (Maine Coons have long, prominent whiskers)",
        "Shaggy, water-repellent fur",
        "pointed ears with tufted tips",
        "Fur patterns and texture (Maine Coons have long, fluffy fur)",
        "Large, expressive eyes"
    ],
    "Persian": [
        "Pointed ears",
        "Small, rounded ears that are set wide apart",
        "Prominent, large round eyes",
        "Small, rounded ears",
        "small, rounded ears",
        "rounded ears",
        "dense, plush appearance",
        "large, round eyes",
        "Large, round eyes",
        "Round, large eyes",
        "prominent, round eyes",
        "Calm and relaxed demeanor in appearance",
        "short muzzle",
        "Short, flat nose",
        "calm and laid-back demeanor",
        "round eyes",
        "stocky and cobby body type",
        "Stocky build with short legs",
        "Cat-like paw structure",
        "Compact, cobby body shape"
    ],
    "Ragdoll": [
        "distinctive color patterns such as colorpoints",
        "muscular, stocky build",
        "Smaller size and build compared to a dog",
        "prominent ruff around the neck",
        "Body structure: Ragdolls have a more muscular and semi-longer body, whereas Bombays have a more compact and muscular build.",
        "Larger size and muscular build",
        "No snout (flat-faced)",
        "A distinct \"V\" shape marking on the forehead (common in Ragdolls)",
        "Size: Ragdolls are much smaller compared to the large Newfoundland dogs.",
        "tendency to lie limp when picked up",
        "Color point contrast can be more pronounced in some Ragdoll varieties",
        "typically cropped or naturally floppy ears",
        "V-shaped marking on face",
        "square-shaped head",
        "Point coloration with generally lighter body and darker extremities",
        "Coat color: Ragdolls typically have lighter, color-pointed coats with shades of cream, lilac, blue, or chocolate, whereas Bombays have solid black coats.",
        "Pointed ears",
        "pointed ears",
        "broad muzzle",
        "Size: Ragdolls are generally larger and more robust compared to the smaller, more compact Bombay."
    ],
    "Russian Blue": [
        "Distinctive patterned coat markings",
        "Grey/blue fur color",
        "Short, dense bluish-gray fur",
        "Short, dense, bluish-gray fur",
        "Short, smooth fur usually in fawn or black color",
        "Silvery-blue, short, dense coat",
        "Short, dense, and plush bluish-gray coat",
        "Semi-long, soft fur usually with a pointed color pattern (darker on the ears, face, paws, and tail)",
        "Solid blue-grey coat",
        "Short, dense, and plush blue-gray coat",
        "Relatively reserved or shy demeanor in photos",
        "Brown or amber eyes",
        "Dense, short, blue-gray coat",
        "Short, dense, blue-gray coat",
        "A stout, compact body",
        "Soft, dense grey fur",
        "Short, sleek coat",
        "Facial features typical of cats, such as a short nose and whisker pads",
        "Generally more athletic and active appearance",
        "Short, dense, and plush fur"
    ],
    "Siamese": [
        "Light-colored body with darker points (ears, face, paws, tail)",
        "pointed color pattern (darker ears, face, paws, and tail)",
        "Prominent, triangular-shaped head with large ears",
        "large, pointed ears",
        "Large, pointed ears",
        "Light-colored body with darker points (ears, face, paws, and tail)",
        "erect, large ears",
        "triangular head with large ears",
        "triangular-shaped head",
        "Prominent, large ears",
        "wedge-shaped head",
        "triangular head shape",
        "darker points on the ears, face, paws, and tail",
        "darker points on ears, face, paws, and tail",
        "slender body",
        "pointed coloration (darker extremities)",
        "slender and elongated body",
        "slender, elongated body",
        "Triangular face shape",
        "short coat "
    ],
    "Sphynx": [
        "Skin color may be pink or have spots, whereas a Russian Blue has a solid blue-gray coat",
        "Lack of a dense double coat, which is characteristic of the Russian Blue",
        "Elongated, slender body",
        "Hairlessness or very fine, short coat",
        "Slender build: Sphynx cats have a lean, muscular frame, unlike the stockier build of pugs.",
        "Absence of a bushy tail",
        "Long, tapered tail",
        "Slender, elongated body",
        "Slender, lean body",
        "Prominent, large ears",
        "Large, pointed ears"
    ],
    "american bulldog": [
        "shorter ears that may be cropped or naturally folded",
        "Canine appearance",
        "longer legs",
        "Longer legs",
        "Typically larger in size",
        "Typically a larger size",
        "Broader head",
        "Less wrinkled face compared to a Pug",
        "wider, more prominent head",
        "Shorter coat, typically white or with patches",
        "Broad head",
        "rounded, broad head",
        "Long and thin tail",
        "short and smooth coat",
        "Stocky legs",
        "Ear shape may vary, often natural and not cropped ",
        "Short, smooth coat",
        "generally larger size",
        "Shorter, wider muzzle",
        "Larger overall size"
    ],
    "american pit bull terrier": [
        "Thick, fluffy, white coat",
        "Less pronounced snout length compared to beagles",
        "Stockier stature",
        "Bushy tail that curls over the back",
        "Slender, elegant build",
        "Wider, more blocky head",
        "Shorter and smoother coat",
        "Cropped or natural ears that are not as floppy as a pug's",
        "Erect or semi-prick ears",
        "Non-curled tail",
        "Generally more energetic and alert demeanor",
        "shorter coat",
        "Short coat without the double layer",
        "Leaner, more athletic build",
        "Short, smooth coat"
    ],
    "basset hound": [
        "Speckled or \"belton\" coat pattern",
        "Leaner, more elongated body compared to the boxer's muscular, stocky build",
        "White and brown or tri-color coat pattern",
        "tricolor fur pattern (usually black, white, and brown)",
        "Tri-color coat patterns often with large patches of white, black, and brown",
        "Leaner, more athletic build",
        "Short, stocky legs",
        "Tricolor or bicolor coat, often with a combination of browns, black, and white",
        "Long body",
        "Shorter, more compact body",
        "elongated body",
        "Longer legs and taller stature",
        "Heavier, more substantial body",
        "Shorter coat length",
        "Typically longer, more curved tail",
        "long, droopy ears",
        "Long, droopy ears",
        "Higher-set, smaller ears",
        "Generally heavier and more compact build",
        "Smooth, short coat"
    ],
    "beagle": [
        "Long, fluffy coat",
        "Large, sturdy body",
        "tri-color coat (white, black, and brown)",
        "Medium-sized body compared to the smaller, stockier body of a pug",
        "Smaller size and shorter build",
        "Outdoor or active setting (common for dogs)",
        "Distinct hound-like appearance",
        "Distinctive white-tipped tail",
        "sturdier build",
        "Tricolor coat (typically white, brown, and black)",
        "Short, square muzzel",
        "smaller stature",
        "Tri-colored coat (typically black, white, and brown)",
        "Short and smooth fur",
        "Tri-colored fur (typically black, white, and brown)",
        "Short, smooth coat",
        "short, smooth fur",
        "Fox-like appearance",
        "Tail often has a white tip and is carried high",
        "shorter legs"
    ],
    "boxer": [
        "a smaller, more compact body",
        "Docked tail (in some regions)",
        "larger size",
        "Sturdy, medium-sized body",
        "typically docked tail (though not always)",
        "docked tail (often seen in boxers)",
        "Narrower and longer muzzle",
        "Wide, rounded body",
        "ears that can be cropped or left natural (cropped ears are pointed and stand up)",
        "Distinctive, square-shaped muzzle",
        "Medium size ",
        "docked tail (in many cases)",
        "square-shaped head",
        "Tapered, docked tail (though it can vary)",
        "tricolored coat (usually black, white, and brown)",
        "cropped ears (sometimes seen in boxers)",
        "Upright ears (sometimes cropped)",
        "Proportionately longer legs",
        "docked tail",
        "Generally short muzzle"
    ],
    "chihuahua": [
        "Short, smooth coat (though some chihuahuas have long hair, it's typically finer)",
        "Short, smooth coat (although some Chihuahuas have long hair)",
        "Less fluffy tail (compared to the pomeranian's bushy tail)",
        "Smooth or long fur coat (different from the typically sleek coat of a Siamese cat)",
        "short or long coat, often smooth",
        "tendency to appear \"shivery\" or delicate",
        "smooth or long coat",
        "short coat (though they can have long coats too)",
        "Typically lighter weight and more fragile appearance",
        "lighter overall build",
        "Proportionally larger head compared to body",
        "more prominent, defined facial features",
        "lightweight body (typically under 6 pounds)",
        "Pointed muzzle",
        "Absence of whiskers (or less pronounced compared to a cat)",
        "smaller overall size",
        "Short snout",
        "longer snout",
        "Longer snout",
        "Short coat"
    ],
    "english cocker spaniel": [
        "Solid color or parti-color coat patterns, often with roan markings",
        "generally solid coat colors or roan patterns",
        "Smaller size and more compact build",
        "Longer, wavy or curly coat",
        "Stocky, compact build",
        "More varied coat colors and patterns",
        "Longer, wavy or curly fur",
        "Dense, medium-length fur",
        "Leaner and more athletic build",
        "Short, smooth coat",
        "Compact, athletic build",
        "Medium-sized build",
        "Athletic build",
        "fuller, denser coat",
        "Longer, more flowing fur",
        "Silky, medium to long fur",
        "Generally larger size",
        "Larger size",
        "Slender, athletic build",
        "Typically more robust and muscular body structure "
    ],
    "english setter": [
        "Overall body structure: English Setters have a more slender, athletic build, whereas Leonbergers are larger and more robust with a powerful build.",
        "Muzzle: English Setters have a more refined, narrow muzzle, while Leonbergers have a broader and more robust muzzle.",
        "Ear shape and position: English Setters have medium-length, drooping ears that are set lower on the head, whereas Leonbergers have medium-length, triangular ears set higher.",
        "Overall build: English Setters exhibit a leaner, more athletic build compared to the robust, muscular build of Saint Bernards.",
        "Coat pattern: English Setters usually have a speckled or \"ticked\" coat pattern, while Leonbergers have a solid or slightly shaded coat.",
        "Coat: English Setters often have long, silky coats with feathered ears, legs, and tail, while Saint Bernards have dense, thick coats.",
        "Large and robust build",
        "Tail: English Setters have a feathered tail that is usually carried horizontally, while Leonbergers have a bushy tail that may be carried slightly higher but not curled over the back.",
        "Head and facial structure: English Setters have a more refined and elongated head structure, while Saint Bernards have a broader, more massive head with a pronounced muzzle.",
        "Body build: English Setters have a more slender and athletic build, whereas English Cocker Spaniels appear more compact and robust.",
        "Thick, double coat primarily white in color, sometimes with gray, badger, reddish-brown, or tan markings",
        "Medium to large body size typical of a setter",
        "Ears: English Setters have higher set and slightly shorter ears compared to the lower set, longer, and more feathered ears of English Cocker Spaniels.",
        "Size: English Setters are typically larger than English Cocker Spaniels.",
        "medium to large size",
        "Medium-sized build",
        "Leaner and taller body structure",
        "longer coat",
        "Muzzle: English Setters have a longer, more narrow muzzle, while English Cocker Spaniels have a shorter, broader muzzle.",
        "Tail: English Setters generally have a straight or slightly curved tail that is feathered, while English Cocker Spaniels often have a more docked or shorter tail."
    ],
    "german shorthaired": [
        "**British Shorthair**:",
        "Presence of a dog in the photo (German shorthaired is a dog breed, while Russian Blue is a cat breed)",
        "**Long tail, typically not docked**",
        "Docked tail",
        "Docked tail (though not in all cases)",
        "Typically has a docked tail (though this can vary)",
        "**Short, dense fur with a distinctive liver (brown) and white coat pattern**",
        "Tails are typically docked but are medium in length, whereas Miniature Pinschers often have very short, docked tails",
        "Long, straight tail",
        "Tail: German Shorthaired Pointers often have a docked tail that is medium in length and carried horizontally, while English Cocker Spaniels have a thicker, feathered tail that is typically of medium length.",
        "Shorter tail, often docked",
        "Long, slender legs",
        "Cropped or naturally short tail",
        "Short tail, docked in some regions but naturally medium in length",
        "Generally taller and leaner body",
        "**Large, bat-like ears**",
        "Lean, elongated body",
        "**Eyes that can be of various colors but are often large and almond-shaped**",
        "Short, dense coat with liver (dark brown) and white coloration",
        "**Slender, muscular build**"
    ],
    "great pyrenees": [
        "Less defined musculature compared to a pit bull",
        "Dark eyes with almond shape",
        "leveled topline",
        "Large size",
        "Erect ears that can be rounded at the tips or slightly folded",
        "Larger size",
        "More slender and graceful build",
        "Broad head with a relatively flat skull",
        "Predominantly white fur, potentially with patches of yellow, badger, or gray",
        "Solid or mostly white coloring, occasionally with badger or tan markings",
        "slimmer build",
        "Medium to large size",
        "Predominantly white coat (slight other coloration possible but rare)",
        "Droopy ears",
        "smaller, more angular head",
        "longer snout",
        "Solid white coat (though some may have hints of grey or tan)",
        "Dewclaws on the hind legs (double in some cases)",
        "predominantly white fur, sometimes with gray or tan markings",
        "larger overall size"
    ],
    "havanese": [
        "Sturdier and slightly larger build",
        "Longer, wavy or curly coat",
        "lacks the long ears and droopy appearance of a basset hound",
        "Sturdier build",
        "Compact and sturdy build",
        "large, muscular body",
        "curly or wavy coat",
        "long, silky coat",
        "Long, silky coat",
        "long, shaggy coat",
        "Less pronounced drooping ears compared to the English Cocker Spaniel",
        "Broad, sturdy build",
        "Larger size",
        "Tail carried over the back but less fluffy compared to a Pomeranian's",
        "Smaller and more delicate build",
        "Tightly curled tail that often arches over the back",
        "small, sturdy build",
        "Straight, silky coat",
        "long tail carried over the back",
        "Longer muzzle"
    ],
    "japanese chin": [
        "Proportionally longer and denser fur on the tail",
        "Smaller and finer-boned body structure compared to the more robust and fluffy appearance of a Pomeranian",
        "Long, silky fur",
        "Long, flowing, and silky coat",
        "Prominent, large, round eyes",
        "large, round eyes",
        "Large, round eyes",
        "Long, silky fur primarily around the body, chest, and tail",
        "Slightly larger, more rounded head in proportion to body",
        "Long, flowing fur around the face and neck",
        "distinctive \"mane\" of longer fur around the neck and shoulders",
        "Long, flowing fur particularly on ears and tail",
        "Longer, silky coat that often looks more voluminous ",
        "Feathered tail that curls over the back",
        "Feathered tail that arches over the back",
        "Often a lively, alert expression",
        "Plumed tail carried over the back",
        "Heavier feathering on ears and tail",
        "Feathered tail carried over the back",
        "distinctive \"V\" shape white blaze on the face"
    ],
    "keeshond": [
        "A keeshond has a fox-like face with a dark muzzle; a Ragdoll has a more rounded face.",
        "Dense, double coat with a plush, mane-like ruff",
        "Spitz-like appearance with a curled tail",
        "typically gray, black, and cream coloration",
        "Compact and square-shaped body",
        "Grey, black, and cream coloration",
        "Darker coloration, typically a mix of gray, black, and cream",
        "Compact body structure",
        "Black and white or red and white fur colors",
        "curled tail carried over the back",
        "Gray, black, and cream fur coloration",
        "Dog-like appearance",
        "Grey, black, and cream fur colors",
        "Small size",
        "A silky, straight coat",
        "Curled tail over the back",
        "wedge-shaped head",
        "Feathered tail that arches over the back",
        "Plumed tail that curls over the back",
        "compact and smaller body size"
    ],
    "leonberger": [
        "Droopy, triangular ears",
        "Rectangular body shape",
        "Double coat with a longer, shaggier outer coat",
        "Brown or black coloration with a characteristic black mask over the face",
        "face: black mask on the face",
        "color: usually golden to reddish-brown",
        "dark mask on a lighter-colored face",
        "face shape (Leonbergers have a more elongated face)",
        "coat: thicker, longer, and often darker",
        "coloration (Leonbergers usually have a black mask and a golden-brown coat)",
        "Coat color: Leonbergers typically have a golden to reddish-brown coat, while Saint Bernards often have a white coat with red, black, or brindle spots.",
        "Reddish-brown or golden-yellow fur color",
        "thick double coat",
        "Head shape: Leonbergers have a more rectangular head shape, while Saint Bernards have a broader, rounder head."
    ],
    "miniature pinscher": [
        "Proportionally longer legs compared to a cat",
        "Red, sesame, black and tan, or cream-colored coats with distinct Urajiro (white to cream markings).",
        "overall size (typically larger than a Sphynx cat)",
        "fur coat",
        "paws with claws",
        "Tail that may be docked",
        "alert and slightly intense expression",
        "Curled tail",
        "Sleek, muscular build",
        "docked tail (commonly seen in miniature pinschers)",
        "Docked or naturally short tail (often erect)",
        "short, sleek coat"
    ],
    "newfoundland": [
        "Overall dog-like appearance with a muscular build, contrasting a Persian cat's smaller, more delicate frame",
        "Droopy jowls and facial expression compared to a cat's more defined features",
        "Similar appearance to a miniature black panther",
        "Large size, generally much larger than any cat",
        "Webbed feet (not easily visible, but can be a distinguishing feature)",
        "Sleek, short, black coat that is often described as \"patent leather\"",
        "Large size and robust build",
        "Large, bushy tail",
        "Larger and more robust frame",
        "Copper or gold eyes that are strikingly large and round",
        "Proportionally longer and broader body",
        "Large size",
        "Large brown or black color palette",
        "Large, muscular body",
        "Smooth, glossy fur",
        "Generally dark-colored fur (often black or brown)",
        "Broad head with a distinct stop (the point where the forehead meets the muzzle)",
        "Large, robust body",
        "Broad head and strong neck",
        "Wide, webbed feet"
    ],
    "pomeranian": [
        "Longer snout",
        "dense, fluffy coat",
        "Shorter snout",
        "shorter snout",
        "shorter legs relative to body size",
        "Different color variations (e.g., oranges, creams, and blacks compared to Samoyed's typically white coat)",
        "thicker body build",
        "Compact, sturdy body",
        "Fluffy, dense coat",
        "fluffy, dense coat",
        "absence of feline features (e.g., whiskers, cat-like eyes)",
        "pointed snout",
        "typically a canine collar",
        "plume-like tail that arches over the back",
        "Generally more energetic and lively posture compared to a typically calmer Persian cat",
        "Smaller, more delicate frame",
        "dense double coat",
        "Smaller size",
        "smaller size",
        "Variety of coat colors, often solid or with distinct patterning"
    ],
    "pug": [
        "a short, curly tail",
        "short and stocky build",
        "Curly tail",
        "Stocky body",
        "Typically seen with a dog collar or leash",
        "short, smooth coat",
        "Short coat",
        "Smooth coat",
        "short, smooth fur",
        "Curved tail",
        "Stocky, muscular body",
        "short fur",
        "Smaller stature",
        "Typically fawn or black coat color ",
        "Fawn or black coat color",
        "Smooth, fine coat",
        "Short muzzle",
        "shorter muzzle"
    ],
    "saint bernard": [
        "Tail that is thick at the base and usually carried low",
        "Bushy tail, usually carried low or level with the back",
        "Stockier build compared to the sleeker samoyed",
        "Broad head",
        "Short, dense coat",
        "short or long coat but typically with distinct patches of color",
        "Large size",
        "relatively thin, long tail",
        "Long, bushy tail",
        "thick, dense coat",
        "distinct white markings on chest and face combined with a brown, black, or brindle-colored coat",
        "Distinctive white and brown (or reddish-brown) coat",
        "more narrow muzzle compared to the broader snout of a Newfoundland",
        "Long, thick fur, often with black, white, and brown markings",
        "Broad, wide head",
        "Tendency to have a rescue barrel collar",
        "distinct white and brown (or red) coat markings",
        "broad, squared muzzle",
        "Barrel-shaped body",
        "Broad head with a pronounced stop (the transition from the skull to the muzzle)"
    ],
    "samoyed": [
        "More compact build",
        "Presence of a collar or leash (indicative of a dog)",
        "Generally more rounded face",
        "pointed ears",
        "wedge-shaped head",
        "Distinctive \"Sammy smile\"",
        "Elegant, slender build",
        "a short, smooth coat",
        "Lack of dark facial markings",
        "overall fluffy and rounded appearance",
        "Upright, less triangular ears",
        "cropped or naturally floppy ears",
        "a muscular and stocky build",
        "less droopy face than a Saint Bernard",
        "Erect, triangular ears",
        "Pointed, erect ears",
        "smaller and more compact body",
        "Upright, triangular ears"
    ],
    "scottish terrier": [
        "Distinctive long beard and eyebrows",
        "Bristly eyebrows",
        "Bushy eyebrows",
        "distinctive beard and eyebrows",
        "Distinctive beard and eyebrows",
        "distinct beard and eyebrows",
        "a prominent beard and eyebrows",
        "Prominent eyebrows and beard",
        "a docked or naturally short tail",
        "a rectangular-shaped, elongated body",
        "Pointed ears that stand erect",
        "Elongated body shape",
        "erect, pointed ears ",
        "longer, wiry fur",
        "Wiry, coarse coat",
        "Distinctive \"whiskered\" face look",
        "pointed ears standing erect",
        "Wiry, dense coat",
        "Rectangular body shape",
        "Black, wheaten, or brindle coloration"
    ],
    "shiba inu": [
        "presence of a snout and whiskers (Sphynx cats have a more defined and slender facial structure)",
        "overall build (Shiba Inus are more robust compared to the slender physique of a Sphynx cat)",
        "Pointed ears",
        "Erect, triangular ears",
        "erect, triangular ears",
        "upright, triangular ears",
        "Upright triangular ears",
        "face shape (Shiba Inu has a fox-like face with triangular eyes)",
        "upright ears",
        "broader and sturdier build",
        "erect ears",
        "thick double coat with a soft undercoat",
        "ears (Shiba Inu has small, erect, triangular ears)",
        "typically exhibit a fox-like appearance",
        "shorter, denser coat",
        "Smaller, more compact body structure",
        "Distinctive markings (often with contrasting colors on the face, chest, and legs)",
        "aloof or independent expression",
        "Almond-shaped eyes",
        "Curled, bushy tail"
    ],
    "staffordshire bull terrier": [
        "Tail is relatively thick and tapers to a point, carried low but not docked",
        "Square-shaped build",
        "Often a broader stance",
        "Broad head with a short muzzle",
        "shorter, wider muzzle",
        "Wide, short head",
        "Broad, shorter muzzle",
        "smaller size overall",
        "Typically smooth and short coat",
        "Typically has a smooth, short coat",
        "Medium size (typically 13-16 inches in height)",
        "broad head",
        "broader, more pronounced head",
        "tapered tail (pugs usually have a curled tail)",
        "Rounded, medium-sized ears that may partially or fully stand up",
        "Well-muscled and athletic appearance",
        "short, smooth coat",
        "Short, smooth coat",
        "relatively longer muzzle (pugs have a short, flat muzzle)",
        "medium-sized, stocky body"
    ],
    "wheaten terrier": [
        "A double coat, which may be either wavy or curly",
        "Usually, docked tail (though sometimes natural)",
        "Tail held up and usually docked (shortened) in some regions",
        "Less feathering on legs and tail compared to an English Setter",
        "Short tail, often docked",
        "overall sturdier build",
        "medium to large size with a sturdy build",
        "Energetic and alert posture",
        "Smaller and leaner body structure",
        "Lack of undercoat (single coat, unlike the double coat of Havanese)",
        "Square build, relatively compact body",
        "long, wavy coat",
        "Medium size",
        "Rectangular body shape",
        "fuller, bushier tail",
        "Light wheaten or beige color",
        "Medium size and sturdy build",
        "larger size",
        "Often a natural tail that is curled over the back",
        "Soft, silky coat with a wheaten (light beige) color"
    ],
    "yorkshire terrier": [
        "Often has a topknot or hair bow",
        "often has a topknot or hair bow",
        "Typically hair coloring that includes shades of black, tan, and blue",
        "Distinct topknot often tied with a bow",
        "Sturdier build with a square profile",
        "Typically dark steel blue and tan colors",
        "Long, silky hair",
        "Silky, long coat",
        "Long, silky coat",
        "Tail often carried high and may be docked",
        "Distinctive \"topknot\" hair on the head",
        "Coat colors typically in shades of blue and tan",
        "Long, silky, straight coat",
        "silky, long hair",
        "Small size",
        "Distinctive tan and blue/gray coloring",
        "Compact, toy-like body structure",
        "tan and blue or black coat",
        "Small, upright ears covered in short hair",
        "Silky, straight, and fine coat"
    ]
}