{
    "A300": [
        "Airbus logo or livery markings",
        "Winglets at the wingtips (depending on the version)",
        "Airbus logo or markings on the aircraft",
        "Winglets (depending on the model/version of A300)",
        "Number of windows: The A300 generally has more cabin windows due to its longer fuselage.",
        "Signature Airbus \"bulbous\" nose shape",
        "Airbus logo or markings",
        "Airbus A300 logo or markings if visible",
        "Lack of wingtip fences or sharklets (classic A300s)",
        "different engine types (A300 typically has older engine models)",
        "Tail design (differences in vertical stabilizer and rudder)",
        "A300 typically does not feature a T-tail (MD-90 has a T-tail configuration)",
        "Positioned lower, closer to the ground when on the ground (due to shorter landing gear)",
        "Slight dihedral wings (wings angled slightly upwards) ",
        "fewer cabin windows (depending on configuration)"
    ],
    "A310": [
        "Winglets on the wings if present (later models may have them).",
        "T-tails (tailplane)",
        "Winglets at the end of the wings (on some models)",
        "Single full passenger deck (no partial upper deck as in some larger aircraft)",
        "winglets on the wingtips (present on some A310 models)",
        "More modern fuselage design with fewer windows",
        "Two engines mounted under the wings, rather than four engines.",
        "Shorter fuselage",
        "shorter fuselage",
        "The cockpit windows and nose shape distinctive to Airbus aircraft.",
        "Two engines instead of four",
        "Winglets on the A310, which are usually absent on the DC-10",
        "distinctive tailcone shape (more pointed on A310)",
        "distinctively curved winglets (if equipped)",
        "Smaller size"
    ],
    "A320": [
        "Winglets with a vertical upturn instead of raked wingtips (common in some 767 models)",
        "sharklets (tip extensions) on wings (A320 typically has these)",
        "registration number (Airbus A320 models usually start with an \"F\" in the registration markings for commercial aircraft from Europe, while U.S. aircraft start with an \"N\")",
        "Airbus logo or specific airline livery known to operate A320s",
        "Distinctive Airbus nose shape (more rounded compared to the 767's more pointed nose)",
        "Sharklet winglets  ",
        "Winglets on the ends of the wings",
        "Wingtips or Sharklets on the end of the wings",
        "T-tail design",
        "landing gear design (A320 has a simpler main landing gear structure)",
        "The absence of an extra set of landing gear near the wing roots  ",
        "Number of engines: Both have two engines, but the A320 engines are generally smaller.",
        "Absence of rear fuselage-mounted engines",
        "Sharklet wingtip devices (winglets)",
        "Rounded nose  "
    ],
    "A330": [
        "**Wingtips:** A330 typically has wingtip devices known as winglets or sharklets, while early models of the Boeing 737 have no winglets and later models may have split scimitar winglets.",
        "Number of engines: A330 has two engines, while A380 has four.",
        "Winglets: The A330 often features larger, more prominent winglets compared to the A310.",
        "Airbus branding or insignia on the fuselage",
        "Typically a slightly shorter and higher tail compared to the Boeing 767",
        "Rounded, bulbous nose",
        "**Livery and Logos:** Identifiable airline branding might provide clues specific to the types of aircraft they predominantly use.",
        "Two engines (The A330 has two engines, while the DC-8 typically has four)",
        "Newer design with longer range and more passenger capacity",
        "Different wingtip design (depending on the variant)",
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "Tail height: The vertical tail fin of the A330 is often taller than that of the A310.",
        "Engine size: The A330 typically has larger engines compared to the A310.",
        "Distinctive winglets",
        "Shorter fuselage"
    ],
    "A340": [
        "Four engines: The A340 has four engines, while the A310 has two.",
        "Winglets: The A340 often features winglets, which are absent in the A310.",
        "Four engines (A340 has four engines, whereas Boeing 757 has two)",
        "Winglets shape (A340 winglets are different compared to A320)",
        "Four engines (A340 has four engines, while the Boeing 777 has two)",
        "Airbus logo on the tail or fuselage (if visible)",
        "Number of doors: The A340 typically has more passenger doors due to its longer length.",
        "Logo and branding specific to Airbus (Airbus logos and design elements may differ from those of Boeing)",
        "Unique landing gear arrangement (A340 has a center main gear on some models)",
        "The A340 has a longer fuselage with a different window arrangement compared to the 777",
        "Different tail configurations (the A340 often has a slightly higher vertical stabilizer)",
        "Winglets (A340 often has winglets that are upward-angled)",
        "Wingspan (A340 has a larger wingspan than A320)",
        "Slightly larger size and more elongated shape",
        "Aircraft tail height (A340 generally taller)"
    ],
    "A380": [
        "Distinctive hump due to the upper deck extending towards the tail.",
        "Emirates and other specific airlines' logos often associated with A380",
        "Wingtip fences or winglets that are larger and more vertical",
        "A distinctive hump at the front of the plane where the upper deck ends",
        "larger, more rounded nose",
        "Distinctively larger and more rounded nose",
        "The Airbus logo near the front section",
        "Larger size and wingspan (A380)",
        "The A380 often has a more bulbous nose compared to the sleeker nose of the Boeing 757",
        "Distinctive hump running the entire length of the fuselage",
        "Distinctive hump on the upper deck (A380)",
        "Bulbous nose",
        "absence of a hump on the upper deck (Boeing 747 has a distinctive hump)",
        "Often a more prominent nose design",
        "Generally more massive and larger fuselage"
    ],
    "ATR-42": [
        "Four-bladed propellers (ATR-42 usually has four-bladed, Fokker 50 has six-bladed)",
        "Propeller engines (ATR-42 has turboprop engines, while BAE-125 has jet engines)",
        "No T-tail, as the horizontal stabilizer is at the base of the vertical stabilizer",
        "Shape of the nose: The ATR-42 generally has a more rounded nose.",
        "Different engine nacelle shapes (ATR-42 has more teardrop-shaped nacelles)",
        "Size: The ATR-42 is larger in size and length compared to the DHC-6.",
        "Twin turboprop engines",
        "Specific airline liveries and logos that may correspond to either aircraft model",
        "Twin-engine configuration (the An-12 has four engines)",
        "Engine nacelles more streamlined",
        "Nose shape: The ATR-42 has a more rounded nose, whereas the DHC-6 has a more angular shape.",
        "More squared-off and robust fuselage",
        "Shorter landing gear",
        "Single vertical stabilizer",
        "Engine nacelles: ATR-42 has distinct circular engine nacelles compared to the longer, more streamlined nacelles on the Dash 8."
    ],
    "ATR-72": [
        "Longer fuselage for passenger cabin (indicative of a regional airliner)",
        "Four jet engines mounted on pylons under the wings.",
        "A noticeably T-shaped tail with a horizontal stabilizer set atop the vertical stabilizer.",
        "Four-blade propellers (as opposed to six-blade for Fokker 50)",
        "Longer, narrower fuselage: The ATR-72 has a sleeker, elongated fuselage compared to the stubbier appearance of the BAE 146.",
        "Airline livery or logos (if present)",
        "High-wing configuration as well but with jet engines.",
        "Sharper, more angular tail: The ATR-72 features a prominent, angular vertical stabilizer.",
        "Swept-back vertical stabilizer",
        "A more compact, rounded fuselage.",
        "Absence of jet engines mounted at the rear of the fuselage",
        "Number of engines (both have two, but different types)",
        "Multiple wheels on the main landing gear.",
        "Longer fuselage with more windows",
        "Longer fuselage: The ATR-72 has a longer fuselage compared to the ATR-42."
    ],
    "An-12": [
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "Propellers: The An-12 has four turboprop engines with visible propellers, while the A300 has two jet engines.",
        "Four turboprop engines",
        "Four turboprop engines mounted on the wings, versus the two turbofan engines of an A320",
        "Four turboprop engines versus one piston engine",
        "Landing gear (An-12 has retractable landing gear, PA-28 usually has fixed gear)",
        "Number of propeller blades (An-12 typically has four-blade propellers)",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "Four engines compared to one (An-12 typically has four turboprop engines, while DHC-1 has one piston engine)",
        "An-12 has a rear loading ramp, while DHC-1 does not",
        "Shorter fuselage than MD-11",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "Ramp/cargo door on An-12",
        "Landing gear configuration (An-12 has retractable landing gear, while DHC-1 has fixed gear)"
    ],
    "BAE 146": [
        "fewer propellers (since Saab 340 is a turboprop aircraft)",
        "Steeper landing gear",
        "Landing gear: multiple wheels on main gear (BAE 146) vs simpler landing gear (BAE-125)",
        "Steep landing and takeoff capabilities",
        "Landing gear configuration (BAE 146 has landing gear that retracts into pods on the fuselage; Dash 8 has landing gear that retracts into the engine nacelles)",
        "Longer main landing gear legs and slightly shorter aircraft length compared to a DC-9",
        "four engines (two on each wing)",
        "T-tail (BAE 146 features a T-tail, while Dash 8 has a conventional tail)",
        "Distinctive airbrake on the tail (sometimes deployed)",
        "Four jet engines mounted under the wings",
        "Stubbier, more rounded nose",
        "Four engines mounted under the wings",
        "High wing position relative to the fuselage",
        "Four engines mounted under the wings, but larger and spaced differently",
        "T-tail configuration"
    ],
    "BAE-125": [
        "small, twin-engine business jet",
        "Fewer windows, typically associated with business jets",
        "Brand logos and registration markings: Look for specific airline logos, registration numbers, or other identifiers that might be visible on the aircraft.",
        "winglets at the tips",
        "Straight wings with winglets or no winglets at all",
        "Jet engines instead of turboprops",
        "Engine placement: The BAE-125 has engines mounted on the rear fuselage, while the ERJ 145 also has rear-fuselage-mounted engines but can be identified by their specific placement and size.",
        "Propeller engines",
        "Distinctive larger and more prominent winglets (on some models)",
        "lacks propellers (as ATR-72 is a turboprop)",
        "Swept-back wings with winglets",
        "**Number of Engines**: The BAE-125 usually has two engines, whereas the DC-8 has four.",
        "**Branding and Markings**: The BAE-125 often has corporate or private livery, whereas the DC-8 typically features commercial airline branding.",
        "Wing-mounted engines (turboprop in most cases)",
        "swept wings"
    ],
    "Beechcraft 1900": [
        "Smaller size with a length of approximately 57 feet",
        "Single crew door on the left side of the fuselage",
        "Longer fuselage",
        "Beechcraft logo or specific airline markings (if visible)",
        "T-tail structure",
        "Narrower fuselage",
        "Fixed landing gear visible when the aircraft is in the air",
        "T-tail configuration",
        "Straight wings rather than swept wings",
        "Narrow fuselage",
        "Straight winglets on Beechcraft 1900 vs. raked or no winglets on Embraer ERJ 145",
        "Rounder, more compact fuselage",
        "More pronounced nose",
        "A high T-tail design",
        "T-tail design"
    ],
    "Boeing 707": [
        "Swept-back tail fin",
        "Wings: The Boeing 707's wings are higher and more swept than the 727's.",
        "Narrower fuselage compared to modern 737 versions",
        "Older liveries often found on 707 models compared to newer liveries on 717 models",
        "Larger fuselage",
        "Fuselage length: The Boeing 707 typically has a longer fuselage than the Boeing 727.",
        "Single-deck fuselage",
        "Four engines under the wings (Boeing 707 has four; 737 typically has two)",
        "T-tail tailplane",
        "Smaller fuselage diameter in Boeing 707",
        "Larger and more pronounced tail fin",
        "T-tail design (707’s tail design is slightly different)",
        "Older design with less advanced aerodynamics compared to the 757",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)",
        "A slightly larger and wider fuselage"
    ],
    "Boeing 717": [
        "Modern livery: Boeing 717 typically has more modern airline liveries compared to the older liveries commonly found on DC-9 aircraft.",
        "Smaller winglets or none, compared to MD-80 variations",
        "Distinctive Boeing 717 branding and livery (depending on airline)",
        "Winglets (if present, though some 717s may not have winglets)",
        "Absence of a third engine in the tail section",
        "Shorter fuselage",
        "Winglets (optional but more common in retrofitted 717s)",
        "Smaller fuselage",
        "Length: The Boeing 717 is longer compared to many variants of the DC-9.",
        "Newer design and more modern appearance",
        "Lack of winglets",
        "Winglets at the wingtips (optional on Boeing 717 but not available on Fokker 100)",
        "Nose shape (more pointed on the Boeing 717)",
        "Slightly shorter fuselage length",
        "Fuselage Shape: The Boeing 717 typically has a shorter and more slender fuselage compared to most versions of the Boeing 737."
    ],
    "Boeing 727": [
        "Winglets (in some models, but not all)",
        "Generally shorter wingspan and fuselage length compared to most DC-8 models",
        "Slightly swept wings with fewer pylons for engines",
        "Narrower fuselage diameter compared to the DC-8",
        "Smaller winglets or sometimes none at all",
        "Typically older and having a more retro design style",
        "Longer, more slender fuselage",
        "Shorter fuselage compared to the 757",
        "Narrow body",
        "Additional wing-mounted landing gear (in some variants)",
        "More contemporary and newer design styles",
        "Wide body",
        "Conventional low tail",
        "A slightly longer fuselage",
        "Larger, more elongated size compared to the Boeing 727"
    ],
    "Boeing 737": [
        "Winglets: Check the winglets if present. The Boeing 737 may have blended winglets or split scimitar winglets, while the Boeing 757 often has winglets with a steeper angle.",
        "Specific registration and airline liveries, often related to the aircraft model",
        "Winglets on the wingtips (depending on the model and generation)",
        "Length of the fuselage (737 tends to be longer than 717)",
        "Tail design: The vertical stabilizer (tail fin) on the Boeing 737 is generally broader at the base compared to the DC-8.",
        "Wingtip design, such as split scimitar winglets (737) versus sharklets (A320)",
        "Distinctive pointed tailcone",
        "Winglets: Boeing 737 often has distinctive upward-curved winglets, whereas most DC-8s do not.",
        "pointed nose design",
        "Number of engines (Boeing 737: two engines; Boeing 727: three engines)",
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)",
        "Aircraft nose shape (Boeing 737 generally has a more rounded nose)",
        "Tail fin design",
        "Winglets on the wingtips (specific models)",
        "Fuselage shape: Boeing 737 has a more rounded fuselage, while the DC-8 has a thinner and more cylindrical shape."
    ],
    "Boeing 747": [
        "Shorter and less pronounced landing gear (767)",
        "The A330 typically has two engines",
        "Distinctive nose shape, flatter and broader compared to the A340",
        "Winglets at the ends of the wings (depending on specific 747 model)",
        "pronounced wing sweep",
        "More pointed nose shape",
        "Shorter and more robust fuselage compared to the more elongated fuselage of the 757",
        "Winglets on the ends of the wings (in newer models)",
        "more prominent winglets",
        "Boeing branding or airline livery associated with 747s",
        "The nose and upper deck of the A330 are less pronounced and have a more streamlined look.",
        "Swept-back wings with a larger span",
        "Two engines (767)",
        "Four engines (most 747 models)",
        "Distinctive hump on the upper deck near the front"
    ],
    "Boeing 757": [
        "**Wingspan**: The Boeing 777 has a larger wingspan than the 757.",
        "T-tail absent",
        "Shorter landing gear and tail height",
        "Wing span: The 757 has a narrower wingspan compared to the 767.",
        "Landing gear: The Boeing 757 has a noticeable difference in the landing gear configuration compared to the Boeing 767.",
        "Tail (vertical stabilizer) typically higher and more swept-back",
        "Shorter landing gear",
        "winglets at the wingtips (on most 757 models)",
        "Tail design (Boeing 757 vertical stabilizer is more angular)",
        "Nose shape (Boeing 757 has a more pointed nose)",
        "Pointed nose shape",
        "No winglets",
        "more slender and pointed nose",
        "Typically fewer and smaller doors on the fuselage compared to A330",
        "Overall size and capacity: The 757 is generally smaller in terms of passenger capacity and overall size compared to the 767."
    ],
    "Boeing 767": [
        "Length: The Boeing 767 is usually longer than the A320.",
        "Winglets on the tips of the wings (in some models)",
        "Tail Height: Boeing 767 has a shorter tail height compared to the Boeing 777.",
        "Winglets at the tips of the wings (in newer models)",
        "The shape of the nose (the 767 has a more pointed nose compared to the 747)",
        "Winglets that are typically larger on the 757 (if both are equipped with winglets)",
        "Lack of a noticeable hump on the upper fuselage",
        "A wider fuselage (767 is a wide-body aircraft)",
        "More prominent wingspan",
        "Differences in engine shape and mounting depending on specific engine models used",
        "Wingspan: Boeing 767 has a shorter wingspan compared to the Boeing 777.",
        "winglets",
        "Presence of a larger wingspan",
        "Flattened lower fuselage near the aft end (for the tail skid)",
        "Larger, more rounded nose shape"
    ],
    "Boeing 777": [
        "**Fuselage Shape**: The Boeing 777 has a wider fuselage.",
        "**Wingspan**: The Boeing 777 has a larger wingspan.",
        "Fuselage: Boeing 777 has a longer, wider fuselage.",
        "Engine count: Boeing 777 has two engines, while the Airbus A340 has four engines.",
        "Fuselage shape: The Boeing 777 has a wider, more rounded fuselage in contrast to the narrower fuselage of the Boeing 737.",
        "Generally longer overall length",
        "Longer, slender fuselage",
        "larger, more rounded nose",
        "Raked wingtips (A330 has winglets)",
        "Modern, more streamlined design (Boeing 777)",
        "Winglets: Boeing 777 typically does not have winglets, while the A340 often features winglets.",
        "Wider fuselage for greater passenger capacity (Boeing 777)",
        "Engine: Boeing 777 has larger, twin engines under the wings.",
        "Larger physical size (Boeing 777)",
        "Distinctive rounded nose shape"
    ],
    "C-130": [
        "Two piston engines",
        "Shorter, stockier landing gear suited for rough airstrips",
        "Sleek, modern appearance suitable for commercial aviation",
        "Short, robust landing gear",
        "Four turboprop engines",
        "Bulky and rugged appearance for tactical airlift operations",
        "Shorter landing gear",
        "Wider and more robust landing gear",
        "No rear loading ramp, designed for passenger or freight transport",
        "The landing gear configuration: The C-130 typically has a set of two main landing gears with two wheels each on each side, while the An-12 has two pairs of tandem main landing gear.",
        "Tailwheel landing gear configuration",
        "Squat and utilitarian appearance",
        "T-tail structure",
        "The presence of a large rear cargo door: Both aircraft feature a rear cargo ramp, but the shape and design can be distinguishing factors.",
        "The number and placement of engines: Both aircraft have four engines, but the C-130's engines are more closely spaced along the wing."
    ],
    "C-47": [
        "Two engines: The C-47 has two engines, whereas the DC-6 has four.",
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "Shorter fuselage: The C-47 has a shorter fuselage than the DC-6.",
        "Propellers (C-47 has propellers, A310 has jet engines)",
        "Tailwheel landing gear",
        "Twin radial engines",
        "Tailwheel landing gear configuration",
        "Landing gear: The C-47 features a tailwheel landing gear configuration, while the DC-6 typically has a tricycle landing gear system.",
        "WWII-era design (C-47 has a vintage, older design typical of WWII aircraft)",
        "Tail wheel landing gear",
        "Landing gear with tailwheel configuration",
        "Twin-engine propellers",
        "Propeller engines",
        "Propeller-driven engines",
        "Radial piston engines"
    ],
    "CRJ-200": [
        "T-tail configuration but with more pronounced tail structure",
        "Winglets on the tips of the wings",
        "Absence of winglets (on most CRJ-200 models)",
        "No winglets on many models",
        "Absence of winglets",
        "A single propeller engine mounted at the front",
        "Size and Length: The CRJ-200 is smaller and shorter than the MD-90.",
        "Wings: The wings of the CRJ-200 are mounted lower on the body compared to the MD-90.",
        "Distinctive sharp, pointed nose",
        "T-tail configuration",
        "T-tail configuration ",
        "different tail height",
        "Winglets typically present",
        "Rounder, less pointed nose",
        "T-tail with smaller horizontal stabilizers"
    ],
    "CRJ-700": [
        "Winglets at the tips of the wings (though some CRJ-200 models can also have them, they are more common on the CRJ-700)",
        "Larger, more pronounced winglets",
        "Tail Design: The CRJ-700 typically features a T-tail design, while the MD-80 often has a low tailplane or horizontal stabilizer.",
        "Winglets on the tips of the wings",
        "T-tail configuration",
        "T-tail structure with slight differences in size and angle",
        "Generally absence of winglets",
        "Winglets on the wingtips",
        "Distinctive winglets at the tips of the wings",
        "Winglets or small vertical extensions at the wingtips",
        "T-tail design as well, but a more robust fuselage",
        "Different landing gear configuration (the CRJ-700 has taller landing gear)",
        "Classic, older aircraft design features",
        "Shorter and more pointed nose",
        "Landing gear configuration"
    ],
    "Cessna 172": [
        "Fixed landing gear (compared to the often retractable gear on the DHC-1)",
        "Fixed landing gear",
        "fixed landing gear",
        "Generally found in a lighter, simpler paint scheme",
        "Traditional ‘tail-dragger’ or tricycle gear setup",
        "Tricycle landing gear (nose wheel included)",
        "Tailwheel or tricycle landing gear configuration",
        "Multiple engines (usually four propellers)",
        "single engine with a propeller in the front",
        "Fixed, non-retractable landing gear",
        "Taildragger landing gear (main two wheels in front, small third wheel at the tail)",
        "twin engines with propellers",
        "Single exhaust",
        "Smaller size and more compact",
        "More simplistic design and fewer windows compared to the jet"
    ],
    "Cessna 208": [
        "Single-engine propeller (Cessna 208) vs. twin-engine turboprop (Dash 8)",
        "Number of seats (Cessna 208 seats up to around 14, Boeing 737 seats over 130)",
        "High-wing design (Cessna 208) vs. low-wing design (Dash 8)",
        "Shorter fuselage compared to Beechcraft 1900",
        "Fixed landing gear (non-retractable)",
        "Fixed landing gear",
        "fixed landing gear",
        "Fixed landing gear (Cessna 208) vs. retractable landing gear (Dash 8)",
        "Smaller size and capacity (Cessna 208) vs. larger and typically used for regional flights (Dash 8)",
        "Single turboprop engine",
        "Size of the aircraft (Cessna 208 is significantly smaller)",
        "Turboprop engine rather than jet engines",
        "Twin-engine turboprop",
        "Engine nacelles: The DHC-6's engine nacelles on the wings may help identify it, whereas the Cessna 208 lacks these due to its single-engine configuration.",
        "Capacity for fewer passengers (typically 9-14)"
    ],
    "Cessna Citation": [
        "**Size:** Cessna Citations are generally smaller.",
        "**Tail design:** Cessna Citations usually have a T-tail design.",
        "**Number of engines:** Cessna Citations typically have two engines.",
        "**Distinctive Features:** Check for any model-specific features or markings.",
        "**Tail design**: The Cessna Citation often features a T-tail configuration, whereas the Beechcraft 1900 has a conventional tail design.",
        "**Number of engines**: The Cessna Citation is a jet with typically two jet engines, whereas the Beechcraft 1900 is a turboprop with two propeller engines.",
        "**Engine position**: Cessna Citation typically has engines mounted on the rear fuselage, while Beechcraft 1900 has engines mounted on the wings.",
        "**Nose Shape:** Cessna Citations often have a more pointed nose. ",
        "**Wing configuration**: The Cessna Citation usually has a straight wing design, whereas the Beechcraft 1900 has a low-wing design.",
        "**Shape of fuselage:** Cessna Citations have a more compact fuselage.",
        "Winglets on the wingtips (on some models)",
        "winglets on some models",
        "landing gear configuration",
        "**Landing gear**: The Cessna Citation often has tricycle landing gear with the main gear retracting into the wings or fuselage, while the Beechcraft 1900's landing gear retracts into nacelles on the wing.",
        "Distinctive winglets (depending on specific Cessna Citation model)"
    ],
    "Challenger 600": [
        "Swept-back wings",
        "Winglets that are less pronounced or sometimes absent",
        "T-tail configuration on Challenger 600",
        "Challenger 600 typically has a sleeker, more streamlined appearance",
        "Distinctive, shorter landing gear",
        "Generally smaller overall size compared to the CRJ-700",
        "More spacious, shorter landing gear",
        "T-tail configuration",
        "Twin jet engines (mounted on the rear fuselage) ",
        "Winglets may or may not be present (as opposed to the CRJ-700 which consistently has winglets)",
        "Distinctive T-tail configuration",
        "Rear-mounted engines",
        "Commercial or business jet appearance",
        "More passenger windows",
        "Larger, tail-mounted engines"
    ],
    "DC-10": [
        "landing gear (DC-10 has retractable tricycle landing gear, DC-3 has fixed landing gear)",
        "Less pronounced curve or angle in the nose section compared to the MD-11",
        "Tail design: The DC-10 has a T-tail design, while the DC-8 has a more traditional tailplane.",
        "More rounded nose compared to the more pointed nose of the DC-9",
        "Larger wingspan and overall size.",
        "Three engines: one under each wing and one at the base of the vertical stabilizer.",
        "Three engines (one on each wing and one at the base of the vertical stabilizer)",
        "Wider fuselage.",
        "Shorter fuselage compared to the MD-11",
        "T-tail configuration.",
        "Three engines (one in each wing and one at the base of the vertical stabilizer)",
        "Three engines: one on each wing and a third in the tail (distinctive for the DC-10)",
        "Tail engine intake: The DC-10's tail-mounted engine has a prominent S-duct intake design.",
        "number of engines (DC-10 has three, while DC-3 has two)",
        "fuselage shape (DC-10 has a wider, more modern fuselage)"
    ],
    "DC-3": [
        "Number of engines (DC-3 has 2 engines, DC-9 typically has 2 engines located at the rear)",
        "Single vertical stabilizer with rudder",
        "Tandem main gear and single tail wheel configuration",
        "twin-engine configuration",
        "Twin-engine configuration",
        "Tailwheel (as opposed to nosewheel)",
        "absence of a cargo door",
        "Larger fuselage and windows",
        "Aircraft body size (the DC-3 is generally smaller and shorter than the DC-8)",
        "fewer or no reinforced floor sections",
        "Windows: DC-3 has fewer, more widely spaced side windows",
        "commonly used for cargo or vintage flights",
        "Tailwheel landing gear (DC-3) instead of tricycle landing gear (DHC-6)",
        "Larger wingspan (DC-3) relative to its size",
        "Classic, vintage design from the 1930s and 1940s"
    ],
    "DC-6": [
        "Tailwheel landing gear (in some variants)",
        "Landing gear with smaller, less robust wheels",
        "Tail-wheel landing gear",
        "Propeller engines (DC-6) instead of jet engines (DC-9)",
        "More rounded nose (DC-6) compared to the more pointed nose of the DC-9",
        "Tail-dragger type landing gear",
        "Four propeller engines (DC-6) compared to jet engines (DC-10)",
        "Lower ground clearance",
        "Swept wings",
        "Four engines (DC-6) as opposed to two (DC-9)",
        "Tail wheel landing gear for earlier models",
        "Tail Design: DC-6 has a tricycle landing gear (nose gear), and a vertical stabilizer without a dorsal fillet, while the C-47 has a tailwheel landing gear and a more prominent dorsal fillet on the vertical stabilizer.",
        "Propeller engines (DC-6 has four propeller engines while the Boeing 757 has jet engines)",
        "Four-engine configuration",
        "Larger wingspan: The DC-6 has a larger wingspan relative to the DC-3."
    ],
    "DC-8": [
        "Number of engines: The DC-8 typically has four engines, while the DC-10 has three engines.",
        "Swept-back wings (DC-8)",
        "Single story cabin (compared to the 747's distinctive hump for the upper deck)",
        "Longer, more slender fuselage in the DC-8",
        "Distinctive shape of the tail fin and rudder",
        "Narrower fuselage",
        "Four engines mounted under the wings (both have this, but different configurations)",
        "Four engines mounted under the wings (compared to the A320's two engines)",
        "Lack of T-tail (DC-8 has a conventional tail, whereas DC-9 has a T-tail)",
        "Narrow fuselage",
        "Turbojet engines (DC-8)",
        "The presence of a more prominent wing dihedral angle (DC-8)",
        "Four more narrow engines (DC-8 vs. DC-6, which has more rounded piston engines)",
        "Older, more tapered wing design",
        "Longer fuselage with a more slender appearance"
    ],
    "DC-9": [
        "Limited number of emergency exits (typically 3 on each side)",
        "No winglets at the wingtips (whereas many Boeing 767 models have winglets)",
        "Jet engines (as opposed to propellers)",
        "Lower tail height in comparison to the MD-80",
        "Sleeker, more modern fuselage",
        "Landing gear with a simpler, single-bogey main gear setup",
        "Fewer sets of landing gear (typically two main landing gears compared to the 727's three)",
        "Absence of aerodynamic improvements like winglets",
        "Generally simpler, more compact appearance",
        "Number of engines: The DC-9 has two engines, while the DC-6 has four engines.",
        "Absence of an engine on the vertical stabilizer (tail)",
        "Shorter, more narrow fuselage",
        "T-tail configuration",
        "Shorter fuselage compared to the Boeing 727",
        "Rear-mounted engines (engines attached to the fuselage towards the tail area)"
    ],
    "DH-82": [
        "radial engine (often visible)",
        "Fixed tailwheel landing gear",
        "Fixed landing gear with a tailwheel",
        "Fixed landing gear with tailwheel",
        "fixed landing gear with tailwheel",
        "Tailwheel landing gear configuration",
        "Historic look, often associated with vintage aircraft from the 1930s",
        "Often painted in bright, eye-catching colors",
        "Fixed, non-retractable landing gear with a tailwheel",
        "fixed landing gear",
        "Radial engine mounted at the front",
        "Smaller size and lighter weight",
        "smaller size",
        "Smaller size",
        "smaller size "
    ],
    "DHC-1": [
        "Radial engine cowling (distinctive engine shape)",
        "Tailwheel landing gear",
        "Tailwheel undercarriage",
        "Conventional tailwheel (tail-dragger) landing gear",
        "Taildragger configuration (main landing gear under the wings, with a small tailwheel)",
        "Smaller size and light aircraft build",
        "Landing gear (Conventional gear on DHC-1, Tricycle gear on Hawk T1)",
        "Fixed landing gear",
        "Tricycle landing gear in some models (DHC-1) vs. taildragger landing gear (DH-82)",
        "Taildragger landing gear (two main wheels in front and a small wheel or skid at the rear of the aircraft) ",
        "Propeller-driven engine",
        "Number of engines: The DHC-1 has one engine, whereas the A310 has two jet engines.",
        "Propeller at the front of the aircraft",
        "Different placement and design of exhausts and air intakes",
        "Vintage, military trainer appearance"
    ],
    "DHC-6": [
        "Sturdy, rugged appearance suitable for STOL (Short Takeoff and Landing) operations",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "Short takeoff and landing (STOL) design features",
        "Squared-off tail fin (DHC-6 has a distinct, squared-off vertical stabilizer)",
        "Number of engines (DHC-6 has 2 engines, DC-8 has 4 engines)",
        "Dual tail fins in the horizontal stabilizer configuration",
        "Engine type (DHC-6 has turboprop engines, DC-8 has jet engines)",
        "Landing gear (DHC-6 often has fixed landing gear, DC-8 has retractable landing gear)",
        "Longer fuselage designed for carrying more passengers or cargo",
        "T-tail (horizontal stabilizer mounted on the top of the vertical stabilizer) ",
        "Fixed, non-retractable landing gear (DHC-6)",
        "Fixed landing gear (non-retractable)",
        "fixed, non-retractable landing gear",
        "Retractable landing gear (in some versions) or fixed large strut-supported landing gear",
        "Twin-engine turboprop (DHC-6)"
    ],
    "DR-400": [
        "**Bubble canopy**: The DR-400 usually has a clear bubble canopy that provides a panoramic view for the occupants.",
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "retractable gear (in some DR-400 models)",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "Traditional cockpit with mostly analog instruments",
        "different door placement (PA-28 has doors on the side, DR-400 tends to be more centralized access)",
        "Size: The DR-400 is much smaller compared to the A300.",
        "Usage: The DR-400 is used for general aviation, while the A300 is designed for commercial airline service.",
        "Fixed tricycle landing gear",
        "Tricycle landing gear with the nose wheel set further back",
        "Canopy opens sideways for pilot and passenger access",
        "**Fixed landing gear**: The DR-400 typically has non-retractable landing gear.",
        "Smaller cockpit with seating for 2-4 people",
        "Positioned for general aviation or private flying"
    ],
    "Dash 8": [
        "Propellers (Dash 8 has turboprop engines, whereas the DC-8 has jet engines)",
        "Distinctive engine nacelles (engine housings on wings) ",
        "Presence of nacelles for turboprop engines near the wings",
        "Fixed landing gear (in some models)",
        "Longer fuselage compared to the Dornier 328",
        "Propeller engines (Dash 8 typically has two propeller engines, BAE-125 has jet engines)",
        "Twin-engine turboprop",
        "T-shaped tail",
        "More boxy fuselage shape",
        "Two turboprop engines",
        "Longer wingspan compared to the DHC-6",
        "Long fuselage",
        "Swept, straight wings",
        "Four-bladed propellers (depending on the specific Dash 8 model)",
        "Engine nacelles close to the aircraft body"
    ],
    "Dornier 328": [
        "twin turboprop engines (usually visible on the wings)",
        "Turboprop engines (as opposed to jet engines)",
        "Rounded, bulbous nose",
        "T-tail design on the Dornier 328 vs. conventional tail on the Beechcraft 1900",
        "propeller engines",
        "Two propeller blades on each engine",
        "Distinctive propeller shape (often 4-blade on Dornier 328, versus 6-blade on ATR-72)",
        "Four propeller blades on each engine",
        "Engine placement (Dornier 328 has engines mounted on pylons beneath the wings)",
        "sleeker and more streamlined fuselage",
        "Nose shape (more rounded and shorter on the Dornier 328)",
        "Distinctive nose shape",
        "T-tail configuration",
        "T-tail: The Dornier 328 typically features a T-tail configuration, while the DHC-6 has a conventional tail design.",
        "often used for regional and short-haul flights"
    ],
    "EMB-120": [
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Logo or airline markings (often seen on regional jets like EMB-120)",
        "Turboprop engines (propellers) instead of jet engines",
        "Size and Body Shape: The EMB-120 is a smaller, turboprop aircraft, while the MD-90 is a larger, twin-jet commercial airliner.",
        "Turboprop engines",
        "turboprop engines",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the MD-90 has two jet engines mounted at the rear of the fuselage.",
        "twin turboprop engines (visible propellers)",
        "twin turboprop engines",
        "Larger passenger capacity (typically for regional flights)",
        "Twin-engine turboprop with engines mounted on the wings",
        "Twin turboprop engines mounted on the wings",
        "Twin-turboprop engines mounted on the wings",
        "Airline Livery: Many MD-90s are painted with commercial airline liveries, while EMB-120s can also be found in regional airline or corporate liveries.",
        "Landing gear that retracts into the engine nacelles or the wings"
    ],
    "Embraer E-Jet": [
        "Winglets: Embraer E-Jets typically have winglets, while Fokker 100s do not.",
        "Main Landing Gear: The E-Jets have a shorter, more compact main landing gear compared to the longer and more visible landing gear of the Fokker 100.",
        "absence of propellers (Beechcraft 1900 has twin turboprop engines)",
        "Less pronounced swept wings",
        "Tail Design: The E-Jets usually have a slightly more swept-back horizontal stabilizer and a different tail fin design in comparison to the Fokker 100.",
        "Fuselage Shape: The fuselage of the E-Jet is typically sleeker and more streamlined, while the Fokker 100 has a slightly bulkier, older design.",
        "longer landing gear legs",
        "Engines: The E-Jets have engines that are mounted under the wings, whereas the Fokker 100 has rear-mounted engines.",
        "Nose Shape: The E-Jets have a more pointed, sleek nose, compared to the more rounded nose of the Fokker 100.",
        "less pronounced nose shape",
        "different winglet design",
        "Distinctive \"T-tail\" configuration in some E-Jet models (e.g., E170)",
        "T-tail configuration",
        "more pronounced nose shape",
        "Longer, slender wings"
    ],
    "Embraer ERJ 145": [
        "Length: The ERJ 145 is considerably longer than the Beechcraft 1900.",
        "Length: The ERJ 145 tends to be slightly longer than the CRJ-200.",
        "Wing Design: The wings of the ERJ 145 have a slightly swept-back design, whereas the Beechcraft 1900 has straighter wings.",
        "Landing gear: Differences in the landing gear configuration can help differentiate between the two aircraft.",
        "T-tail configuration",
        "Absence of winglets",
        "Short and thin landing gear struts",
        "Distinctive pointed nose shape",
        "T-shaped tail",
        "Winglets: The ERJ 145 often lacks the winglets found on the Legacy 600",
        "landing gear configuration",
        "Shorter length (around 98 feet for the ERJ 145)",
        "Jet Engines: The ERJ 145 has two rear-mounted jet engines, whereas the Beechcraft 1900 has two turboprop engines mounted on the wings.",
        "Wing configuration: Look at the wing shape and placement relative to the fuselage. The Embraer ERJ 145 has swept wings, while the Fokker 70 may have a different wing configuration.",
        "Length of the aircraft: The Embraer ERJ 145 is generally longer than the Fokker 70."
    ],
    "Embraer Legacy 600": [
        "Winglets: The Legacy 600 usually has a more pronounced upward curve on its winglets compared to the relatively simpler winglets on the E-Jet series.",
        "Swept wings",
        "Size: The Legacy 600 is generally smaller and more streamlined compared to the E-Jet, which is a regional jet with a larger capacity.",
        "Landing gear configuration (Embraer has a different stance and wheel setup)",
        "Longer landing gear",
        "Engine Position: The engines on the Legacy 600 are mounted further back toward the tail, while the E-Jet’s engines are mounted on the wings.",
        "Fuselage Shape: The Legacy 600 has a sleeker, more business-jet-like appearance with a narrower body, whereas the E-Jet has a wider fuselage designed for commercial airline use.",
        "Winglets on the tips of the wings",
        "More pronounced nose shape",
        "Winglets on the ends of the wings",
        "Tail Design: The Legacy 600 has a more distinctive T-tail design, while the E-Jet's tail is more conventional for larger commercial aircraft.",
        "Winglets",
        "Luxurious, executive cabin windows arrangement",
        "Slightly elongated and sleek body shape",
        "General aircraft size and proportion, Legacy 600 is typically shorter"
    ],
    "Eurofighter Typhoon": [
        "military-grade camouflage or gray paint scheme",
        "Presence of modern radar and sensor systems",
        "Military camouflage or jet grey coloring",
        "civilian livery and design",
        "presence of underwing stores (weapons or fuel tanks)",
        "Military markings and insignia",
        "Low-visibility gray paint scheme",
        "Canards (small forewings near the front)",
        "Distinctive airline liveries or branding",
        "Presence of weapons or weapon mounts",
        "Military insignia or camouflage",
        "canards (small forward wings near the nose)",
        "Delta wing configuration",
        "delta wing configuration",
        "Canard foreplanes (small, wing-like structures near the nose)"
    ],
    "F-16": [
        "Military markings (e.g., camouflage paint, military insignia)",
        "Use and markings: F-16 is often seen with U.S. Air Force markings, while F/A-18 is commonly marked with U.S. Navy or Marine Corps insignia.",
        "Presence of weaponry or pylons for attaching bombs/missiles",
        "Compact and agile airframe",
        "Military markings and insignia",
        "LERX (Leading Edge Root Extensions): Both aircraft have these, but their shapes differ and can be used as distinguishing characteristics.",
        "Military camouflage or markings",
        "smaller size and sleeker profile",
        "distinctive vertical stabilizer shape with a sharp leading edge",
        "Military markings or camouflage paint",
        "vertical stabilizer with insignia",
        "Landing gear design: F-16 and F/A-18 have different landing gear configurations and wheel setups.",
        "Presence of weapons and external fuel tanks (F-16)",
        "Military markings and camouflage (F-16) vs. commercial airline livery (A310)",
        "presence of external armament (bombs, missiles)"
    ],
    "F/A-18": [
        "Tailhook (for carrier-based landing)",
        "Wingtip missile rails or pylons",
        "folding wingtips (for carrier storage)",
        "Tactical paint schemes (often gray or camouflage) ",
        "shorter, more robust landing gear",
        "military-grade weaponry and pylons",
        "Distinctive twin vertical stabilizers (tail fins)",
        "external weaponry or pylons for missiles and bombs",
        "Larger landing gear designed for airport runways",
        "Twin tail fins (vertical stabilizers)",
        "Twin vertical stabilizers (tail fins)",
        "Carrier-capable tailhook",
        "Twin-engine configuration",
        "Twin tail fins",
        "swept-back wings with a more aggressive angle"
    ],
    "Falcon 2000": [
        "**Winglets**: Some models of the Falcon 2000 have distinct winglets, while the CRJ-200 commonly has raked wingtips or no winglets.",
        "Twin-engine jet vs. single-engine propeller",
        "Manufacturer logo (Dassault for Falcon 2000)",
        "Low-wing aircraft vs. low-wing (with visible struts supporting wings)",
        "Swept wings with a slight upward angle",
        "Nose shape (sleeker for Falcon 2000)",
        "Distinctive winglets on the wingtips (in some models)",
        "Winglets on the ends of the wings",
        "Sleeker, more modern design",
        "Position of engines (mounted on the fuselage for Falcon 2000, not on the wings)",
        "Dassault Falcon logo or markings",
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure.",
        "Business jet appearance rather than commercial airliner",
        "twin-engine configuration (mounted under the wings)",
        "Winglets: The Falcon 2000 often features winglets (upward-pointing extensions on the wingtips), while older models of the Challenger 600 may have none or smaller versions."
    ],
    "Falcon 900": [
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "Signature windows characteristic of Dassault Falcon jets",
        "Dassault Falcon logo or branding",
        "Swept-back winglets on the tips of the wings",
        "T-tail: The Falcon 900 features a distinctive T-tail design.",
        "Swept wings (Falcon 900)",
        "Manufacturer logos or specific livery",
        "More winglets or wing components",
        "Landing gear configuration ",
        "engine configuration",
        "Winglets at the end (Falcon 900)",
        "Smaller overall size compared to the DC-9",
        "Trijet configuration (three engines)",
        "Distinctive winglets (blended into the wing)",
        "Smaller, round windows"
    ],
    "Fokker 100": [
        "Landing gear placement and structure.",
        "Tail cone: The design of the tail cone or APU exhaust might be different.",
        "Winglets: Fokker 100 often has small winglets at the tips, while the DC-9 does not.",
        "T-tail (horizontal stabilizer mounted on top of the vertical stabilizer).",
        "Lack of winglets on the wings (Boeing 757 often has winglets)",
        "Two engines mounted on the rear of the fuselage (Fokker 100 has this configuration).",
        "T-tail design",
        "T-tail configuration",
        "Larger size and longer fuselage.",
        "Absence of a third engine in the tail (Boeing 727 has three engines)",
        "length of the fuselage (Fokker 100 has a longer fuselage)",
        "wing-mounted engines (Fokker 50 has none; it has turboprop engines instead)",
        "shape and size of tail section (Fokker 100's tail is larger and differently shaped)",
        "Different wing design and landing gear configuration",
        "Engine shape: Fokker 100 has more cylindrical, modern-looking engines compared to the DC-9's older, smaller engines."
    ],
    "Fokker 50": [
        "4-bladed propellers (Fokker 50) vs. 6-bladed propellers (Dornier 328)",
        "Propeller Count: The Fokker 50 typically has twin turboprop engines, while the Saab 2000 also has twin turboprops but may show differences in blade design and count.",
        "Propellers: The Fokker 50 has two turboprop engines with visible propellers, whereas the Fokker 70 is a jet aircraft with turbofan engines and no propellers.",
        "Typically four-blade propellers on engines (ATR-42 generally has six-blade propellers)",
        "**Propellers**: The Fokker 50 is a turboprop aircraft and has large propellers on its wings, while the Embraer ERJ 145 is a jet and has jet engines.",
        "Four-bladed propellers",
        "Two turboprop engines (one on each wing)",
        "Propellers on the engines, indicating a turboprop aircraft",
        "Landing Gear: The landing gear configuration of the Fokker 50 could differ; for instance, the number and placement of wheels may vary in comparison to the Saab 2000.",
        "Twin-turboprop engines",
        "Fokker 50 has a more pronounced upward curve at the end of the tail section",
        "Tail Design: The Fokker 50 has a more rounded tail fin, whereas the Saab 2000's tail fin is generally more angular and upright.",
        "Presence of a small \"shark fin\" antenna on top of the fuselage",
        "Nose Shape: The Fokker 50 often has a more rounded nose, while the Saab 2000 may have a more pointed or sleek nose shape.",
        "Engine Placement: The engines on the Fokker 50 are mounted closer to the fuselage, while on the Saab 2000, they are mounted slightly farther out on the wings."
    ],
    "Fokker 70": [
        "Swept-back wings as opposed to the straighter wings of the Fokker 50.",
        "Lack of a straightforward nose cone seen on the MD-80",
        "T-tail configuration.",
        "Turbojet engines mounted on the rear fuselage rather than propellers on the wings.",
        "Landing gear (Fokker 70 has a simpler landing gear setup compared to the Boeing 727)",
        "Winglets: Some Boeing 737 models have winglets at the tips of the wings, which are less common on the Fokker 70.",
        "Conventional tail (not T-tail)",
        "Smaller wingspan relative to the MD-80",
        "Sleek, rear-mounted twinjet design.",
        "Shorter fuselage compared to the MD-80",
        "T-tail configuration",
        "Distinctive larger winglets",
        "Pointed nose shape",
        "T-tail design",
        "Shorter, more compact wings"
    ],
    "Global Express": [
        "additional antenna arrays and sensors",
        "manufacturer logo (Bombardier for Global Express, Dassault for Falcon 900)",
        "Landing gear configuration",
        "Landing gear configuration and design",
        "Window layout (Global Express might have different window spacings or shapes)",
        "Nose shape (Global Express has a more pointed nose)",
        "distinctive landing gear configuration",
        "Landing Gear: The Global Express has retractable landing gear with a different configuration compared to the CRJ-200.",
        "Swept-back wings",
        "Longer and more pointed nose",
        "T-tail configuration",
        "a T-tail with a more pronounced curve",
        "Different engine placement and nacelle design",
        "Fuselage Length: The Global Express has a longer fuselage compared to the CRJ-200.",
        "Winglets on the tips of the wings"
    ],
    "Gulfstream": [
        "Trijet or twinjet configuration (if specifically the Falcon 2000, it’s a twinjet)",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Winglets with a different design compared to Gulfstream",
        "Distinct Gulfstream logo/branding",
        "landing gear configuration",
        "Wingtip winglets (on some Gulfstream models)",
        "winglets",
        "T-tail",
        "Distinctive winglets (on newer Gulfstream models)",
        "Larger, more luxurious-looking aircraft",
        "T-tail configuration",
        "fewer windows",
        "more modern design features",
        "Signature \"G\" logo on tail (if present)",
        "placement of engines (rear-mounted for Gulfstream)"
    ],
    "Hawk T1": [
        "Red Arrows or similar military aerobatics team markings ",
        "Red, white, and blue color scheme (common for Hawk T1 in RAF service)",
        "Longer, sleeker fuselage typical of a jet trainer",
        "Single jet engine exhaust at the rear (Hawk T1)",
        "Swept-back wings (Hawk T1) vs. straight wings (DHC-1)",
        "Military markings or insignia, often used by air forces for training (Hawk T1)",
        "Military markings and paint schemes",
        "short landing gear",
        "Canopy designed for two tandem seats (instructor and trainee)",
        "Single jet engine",
        "Military markings",
        "Swept-back wings",
        "sharp, swept-back wings",
        "Pointed nose",
        "military color scheme or markings"
    ],
    "Il-76": [
        "Three engines (two on the wings and one in the tail)",
        "Bulky landing gear located in fairings on the fuselage sides",
        "Size and shape: Generally, the Il-76 appears bulkier and more utilitarian compared to the more streamlined Boeing 707.",
        "Large, robust landing gear designed for rough airstrips",
        "Tall, boxy fuselage",
        "Distinctive radome (dome-shaped weather radar cover) on the nose",
        "Four engines mounted under the wings",
        "Four jet engines mounted on wings (Il-76) vs. four turboprop engines (An-12)",
        "Rear cargo ramp/door",
        "Four engines mounted on pylons under the wings",
        "T-shaped tail (horizontal stabilizer located at the top of the vertical stabilizer)",
        "Bulky, multi-wheel landing gear",
        "Four jet engines mounted on pylons built on the wings just above the main fuselage",
        "Smaller, low-set wings",
        "Generally bulkier and larger fuselage"
    ],
    "King Air": [
        "Propellers (King Air has turboprop engines, while Cessna Citation has jet engines)",
        "Twin turboprop engines",
        "More contemporary design with modern avionics",
        "Propellers: King Air aircraft typically have propellers, while Gulfstream jets are known for their turbofan engines.",
        "Turboprop engines with prominent propeller spinners",
        "Propeller engines (King Air has twin turboprop engines, while Falcon 2000 has jet engines)",
        "Landing gear: The landing gear design and placement might vary between the two, with King Air models often having simpler, less robust landing gear compared to the more substantial gear on Gulfstream jets.",
        "Twin jet engines",
        "Single piston engine",
        "Wider fuselage for passengers/comfort",
        "Winglets at the tips of the wings",
        "Two turboprop engines mounted on the wings",
        "Engine nacelle shape and location (King Air's engines are mounted under the wings, while Falcon 2000's engines are mounted at the rear of the fuselage)",
        "Landing gear (King Air often has retractable tricycle landing gear including the forward gear, while Falcon 2000 has a more robust and streamlined landing gear system adjusted for jet performance)",
        "Retractable landing gear that is more streamlined with the wings"
    ],
    "L-1011": [
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "Number of engines: The L-1011 typically has three engines, whereas the A340 has four.",
        "Third engine in the tail cone (L-1011)",
        "Hubbier, more rounded fuselage",
        "L-1011 often has a more rounded nose compared to the DC-9's more pointed design",
        "Winglets or absence thereof (Boeing 757 often has winglets)",
        "Longer fuselage with a sleeker nose design",
        "Larger, more rounded nose",
        "Longer landing gear struts",
        "More angular-wing planes at the wing root",
        "Circular doors on the fuselage",
        "T-tail with additional ventral fin (small fin under the tail)",
        "Three engines (with one engine in the tail and two under the wings)",
        "Distinctive \"hump\" near the aft part of the fuselage",
        "Wider fuselage"
    ],
    "MD-11": [
        "Length: The MD-11 is generally longer compared to the MD-80.",
        "Nose shape: the MD-11 has a slightly more pointed nose compared to the A310.",
        "Winglets on the tips of the wings (some MD-90 models may not have winglets)",
        "Extended fuselage: the MD-11 typically has a longer fuselage compared to the A310.",
        "T-tail configuration",
        "Shorter fuselage compared to the A340",
        "T-tail design (tailplane mounted at the top of the tail fin)",
        "Winglets: the MD-11 has winglets (small vertical stabilizers) at the tips of the wings, whereas the A310 does not.",
        "Tailplane with a smaller span",
        "Trijet engine configuration (one engine on the tail and two under the wings)",
        "a more modern, aerodynamic shape",
        "Longer fuselage compared to the A320",
        "Sharp, angled winglets (on some models)",
        "Different winglets or wingtip design",
        "Narrower fuselage"
    ],
    "MD-80": [
        "Landing gear configuration (MD-80 has a more robust landing gear)",
        "Distinctive nose shape (MD-80 has a more pointed nose)",
        "T-tail configuration (prominent in MD-80)",
        "Shorter wingspan without winglets (MD-11 often has winglets)",
        "Older, more angular design elements",
        "More modern and sleeker design overall",
        "T-tail configuration",
        "Single overwing emergency exit (while many DC-8s have four overwing exits)",
        "More slightly swept-back wings",
        "Aircraft nose shape (MD-80 has a more rounded nose)",
        "Longer fuselage compared to CRJ-700",
        "T-tail design",
        "Length of the aircraft (MD-80 is longer)",
        "Length of the fuselage (MD-80 is longer)",
        "Narrow-body design"
    ],
    "MD-90": [
        "T-tail configuration on the CRJ-700 (not present on the MD-90)",
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "Winglets (some MD-90s have winglets while MD-80s generally do not)",
        "absence of the third engine at the tail (MD-90).",
        "generally smaller size and narrower body of the MD-90.",
        "Extended fuselage: The MD-90 is longer than the DC-9.",
        "Length of the aircraft: The MD-90 is typically longer and slimmer than the A300.",
        "Nose shape: The MD-90 usually has a more pointed nose compared to the A300.",
        "Winglets (on some models)",
        "Longer, more narrow wings",
        "Commercial airline livery and logos on the fuselage",
        "T-tail design (MD-90) vs. conventional tail (DC-10).",
        "Tail cone shape (MD-90 often has a different tail cone configuration)",
        "Length of the fuselage (MD-90 has a longer fuselage)",
        "The absence of the third window exit on both sides of the fuselage right behind the wings, which the MD-90 lacks and the DC-9 usually has."
    ],
    "Metroliner": [
        "Fixed landing gear (in some models)",
        "Landing gear position (retractable gear in the wings for Metroliner)",
        "Smaller, regional airline markings or livery",
        "commuter airline livery",
        "Twin turboprop engines (Metroliner)",
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "Fixed (non-retractable) landing gear on some models",
        "Landing gear positioned under the wings",
        "High horizontal stabilizer (T-tail) ",
        "Turboprop engines on the wings",
        "Propeller-driven engines ",
        "landing gear with fairings",
        "More angular and less sleek appearance compared to a Gulfstream",
        "T-tail design (Metroliner)",
        "Wing configuration (Metroliner: low-wing configuration; BAE 146: high-wing configuration)"
    ],
    "PA-28": [
        "Fixed landing gear (usually)",
        "fixed landing gear (most models)",
        "Small, single-engine design",
        "single-engine configuration",
        "Single-engine design",
        "Single-engine aircraft",
        "Fixed landing gear",
        "Landing gear: The PA-28 usually has fixed tricycle landing gear with the nose wheel located under the nose, while the DR-400 also has fixed tricycle landing gear but with slight design differences.",
        "The tail section with a more traditional, less swept-back design",
        "Absence of high-mounted wings or twin engines on the wings",
        "Number of engines (PA-28 typically has one propeller engine; A300 has two jet engines)",
        "Smaller, more compact body design in PA-28 vs. larger, spacious body in A310",
        "smaller size",
        "**Canopy Design:** The PA-28 often has a more traditional, smaller cockpit side window design compared to the larger, single-piece bubble canopy of the SR-20.",
        "Private aircraft markings instead of commercial airline livery"
    ],
    "SR-20": [
        "Cirrus Aircraft logo",
        "Cirrus logo",
        "Generally used for personal or flight training purposes",
        "Cirrus Airframe Parachute System (CAPS) handle",
        "Single-engine piston aircraft",
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Smaller, single-engine aircraft design",
        "Single-engine (propeller) aircraft",
        "Single propeller at the front",
        "Fixed landing gear",
        "fixed landing gear",
        "Single propeller at the nose",
        "T-tail configuration (PA-28 has a conventional tail)",
        "Four-seater cockpit",
        "single-engine propeller"
    ],
    "Saab 2000": [
        "Presence of winglets at the tips of the wings (Saab 2000)",
        "Number of propellers (Saab 2000 typically has 4 or 5 blades on its propellers.)",
        "Logo and branding (Airlines operating these aircraft may have distinct liveries.)",
        "Typically equipped with 5-bladed propellers (ATR-72 usually has 6-bladed propellers)",
        "T-tail design but different in shape compared to Saab 2000",
        "Winglets on the wingtips",
        "Turboprop engines (two propellers)",
        "Six-bladed propellers (compared to the 340's four-bladed propellers)",
        "General aircraft livery and airline branding (if visible)",
        "Swept wings",
        "Fewer windows along the side (around 50 seats vs. around 70 seats in ATR-72)",
        "Sleeker, more streamlined fuselage",
        "slightly pointed nose",
        "Low-wing configuration",
        "Jet engines (no propellers)"
    ],
    "Saab 340": [
        "**Fuselage Length**: The Saab 2000 has a longer fuselage compared to the Saab 340.",
        "Saab logo or specific airline livery indicative of Saab 340 operators",
        "**Landing Gear**: Differences in the landing gear configuration can also be observed, with the Saab 2000 typically having a more robust design owing to its higher performance characteristics.",
        "**Propellers**: The Saab 340 has two turboprop engines with large, visible propellers, while the Embraer ERJ 145 has jet engines without propellers.",
        "Two Pratt & Whitney Canada PW100 series engines with longer nacelles",
        "**Landing Gear**: The landing gear of the Saab 340 is typically more prominent and may be more visible in photos compared to the sleeker design of the landing gear of the Embraer ERJ 145.",
        "Lower landing gear structure",
        "Smaller size compared to the BAE 146",
        "T-tail design",
        "**Fuselage Length**: The Saab 340 has a shorter, stubbier fuselage compared to the longer, more slender fuselage of the Embraer ERJ 145.",
        "**Wing Position**: The wing of the Saab 2000 is somewhat redesigned for better performance and can look slightly different in mounting and design compared to the Saab 340.",
        "**Propeller Blades**: The Saab 2000 usually features 6-blade propellers, whereas the Saab 340 generally has 4-blade propellers.",
        "T-tail configuration",
        "Distinctive T-tail",
        "Smaller size (typically fewer than 40 passengers)"
    ],
    "Spitfire": [
        "Classic tailplane (Spitfire) vs. swept-back tailplane (Hawk T1)",
        "piston engine exhaust stacks",
        "Canopy with a more classic, rounded design",
        "Single-engine piston aircraft",
        "Lack of turboprop engines",
        "WWII-era military markings and camouflage",
        "Elliptical wings (Spitfire) vs. straight wings with slight sweepback (Hawk T1)",
        "Lack of modern avionics and weapons systems",
        "Exhaust stacks on the sides of the nose",
        "Tailwheel undercarriage",
        "Rounded tail fin and horizontal stabilizer",
        "Narrow landing gear (retractable)",
        "tailwheel landing gear",
        "Tailwheel landing gear",
        "Propeller blades (typically three-bladed for early models)"
    ],
    "Tornado": [
        "Camouflage or gray paint scheme (typical of military aircraft)",
        "Camouflage paint scheme",
        "smaller, more compact airframe",
        "Canopy for pilot and co-pilot",
        "Military jet profile",
        "absence of wings or fuselage",
        "absence of solid structure and wings typical of aircraft",
        "twin-engine configuration",
        "Twin-engine configuration",
        "single or tandem cockpit configuration",
        "military jet design",
        "Compact and aerodynamic airframe",
        "Swept wings",
        "sleek, aerodynamic fuselage",
        "camouflage or gray paint scheme"
    ],
    "Tu-134": [
        "Windows arrangement: The Tu-134 might have a different alignment and number of passenger windows compared to the Boeing 727.",
        "Landing gear located in pods on rear fuselage (Tu-134)",
        "Length and fuselage: The Tu-134 is generally shorter in length compared to the Boeing 727.",
        "Wing placement: Both have low-mounted wings, but the details in wing design differ.",
        "Fuselage Length: The Tu-134 has a shorter fuselage in comparison to the longer Tu-154.",
        "narrower fuselage (Tu-134)",
        "Distinctive nose shape with radar dome (in Tu-134)",
        "Number of Engines: The Tu-134 has two engines mounted at the rear, while the Tu-154 has three engines, with one in the tail and two under the wings.",
        "Landing Gear: The landing gear of the Tu-134 typically retracts into pods on the wings, while the Tu-154’s gear retracts into the fuselage.",
        "Distinctive glass navigator's nose",
        "More compact fuselage",
        "Number and configuration of engines: The Tu-134 typically has two rear-mounted engines, while the Boeing 727 has three engines—one on each side of the rear fuselage and one at the base of the fin.",
        "Glass nose or radar dome at the front (depending on the variant)",
        "3-wheeled main landing gear (Tu-134)",
        "Rear-mounted engines (closer to the fuselage in the Tu-134)"
    ],
    "Tu-154": [
        "Landing gear configuration (Tu-154 has a different setup compared to the Boeing 707)",
        "A sleeker, more modern appearance with less sweep on the wings",
        "Wing sweepback angle is more pronounced",
        "Narrow-body: The Tu-154 is a narrow-body jet, whereas the A340 is a wide-body jet.",
        "Swept-back wings with pronounced anhedral (downward angle)",
        "Longer fuselage in comparison to the DC-9",
        "Main landing gear in the wings and tail region",
        "National or airline markings typical of Russian or Eastern Bloc aviation during its era",
        "Number and spacing of cabin windows: The Tu-154 often has less spacing between windows compared to the Boeing 727.",
        "Shorter, more rounded nose compared to the DC-8",
        "Swept wings",
        "Smaller overall size and executive jet appearance",
        "A narrower fuselage relative to the Tu-154",
        "Swept wings positioned slightly lower on the fuselage without wing fences or winglets",
        "Cockpit window shape: The cockpit windows on the Tu-154 might have different shapes and arrangements compared to the 727."
    ],
    "Yak-42": [
        "No propellers (Saab 2000 is a turboprop aircraft, while Yak-42 is a jet)",
        "lack of visible propellers (ATR-72 has two propellers)",
        "Landing gear (Yak-42's landing gear configuration differs from that of Saab 340's)",
        "Tail design (Yak-42 has a T-tail, Saab 340 has a conventional tail)",
        "Number of engines (Yak-42 has three jet engines, Saab 340 has two propeller engines)",
        "Engine type (Yak-42 has jet engines, Saab 340 has turboprop engines)",
        "Wing placement (Yak-42 has low-wing configuration, Saab 340 has high-wing configuration)",
        "Smaller overall size and wingspan compared to the Boeing 717",
        "single-aft entry door vs. multiple side entry doors on the ATR-72",
        "Wing-mounted air brakes (Yak-42 has these, while the Tu-134 does not)",
        "Designated winglets or different wing shapes",
        "Yak-42 generally has fewer windows along the fuselage than the Tu-154",
        "Presence of winglets on later models",
        "Main landing gear of Yak-42 retracts into fuselage pods, whereas Tu-154's retract into the wings",
        "Distinctive nose shape with a sharper point compared to the rounded nose of a BAE-125"
    ]
}