{
    "A300": [
        "Airbus logo or livery markings",
        "Lack of wingtip fences or sharklets (classic A300s)",
        "Airbus logo or markings on the aircraft",
        "Winglets (depending on the model/version of A300)",
        "Airbus logo or markings",
        "Tail design (differences in vertical stabilizer and rudder)",
        "A300 typically does not feature a T-tail (MD-90 has a T-tail configuration)",
        "Airbus A300 logo or markings if visible",
        "Winglets at the wingtips (depending on the version)",
        "Signature Airbus \"bulbous\" nose shape",
        "different engine types (A300 typically has older engine models)",
        "Slight dihedral wings (wings angled slightly upwards) ",
        "Number of windows: The A300 generally has more cabin windows due to its longer fuselage.",
        "Winglets (on some models, though not as pronounced as modern aircraft)",
        "A broader and shorter fuselage relative to the A320"
    ],
    "A310": [
        "Winglets on the wings if present (later models may have them).",
        "Absence of the distinctive tail engine found on the DC-10",
        "A wider and shorter fuselage compared to the DC-8.",
        "Smaller size",
        "Two engines mounted under the wings, rather than four engines.",
        "T-tails (tailplane)",
        "Two engines instead of four",
        "Shorter fuselage",
        "shorter fuselage",
        "Single full passenger deck (no partial upper deck as in some larger aircraft)",
        "winglets on the wingtips (present on some A310 models)",
        "single elevator on the horizontal stabilizer",
        "Winglets at the end of the wings (on some models)",
        "distinctive tailcone shape (more pointed on A310)",
        "Winglets on the A310, which are usually absent on the DC-10"
    ],
    "A320": [
        "Winglets: A320 typically features \"sharklet\" winglets which are taller and more curved, while older models of the Boeing 737 might have smaller, split-tip winglets.",
        "Airbus logo or specific airline livery known to operate A320s",
        "Winglets with a vertical upturn instead of raked wingtips (common in some 767 models)",
        "Distinctive Airbus nose shape (more rounded compared to the 767's more pointed nose)",
        "Engine shape: The engines on the A320 usually have a flatter bottom, while the engines on the Boeing 737 tend to be more circular or oval.",
        "landing gear design (A320 has a simpler main landing gear structure)",
        "sharklets (tip extensions) on wings (A320 typically has these)",
        "Winglets: The A320 typically has smaller, sharklet winglets, while the A330 often features larger, more curved winglets.",
        "registration number (Airbus A320 models usually start with an \"F\" in the registration markings for commercial aircraft from Europe, while U.S. aircraft start with an \"N\")",
        "Sharklet winglets  ",
        "Number of engines: Both have two engines, but the A320 engines are generally smaller.",
        "Winglets on the ends of the wings",
        "Landing gear: The main landing gear of the A320 retracts outward into the wings, whereas on the Boeing 737, it retracts forward into the fuselage.",
        "The absence of an extra set of landing gear near the wing roots  ",
        "T-tail design"
    ],
    "A330": [
        "**Wingtips:** A330 typically has wingtip devices known as winglets or sharklets, while early models of the Boeing 737 have no winglets and later models may have split scimitar winglets.",
        "**Livery and Logos:** Identifiable airline branding might provide clues specific to the types of aircraft they predominantly use.",
        "Winglets: The A330 often features larger, more prominent winglets compared to the A310.",
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "Number of engines: A330 has two engines, while A380 has four.",
        "Airbus branding or insignia on the fuselage",
        "Rounded, bulbous nose",
        "Engine size: The A330 typically has larger engines compared to the A310.",
        "Typically a slightly shorter and higher tail compared to the Boeing 767",
        "Winglets with a distinctive upward curve (sharklets)",
        "Different wingtip design (depending on the variant)",
        "Tail height: The vertical tail fin of the A330 is often taller than that of the A310.",
        "Newer design with longer range and more passenger capacity",
        "The shape of the tail cone",
        "Distinctive winglets"
    ],
    "A340": [
        "Four engines: The A340 has four engines, while the A310 has two.",
        "Winglets: The A340 often features winglets, which are absent in the A310.",
        "Different tail configurations (the A340 often has a slightly higher vertical stabilizer)",
        "Winglets shape (A340 winglets are different compared to A320)",
        "Four engines (A340 has four engines, whereas Boeing 757 has two)",
        "The A340 has a longer fuselage with a different window arrangement compared to the 777",
        "More modern and sleek fuselage design",
        "Number of doors: The A340 typically has more passenger doors due to its longer length.",
        "Aircraft tail height (A340 generally taller)",
        "Winglets (A340 often has winglets that are upward-angled)",
        "Four engines (A340 has four engines, while the Boeing 777 has two)",
        "Airbus logo on the tail or fuselage (if visible)",
        "Longer fuselage relative to wing size (A340 tends to have a lengthier appearance)",
        "Wingspan (A340 has a larger wingspan than A320)",
        "Slightly larger size and more elongated shape"
    ],
    "A380": [
        "Distinctive hump due to the upper deck extending towards the tail.",
        "The Airbus logo near the front section",
        "A distinctive hump at the front of the plane where the upper deck ends",
        "larger, more rounded nose",
        "Distinctively larger and more rounded nose",
        "absence of a hump on the upper deck (Boeing 747 has a distinctive hump)",
        "Distinctive hump on the upper deck (A380)",
        "The A380 often has a more bulbous nose compared to the sleeker nose of the Boeing 757",
        "Larger size and wingspan (A380)",
        "Generally more massive and larger fuselage",
        "Emirates and other specific airlines' logos often associated with A380",
        "Wingtip fences or winglets that are larger and more vertical",
        "Bulbous nose",
        "Distinctive hump on the upper deck",
        "Distinctive hump running the entire length of the fuselage"
    ],
    "ATR-42": [
        "Four-bladed propellers (ATR-42 usually has four-bladed, Fokker 50 has six-bladed)",
        "Shape of the nose: The ATR-42 generally has a more rounded nose.",
        "Propeller engines (ATR-42 has turboprop engines, while BAE-125 has jet engines)",
        "Different engine nacelle shapes (ATR-42 has more teardrop-shaped nacelles)",
        "Nose shape: The ATR-42 has a more rounded nose, whereas the DHC-6 has a more angular shape.",
        "No T-tail, as the horizontal stabilizer is at the base of the vertical stabilizer",
        "More modern, sleeker appearance",
        "Shorter landing gear",
        "Twin-engine configuration (the An-12 has four engines)",
        "Size: The ATR-42 is larger in size and length compared to the DHC-6.",
        "Single overwing emergency exit on each side",
        "Twin turboprop engines",
        "Rounded, shorter nose",
        "Engine nacelles more streamlined",
        "Single vertical stabilizer"
    ],
    "ATR-72": [
        "Four jet engines mounted on pylons under the wings.",
        "High-wing configuration as well but with jet engines.",
        "Four-blade propellers (as opposed to six-blade for Fokker 50)",
        "Sharper, more angular tail: The ATR-72 features a prominent, angular vertical stabilizer.",
        "A noticeably T-shaped tail with a horizontal stabilizer set atop the vertical stabilizer.",
        "A more compact, rounded fuselage.",
        "Airline livery or logos (if present)",
        "Swept-back vertical stabilizer",
        "High-wing configuration: The ATR-72 has wings mounted high on the fuselage.",
        "Absence of jet engines mounted at the rear of the fuselage",
        "Longer, narrower fuselage: The ATR-72 has a sleeker, elongated fuselage compared to the stubbier appearance of the BAE 146.",
        "Longer fuselage: The ATR-72 has a longer fuselage compared to the ATR-42.",
        "Longer fuselage for passenger cabin (indicative of a regional airliner)",
        "Number of engines (both have two, but different types)",
        "Four-blade propellers"
    ],
    "An-12": [
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "Ramp/cargo door on An-12",
        "Propellers: The An-12 has four turboprop engines with visible propellers, while the A300 has two jet engines.",
        "Four turboprop engines",
        "Shorter fuselage than MD-11",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "Landing gear (An-12 has retractable landing gear, PA-28 usually has fixed gear)",
        "Four turboprop engines mounted on the wings, versus the two turbofan engines of an A320",
        "Four turboprop engines versus one piston engine",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "An-12 has a rear loading ramp, while DHC-1 does not",
        "Fuselage: The An-12 has a bulkier, more rugged-looking fuselage, while the A300 has a more streamlined, modern design.",
        "Soviet-era design aesthetics, often more angular and utilitarian compared to the sleek and modern appearance of an A320",
        "Larger fuselage and cargo capacity in An-12"
    ],
    "BAE 146": [
        "fewer propellers (since Saab 340 is a turboprop aircraft)",
        "Steeper landing gear",
        "Steep landing and takeoff capabilities",
        "four engines (two on each wing)",
        "Longer main landing gear legs and slightly shorter aircraft length compared to a DC-9",
        "Landing gear: multiple wheels on main gear (BAE 146) vs simpler landing gear (BAE-125)",
        "Landing gear configuration (BAE 146 has landing gear that retracts into pods on the fuselage; Dash 8 has landing gear that retracts into the engine nacelles)",
        "Steeper nose profile",
        "Stubbier, more rounded nose",
        "Distinctive airbrake on the tail (sometimes deployed)",
        "High wing position relative to the fuselage",
        "T-tail configuration",
        "**Landing Gear Configuration:** The main landing gear on the BAE 146 retracts into fairings on the wings, while the Embraer ERJ 145’s retracts into the fuselage.",
        "Low-wing configuration",
        "Four engines mounted under the wings"
    ],
    "BAE-125": [
        "small, twin-engine business jet",
        "Fewer windows, typically associated with business jets",
        "Brand logos and registration markings: Look for specific airline logos, registration numbers, or other identifiers that might be visible on the aircraft.",
        "Jet engines instead of turboprops",
        "winglets at the tips",
        "Straight wings with winglets or no winglets at all",
        "Propeller engines",
        "**Branding and Markings**: The BAE-125 often has corporate or private livery, whereas the DC-8 typically features commercial airline branding.",
        "lacks propellers (as ATR-72 is a turboprop)",
        "Swept-back wings with winglets",
        "Distinctive larger and more prominent winglets (on some models)",
        "Engine placement: The BAE-125 has engines mounted on the rear fuselage, while the ERJ 145 also has rear-fuselage-mounted engines but can be identified by their specific placement and size.",
        "swept wings",
        "smaller size and sleeker design",
        "Wing-mounted engines (turboprop in most cases)"
    ],
    "Beechcraft 1900": [
        "Twin turboprop engines (as opposed to jet engines on the Legacy 600)",
        "Beechcraft logo or specific airline markings (if visible)",
        "Straight wings rather than swept wings",
        "Single crew door on the left side of the fuselage",
        "Smaller size with a length of approximately 57 feet",
        "More pronounced nose",
        "T-tail structure",
        "T-tail configuration",
        "Fixed landing gear visible when the aircraft is in the air",
        "Landing gear configuration",
        "Twin propellers instead of jet engines",
        "Straight winglets on Beechcraft 1900 vs. raked or no winglets on Embraer ERJ 145",
        "Twin turboprop engines located on the wings",
        "Twin turboprop engines",
        "Narrower fuselage"
    ],
    "Boeing 707": [
        "Swept-back tail fin",
        "T-tail design (707’s tail design is slightly different)",
        "Older liveries often found on 707 models compared to newer liveries on 717 models",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)",
        "Fuselage length: The Boeing 707 typically has a longer fuselage than the Boeing 727.",
        "Narrower fuselage compared to modern 737 versions",
        "T-tail tailplane",
        "Wings: The Boeing 707's wings are higher and more swept than the 727's.",
        "Smaller fuselage diameter in Boeing 707",
        "Larger fuselage",
        "Single-deck fuselage",
        "Larger and more pronounced tail fin",
        "T-tail design present in DC-10 versus conventional tail design in Boeing 707",
        "Location of the wings: On certain Boeing 707 models, the wings may appear slightly higher on the fuselage compared to the DC-8.",
        "Four engines under the wings"
    ],
    "Boeing 717": [
        "Modern livery: Boeing 717 typically has more modern airline liveries compared to the older liveries commonly found on DC-9 aircraft.",
        "Distinctive Boeing 717 branding and livery (depending on airline)",
        "Length: The Boeing 717 is longer compared to many variants of the DC-9.",
        "Nose shape (more pointed on the Boeing 717)",
        "Smaller winglets or none, compared to MD-80 variations",
        "Winglets (if present, though some 717s may not have winglets)",
        "Newer design and more modern appearance",
        "Absence of a third engine in the tail section",
        "Nose landing gear doors: The Boeing 717 often has larger and differently shaped nose landing gear doors compared to the DC-9.",
        "Winglets (optional but more common in retrofitted 717s)",
        "Fuselage Shape: The Boeing 717 typically has a shorter and more slender fuselage compared to most versions of the Boeing 737.",
        "Smaller fuselage",
        "Winglets at the wingtips (optional on Boeing 717 but not available on Fokker 100)",
        "Nose Shape: The Boeing 717 has a slightly more pointed nose compared to the Boeing 737, which has a more rounded nose.",
        "Lack of winglets"
    ],
    "Boeing 727": [
        "Winglets (in some models, but not all)",
        "Shorter fuselage compared to the 757",
        "Smaller winglets or sometimes none at all",
        "Smaller and shorter landing gear compared to the 737",
        "Longer fuselage compared to Boeing 717",
        "Slightly swept wings with fewer pylons for engines",
        "Conventional low tail",
        "Boeing 727 often has a more pointed nose",
        "Typically older and having a more retro design style",
        "More contemporary and newer design styles",
        "Longer, more slender fuselage",
        "Narrow body",
        "Additional wing-mounted landing gear (in some variants)",
        "T-tail configuration ",
        "Generally shorter wingspan and fuselage length compared to most DC-8 models"
    ],
    "Boeing 737": [
        "Specific registration and airline liveries, often related to the aircraft model",
        "Winglets: Check the winglets if present. The Boeing 737 may have blended winglets or split scimitar winglets, while the Boeing 757 often has winglets with a steeper angle.",
        "Winglets on the wingtips (depending on the model and generation)",
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)",
        "Length of the fuselage (737 tends to be longer than 717)",
        "Winglets on the wingtips (specific models)",
        "Winglets at the wingtips (737s often have winglets, 717s typically do not)",
        "pointed nose design",
        "Number of engines (Boeing 737: two engines; Boeing 727: three engines)",
        "Winglets on the wingtips in many models",
        "Aircraft nose shape (Boeing 737 generally has a more rounded nose)",
        "Tail fin design",
        "Distinctive wing-mounted engines (closer to the wings)",
        "Distinctive pointed nose shape",
        "Winglets: Boeing 737 often has distinctive upward-curved winglets, whereas most DC-8s do not."
    ],
    "Boeing 747": [
        "Shorter and less pronounced landing gear (767)",
        "Winglets at the ends of the wings (depending on specific 747 model)",
        "Swept-back wings with a larger span",
        "The A330 typically has two engines",
        "Distinctive nose shape, flatter and broader compared to the A340",
        "Winglets on the ends of the wings (in newer models)",
        "Shorter and more robust fuselage compared to the more elongated fuselage of the 757",
        "pronounced wing sweep",
        "Single-deck fuselage without a hump (767)",
        "Distinctive hump on the upper deck near the front",
        "Distinctive hump-like upper deck that extends only partway along the fuselage",
        "Hump on the upper deck (747)",
        "hump on the upper deck",
        "Hump on the upper deck",
        "more prominent winglets"
    ],
    "Boeing 757": [
        "Shorter landing gear and tail height",
        "T-tail absent",
        "Shorter landing gear",
        "winglets at the wingtips (on most 757 models)",
        "Longer, more slender fuselage",
        "Tail (vertical stabilizer) typically higher and more swept-back",
        "No winglets",
        "Wing span: The 757 has a narrower wingspan compared to the 767.",
        "Tail design (Boeing 757 vertical stabilizer is more angular)",
        "Landing gear: The Boeing 757 has a noticeable difference in the landing gear configuration compared to the Boeing 767.",
        "taller landing gear",
        "Taller landing gear",
        "Length of fuselage (Boeing 757 is longer)",
        "Distinctively long landing gear",
        "**Wingspan**: The Boeing 777 has a larger wingspan than the 757."
    ],
    "Boeing 767": [
        "Length: The Boeing 767 is usually longer than the A320.",
        "Winglets on the tips of the wings (in some models)",
        "Tail Height: Boeing 767 has a shorter tail height compared to the Boeing 777.",
        "Winglets that are typically larger on the 757 (if both are equipped with winglets)",
        "The shape of the nose (the 767 has a more pointed nose compared to the 747)",
        "winglets",
        "Winglets at the tips of the wings (in newer models)",
        "Taller landing gear (767 has a higher stance)",
        "Wingspan: Boeing 767 has a shorter wingspan compared to the Boeing 777.",
        "tail fin shape",
        "Lack of a noticeable hump on the upper fuselage",
        "The location and shape of the tail fin and horizontal stabilizers",
        "More prominent wingspan",
        "Presence of a larger wingspan",
        "A wider fuselage (767 is a wide-body aircraft)"
    ],
    "Boeing 777": [
        "**Wingspan**: The Boeing 777 has a larger wingspan.",
        "**Fuselage Shape**: The Boeing 777 has a wider fuselage.",
        "Fuselage: Boeing 777 has a longer, wider fuselage.",
        "Engine count: Boeing 777 has two engines, while the Airbus A340 has four engines.",
        "Fuselage shape: The Boeing 777 has a wider, more rounded fuselage in contrast to the narrower fuselage of the Boeing 737.",
        "Engine: Boeing 777 has larger, twin engines under the wings.",
        "Winglets: Boeing 777 typically does not have winglets, while the A340 often features winglets.",
        "Tail: The vertical stabilizer and horizontal stabilizers on Boeing 777 are larger.",
        "Wingtip design: Many Boeing 777 models feature raked wingtips, whereas the Boeing 737 often has winglets.",
        "larger, more rounded nose",
        "Modern, more streamlined design (Boeing 777)",
        "Wingspan: Boeing 777 has a wider wingspan compared to Boeing 717.",
        "Engine size and shape: The Boeing 777 typically has larger, more rounded engines.",
        "Distinctive rounded nose shape",
        "Raked wingtips (A330 has winglets)"
    ],
    "C-130": [
        "Two piston engines",
        "Shorter, stockier landing gear suited for rough airstrips",
        "Bulky and shorter fuselage",
        "Squared-off fuselage rear for loading and unloading cargo",
        "Wide, boxy fuselage",
        "Sleek, modern appearance suitable for commercial aviation",
        "Four turboprop engines",
        "No rear loading ramp, designed for passenger or freight transport",
        "Smaller and narrower fuselage",
        "Shorter fuselage",
        "Shorter and more robust fuselage",
        "Loading ramp at the rear",
        "Larger fuselage",
        "T-tail structure",
        "Tailwheel landing gear configuration"
    ],
    "C-47": [
        "Shorter fuselage: The C-47 has a shorter fuselage than the DC-6.",
        "Two engines: The C-47 has two engines, whereas the DC-6 has four.",
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "Landing gear: The C-47 features a tailwheel landing gear configuration, while the DC-6 typically has a tricycle landing gear system.",
        "Tailwheel landing gear",
        "Propellers (C-47 has propellers, A310 has jet engines)",
        "Tailwheel landing gear configuration",
        "Tail wheel landing gear",
        "Landing gear with tailwheel configuration",
        "Straight, non-swept wings",
        "retractable landing gear",
        "larger wingspan relative to fuselage",
        "Piston engine pods on wings",
        "Cargo doors and paratroop jump doors",
        "Position and number of windows: The C-47 generally has fewer and more evenly spaced windows along its fuselage compared to the DC-6."
    ],
    "CRJ-200": [
        "T-tail configuration but with more pronounced tail structure",
        "Size and Length: The CRJ-200 is smaller and shorter than the MD-90.",
        "A single propeller engine mounted at the front",
        "Absence of winglets (on most CRJ-200 models)",
        "Wings: The wings of the CRJ-200 are mounted lower on the body compared to the MD-90.",
        "Winglets on the tips of the wings",
        "different tail height",
        "No winglets on many models",
        "Distinctive sharp, pointed nose",
        "single overwing emergency exit on each side",
        "T-tail configuration",
        "T-tail configuration ",
        "Larger size, typically used for regional airline services",
        "Rounder, less pointed nose",
        "Absence of winglets"
    ],
    "CRJ-700": [
        "Larger, more pronounced winglets",
        "Different landing gear configuration (the CRJ-700 has taller landing gear)",
        "T-tail configuration",
        "Winglets or small vertical extensions at the wingtips",
        "T-tail structure with slight differences in size and angle",
        "Winglets on the tips of the wings",
        "Classic, older aircraft design features",
        "More complex landing gear structure",
        "Winglets on the wingtips",
        "Shorter and more pointed nose",
        "Winglets at the tips of the wings (though some CRJ-200 models can also have them, they are more common on the CRJ-700)",
        "Tail Design: The CRJ-700 typically features a T-tail design, while the MD-80 often has a low tailplane or horizontal stabilizer.",
        "Generally absence of winglets",
        "Landing gear configuration",
        "T-tail design"
    ],
    "Cessna 172": [
        "Fixed landing gear (compared to the often retractable gear on the DHC-1)",
        "Traditional ‘tail-dragger’ or tricycle gear setup",
        "Fixed landing gear",
        "fixed landing gear",
        "Generally found in a lighter, simpler paint scheme",
        "Tailwheel or tricycle landing gear configuration",
        "Tricycle landing gear (nose wheel included)",
        "Fixed, non-retractable landing gear",
        "Type of landing gear (Cessna 172 has fixed landing gear, while Cessna 208 can have either fixed or retractable landing gear)",
        "Taildragger landing gear (main two wheels in front, small third wheel at the tail)",
        "Tail design (Cessna 208 has a more pronounced, vertical tail stabilizer compared to the 172)",
        "Tricycle landing gear with a single nose wheel",
        "Smaller size and simpler design",
        "Smaller size and more compact",
        "Conventional tail with a single vertical stabilizer"
    ],
    "Cessna 208": [
        "Single-engine propeller (Cessna 208) vs. twin-engine turboprop (Dash 8)",
        "High-wing design (Cessna 208) vs. low-wing design (Dash 8)",
        "Shorter fuselage compared to Beechcraft 1900",
        "Fixed landing gear (Cessna 208) vs. retractable landing gear (Dash 8)",
        "Number of seats (Cessna 208 seats up to around 14, Boeing 737 seats over 130)",
        "fixed landing gear",
        "Fixed landing gear",
        "sleeker, more compact fuselage",
        "Fixed landing gear (non-retractable)",
        "Smaller size and capacity (Cessna 208) vs. larger and typically used for regional flights (Dash 8)",
        "Turboprop engine rather than jet engines",
        "Longer fuselage compared to Cessna 208",
        "Single turboprop engine",
        "Size of the aircraft (Cessna 208 is significantly smaller)",
        "Twin-engine turboprop"
    ],
    "Cessna Citation": [
        "**Tail design:** Cessna Citations usually have a T-tail design.",
        "**Size:** Cessna Citations are generally smaller.",
        "**Distinctive Features:** Check for any model-specific features or markings.",
        "**Number of engines:** Cessna Citations typically have two engines.",
        "Winglets on the wingtips (on some models)",
        "**Nose Shape:** Cessna Citations often have a more pointed nose. ",
        "winglets on some models",
        "Distinctive winglets (depending on specific Cessna Citation model)",
        "landing gear configuration",
        "**Engine position**: Cessna Citation typically has engines mounted on the rear fuselage, while Beechcraft 1900 has engines mounted on the wings.",
        "**Wing configuration**: The Cessna Citation usually has a straight wing design, whereas the Beechcraft 1900 has a low-wing design.",
        "swept wings",
        "Swept wings",
        "**Shape of fuselage:** Cessna Citations have a more compact fuselage.",
        "**Tail design**: The Cessna Citation often features a T-tail configuration, whereas the Beechcraft 1900 has a conventional tail design."
    ],
    "Challenger 600": [
        "Winglets that are less pronounced or sometimes absent",
        "Swept-back wings",
        "T-tail configuration on Challenger 600",
        "Challenger 600 typically has a sleeker, more streamlined appearance",
        "Distinctive, shorter landing gear",
        "More spacious, shorter landing gear",
        "Winglets may or may not be present (as opposed to the CRJ-700 which consistently has winglets)",
        "T-tail configuration",
        "Twin jet engines (mounted on the rear fuselage) ",
        "Generally smaller overall size compared to the CRJ-700",
        "Commercial or business jet appearance",
        "Distinctive T-tail configuration",
        "Distinctive rounded nose",
        "Rear-mounted engines",
        "Larger, tail-mounted engines"
    ],
    "DC-10": [
        "landing gear (DC-10 has retractable tricycle landing gear, DC-3 has fixed landing gear)",
        "Tail design: The DC-10 has a T-tail design, while the DC-8 has a more traditional tailplane.",
        "Less pronounced curve or angle in the nose section compared to the MD-11",
        "More rounded nose compared to the more pointed nose of the DC-9",
        "Larger wingspan and overall size.",
        "T-tail configuration.",
        "Three engines: one under each wing and one at the base of the vertical stabilizer.",
        "Wider fuselage.",
        "number of engines (DC-10 has three, while DC-3 has two)",
        "Three engines (one on each wing and one at the base of the vertical stabilizer)",
        "fuselage shape (DC-10 has a wider, more modern fuselage)",
        "Three engines (one in each wing and one at the base of the vertical stabilizer)",
        "Three engines: one on each wing and a third in the tail (distinctive for the DC-10)",
        "Tail engine intake: The DC-10's tail-mounted engine has a prominent S-duct intake design.",
        "Lack of winglets on the wingtips"
    ],
    "DC-3": [
        "Single vertical stabilizer with rudder",
        "Tailwheel (as opposed to nosewheel)",
        "tailwheel landing gear (taildragger)",
        "Tailwheel landing gear (DC-3) instead of tricycle landing gear (DHC-6)",
        "Tailwheel landing gear",
        "Tandem main gear and single tail wheel configuration",
        "Distinctive un-swept, straight wings",
        "absence of a cargo door",
        "Smaller size and shorter fuselage",
        "Smaller size and fuselage",
        "shorter fuselage",
        "Low-wing monoplane design",
        "Number of engines (DC-3 has 2 engines, DC-9 typically has 2 engines located at the rear)",
        "smaller overall size",
        "Twin-engine configuration"
    ],
    "DC-6": [
        "Four engines: The DC-6 has four engines, while the DC-3 has two.",
        "Four propeller engines (DC-6) compared to jet engines (DC-10)",
        "Propeller engines (DC-6) instead of jet engines (DC-9)",
        "Propeller engines (DC-6 has four propeller engines while the Boeing 757 has jet engines)",
        "Tailwheel landing gear (in some variants)",
        "Larger wingspan: The DC-6 has a larger wingspan relative to the DC-3.",
        "More rounded nose (DC-6) compared to the more pointed nose of the DC-9",
        "Four engines (DC-6) as opposed to two (DC-9)",
        "Tail-wheel landing gear",
        "Tail Design: DC-6 has a tricycle landing gear (nose gear), and a vertical stabilizer without a dorsal fillet, while the C-47 has a tailwheel landing gear and a more prominent dorsal fillet on the vertical stabilizer.",
        "Lower ground clearance",
        "Radial engine cowlings",
        "Tricycle landing gear: The DC-6 has a tricycle landing gear configuration (nose wheel), whereas the DC-3 has a tail-dragger landing gear configuration.",
        "Propeller engines ",
        "Propeller engines"
    ],
    "DC-8": [
        "Older, more tapered wing design",
        "Longer, more slender fuselage in the DC-8",
        "Number of engines: The DC-8 typically has four engines, while the DC-10 has three engines.",
        "Presence of wing-mounted fuel tanks (in some DC-8 models)",
        "Distinctive shape of the tail fin and rudder",
        "Four engines mounted under the wings (both have this, but different configurations)",
        "T-tail design (classic feature of DC-8)",
        "The presence of a more prominent wing dihedral angle (DC-8)",
        "Turbojet engines (DC-8)",
        "Single story cabin (compared to the 747's distinctive hump for the upper deck)",
        "Longer fuselage with a more slender appearance",
        "Swept-back wings (DC-8)",
        "Narrower fuselage",
        "Older design with fewer modern aerodynamic features",
        "Lack of T-tail (DC-8 has a conventional tail, whereas DC-9 has a T-tail)"
    ],
    "DC-9": [
        "Limited number of emergency exits (typically 3 on each side)",
        "No winglets at the wingtips (whereas many Boeing 767 models have winglets)",
        "Sleeker, more modern fuselage",
        "Jet engines (as opposed to propellers)",
        "Absence of aerodynamic improvements like winglets",
        "Lower tail height in comparison to the MD-80",
        "Landing gear with a simpler, single-bogey main gear setup",
        "Generally simpler, more compact appearance",
        "Fewer sets of landing gear (typically two main landing gears compared to the 727's three)",
        "Number of engines: The DC-9 has two engines, while the DC-6 has four engines.",
        "Shorter, more narrow fuselage",
        "Absence of an engine on the vertical stabilizer (tail)",
        "T-tail configuration",
        "Shorter fuselage compared to the Boeing 727",
        "Distinctive engine nacelles closer to the tail"
    ],
    "DH-82": [
        "Often painted in bright, eye-catching colors",
        "Fixed tailwheel landing gear",
        "Fixed landing gear with a tailwheel",
        "fixed landing gear with tailwheel",
        "Fixed landing gear with tailwheel",
        "Tailwheel landing gear configuration",
        "radial engine (often visible)",
        "Historic look, often associated with vintage aircraft from the 1930s",
        "Fixed, non-retractable landing gear with a tailwheel",
        "Biplane design (two sets of wings)",
        "Biplane configuration (two sets of wings)",
        "biplane design",
        "Radial engine mounted at the front",
        "fixed landing gear",
        "biplane structure"
    ],
    "DHC-1": [
        "Radial engine cowling (distinctive engine shape)",
        "Tailwheel undercarriage",
        "Conventional tailwheel (tail-dragger) landing gear",
        "Tailwheel landing gear",
        "Number of engines: The DHC-1 has one engine, whereas the A310 has two jet engines.",
        "Smaller size and light aircraft build",
        "Fixed landing gear",
        "Propeller at the front of the aircraft",
        "Landing gear (Conventional gear on DHC-1, Tricycle gear on Hawk T1)",
        "Single-wing (monoplane) design (DHC-1) vs. dual-wing (biplane) design (DH-82)",
        "Vintage, military trainer appearance",
        "Different placement and design of exhausts and air intakes",
        "Tricycle landing gear in some models (DHC-1) vs. taildragger landing gear (DH-82)",
        "Tail design: The DHC-1 has a conventional tail, while the A310 has a T-tail or a conventional tail depending on its variant.",
        "More streamlined and less pronounced engine cowling"
    ],
    "DHC-6": [
        "Sturdy, rugged appearance suitable for STOL (Short Takeoff and Landing) operations",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "Short takeoff and landing (STOL) design features",
        "T-tail (horizontal stabilizer mounted on the top of the vertical stabilizer) ",
        "Longer fuselage designed for carrying more passengers or cargo",
        "Fixed landing gear (non-retractable)",
        "Dual tail fins in the horizontal stabilizer configuration",
        "fixed, non-retractable landing gear",
        "Fixed, non-retractable landing gear (DHC-6)",
        "Twin-engine piston or turboprop engines",
        "Twin-engine setup",
        "Twin-engine turboprop (DHC-6)",
        "Tail design: The DHC-6 has twin tail fins, while the Cessna 208 has a single tail fin.",
        "Engine type (DHC-6 has turboprop engines, DC-8 has jet engines)",
        "Squared-off tail fin (DHC-6 has a distinct, squared-off vertical stabilizer)"
    ],
    "DR-400": [
        "**Bubble canopy**: The DR-400 usually has a clear bubble canopy that provides a panoramic view for the occupants.",
        "retractable gear (in some DR-400 models)",
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "**Fixed landing gear**: The DR-400 typically has non-retractable landing gear.",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "Fixed tricycle landing gear",
        "different door placement (PA-28 has doors on the side, DR-400 tends to be more centralized access)",
        "Tricycle landing gear with the nose wheel set further back",
        "Size: The DR-400 is much smaller compared to the A300.",
        "Canopy opens sideways for pilot and passenger access",
        "Traditional cockpit with mostly analog instruments",
        "Twin-engine turboprop aircraft configuration",
        "Usage: The DR-400 is used for general aviation, while the A300 is designed for commercial airline service.",
        "Retractable tricycle landing gear"
    ],
    "Dash 8": [
        "Distinctive engine nacelles (engine housings on wings) ",
        "Propellers (Dash 8 has turboprop engines, whereas the DC-8 has jet engines)",
        "Landing gear (Dash 8 has larger, more robust landing gear suitable for rugged runways)",
        "Landing gear housed within the engine nacelles",
        "Protruding landing gear (due to high wings)",
        "More boxy fuselage shape",
        "Presence of nacelles for turboprop engines near the wings",
        "Four-bladed propellers (depending on the specific Dash 8 model)",
        "Retractable landing gear",
        "Propeller engines (Dash 8 typically has two propeller engines, BAE-125 has jet engines)",
        "T-shaped tail",
        "Swept, straight wings",
        "Four-bladed propellers",
        "Engine nacelles close to the aircraft body",
        "Stretched fuselage (longer body)"
    ],
    "Dornier 328": [
        "twin turboprop engines (usually visible on the wings)",
        "Rounded, bulbous nose",
        "Turboprop engines (as opposed to jet engines)",
        "Engine placement (Dornier 328 has engines mounted on pylons beneath the wings)",
        "propeller engines",
        "T-tail design on the Dornier 328 vs. conventional tail on the Beechcraft 1900",
        "Two propeller blades on each engine",
        "Four propeller blades on each engine",
        "Wing dihedral (a noticeable upward angle of the wings)",
        "sleeker and more streamlined fuselage",
        "Distinctive propeller shape (often 4-blade on Dornier 328, versus 6-blade on ATR-72)",
        "Distinctive nose shape",
        "T-tail design",
        "T-tail configuration",
        "Nose shape (more rounded and shorter on the Dornier 328)"
    ],
    "EMB-120": [
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Logo or airline markings (often seen on regional jets like EMB-120)",
        "Size and Body Shape: The EMB-120 is a smaller, turboprop aircraft, while the MD-90 is a larger, twin-jet commercial airliner.",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the MD-90 has two jet engines mounted at the rear of the fuselage.",
        "Turboprop engines (propellers) instead of jet engines",
        "Airline Livery: Many MD-90s are painted with commercial airline liveries, while EMB-120s can also be found in regional airline or corporate liveries.",
        "Turboprop engines",
        "turboprop engines",
        "Larger passenger capacity (typically for regional flights)",
        "twin turboprop engines",
        "twin turboprop engines (visible propellers)",
        "Landing Gear: The EMB-120 commonly has its landing gear mounted on the wings and fuselage, while the MD-90's landing gear is mounted under the fuselage and wing roots.",
        "Wing Placement: The EMB-120 has a high-wing design, whereas the MD-90 has a low-wing configuration.",
        "Twin-engine turboprop with engines mounted on the wings",
        "Twin turboprop engines mounted on the wings"
    ],
    "Embraer E-Jet": [
        "Winglets: Embraer E-Jets typically have winglets, while Fokker 100s do not.",
        "absence of propellers (Beechcraft 1900 has twin turboprop engines)",
        "Main Landing Gear: The E-Jets have a shorter, more compact main landing gear compared to the longer and more visible landing gear of the Fokker 100.",
        "Tail Design: The E-Jets usually have a slightly more swept-back horizontal stabilizer and a different tail fin design in comparison to the Fokker 100.",
        "Less pronounced swept wings",
        "Fuselage Shape: The fuselage of the E-Jet is typically sleeker and more streamlined, while the Fokker 100 has a slightly bulkier, older design.",
        "Distinctive \"T-tail\" configuration in some E-Jet models (e.g., E170)",
        "Engines: The E-Jets have engines that are mounted under the wings, whereas the Fokker 100 has rear-mounted engines.",
        "longer landing gear legs",
        "Distinctive T-tail design (in some models)",
        "different winglet design",
        "less pronounced nose shape",
        "Nose Shape: The E-Jets have a more pointed, sleek nose, compared to the more rounded nose of the Fokker 100.",
        "Tapered nose design, not as rounded as the Boeing 737",
        "T-tail configuration"
    ],
    "Embraer ERJ 145": [
        "Length: The ERJ 145 tends to be slightly longer than the CRJ-200.",
        "Length: The ERJ 145 is considerably longer than the Beechcraft 1900.",
        "Smaller overall size compared to CRJ-700",
        "Short and thin landing gear struts",
        "Shorter length (around 98 feet for the ERJ 145)",
        "Winglets: The ERJ 145 often lacks the winglets found on the Legacy 600",
        "T-tail configuration",
        "Smaller engines compared to the Legacy 600",
        "Distinctive pointed nose shape",
        "landing gear configuration",
        "Absence of winglets",
        "T-shaped tail",
        "Single-class cabin configuration with fewer seats",
        "Smaller overall size",
        "Landing gear: Differences in the landing gear configuration can help differentiate between the two aircraft."
    ],
    "Embraer Legacy 600": [
        "Landing gear configuration (Embraer has a different stance and wheel setup)",
        "Swept wings",
        "Longer landing gear",
        "General aircraft size and proportion, Legacy 600 is typically shorter",
        "More pronounced nose shape",
        "T-tail configuration",
        "Winglets: The Legacy 600 usually has a more pronounced upward curve on its winglets compared to the relatively simpler winglets on the E-Jet series.",
        "Slightly elongated and sleek body shape",
        "Winglets on the tips of the wings",
        "Luxurious, executive cabin windows arrangement",
        "Winglets on the ends of the wings",
        "T-tail with smaller size stabilizers",
        "A more rounded nose",
        "Three engines (one on each rear side and one in the tail)",
        "Presence of winglets at wingtips"
    ],
    "Eurofighter Typhoon": [
        "Presence of modern radar and sensor systems",
        "canards (small forward wings near the nose)",
        "civilian livery and design",
        "Canards (small forewings near the front)",
        "presence of underwing stores (weapons or fuel tanks)",
        "Presence of weapons or weapon mounts",
        "military-grade camouflage or gray paint scheme",
        "Presence of various weaponry or missile mounts",
        "Delta wing configuration",
        "delta wing configuration",
        "Delta wing shape of the Eurofighter Typhoon",
        "Delta wing design",
        "Military camouflage or jet grey coloring",
        "Canard foreplanes (small, wing-like structures near the nose)",
        "Single vertical stabilizer (tail fin)"
    ],
    "F-16": [
        "Military markings (e.g., camouflage paint, military insignia)",
        "Presence of weaponry or pylons for attaching bombs/missiles",
        "Use and markings: F-16 is often seen with U.S. Air Force markings, while F/A-18 is commonly marked with U.S. Navy or Marine Corps insignia.",
        "LERX (Leading Edge Root Extensions): Both aircraft have these, but their shapes differ and can be used as distinguishing characteristics.",
        "Compact and agile airframe",
        "smaller size and sleeker profile",
        "Landing gear design: F-16 and F/A-18 have different landing gear configurations and wheel setups.",
        "Smaller size and sharper profile (F-16)",
        "Smaller size compared to commercial aircraft",
        "Delta-shaped wings (or with one vertical stabilizer and two horizontal stabilizers)",
        "Military markings and insignia",
        "Military camouflage or markings",
        "Presence of weapons and external fuel tanks (F-16)",
        "presence of external armament (bombs, missiles)",
        "Single-engine configuration"
    ],
    "F/A-18": [
        "Wingtip missile rails or pylons",
        "Tactical paint schemes (often gray or camouflage) ",
        "Tailhook (for carrier-based landing)",
        "military-grade weaponry and pylons",
        "folding wingtips (for carrier storage)",
        "Camouflage or military livery",
        "external weaponry or pylons for missiles and bombs",
        "tactical camouflage or military markings",
        "swept-back wings with a more aggressive angle",
        "shorter, more robust landing gear",
        "Absence of visible weaponry or military features",
        "Compact and agile design suitable for carrier operations",
        "Twin tail fins (vertical stabilizers)",
        "Distinctive twin vertical stabilizers (tail fins)",
        "Larger landing gear designed for airport runways"
    ],
    "Falcon 2000": [
        "**Winglets**: Some models of the Falcon 2000 have distinct winglets, while the CRJ-200 commonly has raked wingtips or no winglets.",
        "Twin-engine jet vs. single-engine propeller",
        "Manufacturer logo (Dassault for Falcon 2000)",
        "Swept wings with a slight upward angle",
        "Low-wing aircraft vs. low-wing (with visible struts supporting wings)",
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure.",
        "Dassault Falcon logo or markings",
        "Nose shape (sleeker for Falcon 2000)",
        "Winglets on the ends of the wings",
        "Position of engines (mounted on the fuselage for Falcon 2000, not on the wings)",
        "Distinctive winglets on the wingtips (in some models)",
        "**Size and Length**: The Falcon 2000 is generally smaller than the CRJ-200.",
        "Winglets on the wingtips",
        "Sleeker, more modern design",
        "Two jet engines (as opposed to three in the Falcon 900)"
    ],
    "Falcon 900": [
        "Swept-back winglets on the tips of the wings",
        "Dassault Falcon logo or branding",
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "Signature windows characteristic of Dassault Falcon jets",
        "Manufacturer logos or specific livery",
        "More winglets or wing components",
        "T-tail: The Falcon 900 features a distinctive T-tail design.",
        "Distinctive winglets (blended into the wing)",
        "Swept wings (Falcon 900)",
        "Landing gear configuration ",
        "Winglets at the end (Falcon 900)",
        "wing location (low wing for Falcon 900)",
        "landing gear placement",
        "Trijet configuration (three engines)",
        "Distinctive winglets on the wingtips"
    ],
    "Fokker 100": [
        "Winglets: Fokker 100 often has small winglets at the tips, while the DC-9 does not.",
        "Landing gear placement and structure.",
        "Two engines mounted on the rear of the fuselage (Fokker 100 has this configuration).",
        "Absence of a third engine in the tail (Boeing 727 has three engines)",
        "T-tail (horizontal stabilizer mounted on top of the vertical stabilizer).",
        "Tail cone: The design of the tail cone or APU exhaust might be different.",
        "length of the fuselage (Fokker 100 has a longer fuselage)",
        "Usually distinctive serial or model number associated with Fokker 100",
        "T-tail configuration",
        "Overall length differences: Fokker 100 is shorter compared to CRJ-700",
        "Different wing design and landing gear configuration",
        "wing-mounted engines (Fokker 50 has none; it has turboprop engines instead)",
        "T-tail design",
        "Larger size and longer fuselage.",
        "Lack of winglets on the wings (Boeing 757 often has winglets)"
    ],
    "Fokker 50": [
        "4-bladed propellers (Fokker 50) vs. 6-bladed propellers (Dornier 328)",
        "**Propellers**: The Fokker 50 is a turboprop aircraft and has large propellers on its wings, while the Embraer ERJ 145 is a jet and has jet engines.",
        "Propellers: The Fokker 50 has two turboprop engines with visible propellers, whereas the Fokker 70 is a jet aircraft with turbofan engines and no propellers.",
        "Propeller Count: The Fokker 50 typically has twin turboprop engines, while the Saab 2000 also has twin turboprops but may show differences in blade design and count.",
        "Typically four-blade propellers on engines (ATR-42 generally has six-blade propellers)",
        "Four-bladed propellers",
        "Landing Gear: The landing gear configuration of the Fokker 50 could differ; for instance, the number and placement of wheels may vary in comparison to the Saab 2000.",
        "Propellers on the engines, indicating a turboprop aircraft",
        "Two turboprop engines (one on each wing)",
        "Tail Design: The Fokker 50 has a more rounded tail fin, whereas the Saab 2000's tail fin is generally more angular and upright.",
        "Nose Shape: The Fokker 50 often has a more rounded nose, while the Saab 2000 may have a more pointed or sleek nose shape.",
        "Presence of a small \"shark fin\" antenna on top of the fuselage",
        "Twin-turboprop engines",
        "**Engine placement**: The engines on the Fokker 50 are mounted on the wings, whereas the Embraer ERJ 145 has engines mounted on the rear of the fuselage.",
        "Number of engines: The Fokker 50 has two engines mounted on the wings, while the Fokker 70 has two rear-mounted engines."
    ],
    "Fokker 70": [
        "Swept-back wings as opposed to the straighter wings of the Fokker 50.",
        "T-tail configuration.",
        "Turbojet engines mounted on the rear fuselage rather than propellers on the wings.",
        "Landing gear (Fokker 70 has a simpler landing gear setup compared to the Boeing 727)",
        "Lack of a straightforward nose cone seen on the MD-80",
        "Sleek, rear-mounted twinjet design.",
        "Winglets: Some Boeing 737 models have winglets at the tips of the wings, which are less common on the Fokker 70.",
        "Size: The Fokker 70 is generally shorter and smaller than the Boeing 737.",
        "Pointed nose shape",
        "T-tail configuration",
        "Conventional tail (not T-tail)",
        "Low wing design",
        "Landing gear: The Fokker 70 typically has a simpler main landing gear configuration compared to the Boeing 737.",
        "T-tail design",
        "Distinctive larger winglets"
    ],
    "Global Express": [
        "additional antenna arrays and sensors",
        "Landing gear configuration",
        "Landing gear configuration and design",
        "Landing Gear: The Global Express has retractable landing gear with a different configuration compared to the CRJ-200.",
        "manufacturer logo (Bombardier for Global Express, Dassault for Falcon 900)",
        "Window layout (Global Express might have different window spacings or shapes)",
        "distinctive landing gear configuration",
        "Nose shape (Global Express has a more pointed nose)",
        "Swept-back wings",
        "Longer and more pointed nose",
        "landing gear configuration (differences in the setup and design of the landing gear)",
        "more elongated and pointed nose",
        "T-tail configuration",
        "Different engine placement and nacelle design",
        "More rounded nose design"
    ],
    "Gulfstream": [
        "Trijet or twinjet configuration (if specifically the Falcon 2000, it’s a twinjet)",
        "Distinct Gulfstream logo/branding",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Winglets with a different design compared to Gulfstream",
        "landing gear configuration",
        "Wingtip winglets (on some Gulfstream models)",
        "Signature \"G\" logo on tail (if present)",
        "logo/branding",
        "T-tail",
        "winglets",
        "Different nose shape, less pointed than Gulfstream",
        "Distinctive winglets (on newer Gulfstream models)",
        "T-tail configuration",
        "swept-back wings",
        "Swept-back wings"
    ],
    "Hawk T1": [
        "Red Arrows or similar military aerobatics team markings ",
        "Red, white, and blue color scheme (common for Hawk T1 in RAF service)",
        "Military markings or insignia, often used by air forces for training (Hawk T1)",
        "Longer, sleeker fuselage typical of a jet trainer",
        "Single jet engine exhaust at the rear (Hawk T1)",
        "Canopy designed for two tandem seats (instructor and trainee)",
        "Military markings and paint schemes",
        "Single jet engine",
        "Swept-back wings (Hawk T1) vs. straight wings (DHC-1)",
        "Military markings",
        "military color scheme or markings",
        "short landing gear",
        "Military markings or colors",
        "sharp, swept-back wings",
        "Single-engine jet"
    ],
    "Il-76": [
        "Bulky landing gear located in fairings on the fuselage sides",
        "Three engines (two on the wings and one in the tail)",
        "Rear cargo ramp/door",
        "Tall, boxy fuselage",
        "T-shaped tail (horizontal stabilizer located at the top of the vertical stabilizer)",
        "Large, robust landing gear designed for rough airstrips",
        "Military cargo aircraft profile, often with fewer passenger windows",
        "Four engines mounted under the wings",
        "Distinctive radome (dome-shaped weather radar cover) on the nose",
        "Conventional tail (not a T-tail)",
        "Military or cargo markings, often seen on Il-76",
        "Long fuselage with a pointed nose",
        "Four engines mounted on underwing pylons",
        "Generally bulkier and larger fuselage",
        "Distinct, swept-back wingtip design"
    ],
    "King Air": [
        "Propellers (King Air has turboprop engines, while Cessna Citation has jet engines)",
        "Twin jet engines",
        "Propeller engines (King Air has twin turboprop engines, while Falcon 2000 has jet engines)",
        "Twin turboprop engines",
        "Single piston engine",
        "More contemporary design with modern avionics",
        "Turboprop engines with prominent propeller spinners",
        "Propellers: King Air aircraft typically have propellers, while Gulfstream jets are known for their turbofan engines.",
        "Landing gear: The landing gear design and placement might vary between the two, with King Air models often having simpler, less robust landing gear compared to the more substantial gear on Gulfstream jets.",
        "Two turboprop engines mounted on the wings",
        "Wider fuselage for passengers/comfort",
        "Dual front windshields",
        "Retractable landing gear that is more streamlined with the wings",
        "Winglets at the tips of the wings",
        "Engine nacelle shape and location (King Air's engines are mounted under the wings, while Falcon 2000's engines are mounted at the rear of the fuselage)"
    ],
    "L-1011": [
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "Winglets or absence thereof (Boeing 757 often has winglets)",
        "L-1011 often has a more rounded nose compared to the DC-9's more pointed design",
        "Number of engines: The L-1011 typically has three engines, whereas the A340 has four.",
        "Longer landing gear struts",
        "Third engine in the tail cone (L-1011)",
        "More angular-wing planes at the wing root",
        "Three engines (as opposed to four on the DC-8)",
        "Larger wing span in proportion to fuselage compared to A310",
        "Dual main landing gear bogies (each with 2 wheels) on each side",
        "Tail engine (mounted in the vertical stabilizer)",
        "T-tail design on the DC-9 (L-1011 has a conventional tail)",
        "Longer fuselage with a sleeker nose design",
        "Three engines (one on each wing and one at the base of the vertical stabilizer)",
        "Wider fuselage"
    ],
    "MD-11": [
        "Length: The MD-11 is generally longer compared to the MD-80.",
        "Winglets on the tips of the wings (some MD-90 models may not have winglets)",
        "T-tail configuration",
        "Nose shape: the MD-11 has a slightly more pointed nose compared to the A310.",
        "T-tail design (tailplane mounted at the top of the tail fin)",
        "Extended fuselage: the MD-11 typically has a longer fuselage compared to the A310.",
        "a more modern, aerodynamic shape",
        "Tailplane with a smaller span",
        "Sharp, angled winglets (on some models)",
        "Trijet engine configuration (one engine on the tail and two under the wings)",
        "Winglets: the MD-11 has winglets (small vertical stabilizers) at the tips of the wings, whereas the A310 does not.",
        "Different winglets or wingtip design",
        "Longer fuselage compared to the A320",
        "Shorter fuselage compared to the A340",
        "Narrower fuselage"
    ],
    "MD-80": [
        "Landing gear configuration (MD-80 has a more robust landing gear)",
        "Distinctive nose shape (MD-80 has a more pointed nose)",
        "Shorter wingspan without winglets (MD-11 often has winglets)",
        "More modern and sleeker design overall",
        "T-tail configuration (prominent in MD-80)",
        "More slightly swept-back wings",
        "T-tail configuration",
        "Older, more angular design elements",
        "Single overwing emergency exit (while many DC-8s have four overwing exits)",
        "Longer fuselage compared to the Boeing 717",
        "Length of the aircraft (MD-80 is longer)",
        "Aircraft nose shape (MD-80 has a more rounded nose)",
        "Length of the fuselage (MD-80 is longer)",
        "Longer fuselage compared to CRJ-700",
        "T-tail design"
    ],
    "MD-90": [
        "T-tail configuration on the CRJ-700 (not present on the MD-90)",
        "Winglets (some MD-90s have winglets while MD-80s generally do not)",
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "absence of the third engine at the tail (MD-90).",
        "generally smaller size and narrower body of the MD-90.",
        "Delta Airlines branding (specific to some MD-90 aircraft)",
        "Extended fuselage: The MD-90 is longer than the DC-9.",
        "Nose shape: The MD-90 usually has a more pointed nose compared to the A300.",
        "Winglets (on some models)",
        "Length of the aircraft: The MD-90 is typically longer and slimmer than the A300.",
        "T-tail design (MD-90) vs. conventional tail (DC-10).",
        "Fuselage length: The MD-11 has a longer fuselage compared to the MD-90.",
        "Longer, more narrow wings",
        "Tail-mounted engines: The MD-90 typically has engines mounted at the rear of the fuselage.",
        "Length of the fuselage (MD-90 has a longer fuselage)"
    ],
    "Metroliner": [
        "Twin turboprop engines (Metroliner)",
        "Fixed landing gear (in some models)",
        "Landing gear position (retractable gear in the wings for Metroliner)",
        "Smaller, regional airline markings or livery",
        "Propeller-driven engines ",
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "Turboprop engines on the wings",
        "Fixed (non-retractable) landing gear on some models",
        "Smaller size compared to EMB-120",
        "commuter airline livery",
        "twin turboprop engines",
        "Presence of propeller blades on engines",
        "Propellers",
        "landing gear with fairings",
        "Landing gear positioned under the wings"
    ],
    "PA-28": [
        "Fixed landing gear (usually)",
        "fixed landing gear (most models)",
        "Fixed landing gear",
        "**Distinctive Paint Schemes and Logos:** Look for any distinctive paint schemes or logos that might be characteristic of Piper and Cirrus aircraft.",
        "Landing gear: The PA-28 usually has fixed tricycle landing gear with the nose wheel located under the nose, while the DR-400 also has fixed tricycle landing gear but with slight design differences.",
        "Engines: The PA-28 has a single piston engine, whereas the An-12 has four turboprop engines.",
        "Single-engine aircraft",
        "Private aircraft markings instead of commercial airline livery",
        "Small, single-engine design",
        "Number of engines (PA-28 typically has one propeller engine; A300 has two jet engines)",
        "single-engine configuration",
        "Single-engine design",
        "**Canopy Design:** The PA-28 often has a more traditional, smaller cockpit side window design compared to the larger, single-piece bubble canopy of the SR-20.",
        "Wings: The PA-28 has low wings, while the An-12 has high wings.",
        "fewer windows"
    ],
    "SR-20": [
        "Cirrus Aircraft logo",
        "Cirrus logo",
        "Generally used for personal or flight training purposes",
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Single-engine piston aircraft",
        "Cirrus Airframe Parachute System (CAPS) handle",
        "Four-seater cockpit",
        "T-tail configuration (PA-28 has a conventional tail)",
        "fixed landing gear",
        "Fixed landing gear",
        "Single-engine (propeller) aircraft",
        "Smaller, single-engine aircraft design",
        "Single propeller at the front",
        "**Landing Gear:** The SR-20 usually has a nosewheel (tricycle) landing gear configuration, while the EMB-120 also has a tricycle landing gear but its struts are more robust to support the larger aircraft.",
        "Fixed tricycle landing gear with a more streamlined design (PA-28 has less aerodynamic landing gear)"
    ],
    "Saab 2000": [
        "Number of propellers (Saab 2000 typically has 4 or 5 blades on its propellers.)",
        "Presence of winglets at the tips of the wings (Saab 2000)",
        "Logo and branding (Airlines operating these aircraft may have distinct liveries.)",
        "T-tail design but different in shape compared to Saab 2000",
        "Turboprop engines (two propellers)",
        "Typically equipped with 5-bladed propellers (ATR-72 usually has 6-bladed propellers)",
        "Swept wings",
        "Jet engines (no propellers)",
        "Six-bladed propellers (compared to the 340's four-bladed propellers)",
        "twin turboprop engines",
        "Propeller engines (Saab 2000) vs. jet engines (Embraer ERJ 145)",
        "Sleeker, more streamlined fuselage",
        "two turboprop engines",
        "Propeller engines (The Saab 2000 has turboprop engines, whereas the Fokker 100 has jet engines.)",
        "Twin turboprop engines located on the wings"
    ],
    "Saab 340": [
        "**Fuselage Length**: The Saab 2000 has a longer fuselage compared to the Saab 340.",
        "**Landing Gear**: Differences in the landing gear configuration can also be observed, with the Saab 2000 typically having a more robust design owing to its higher performance characteristics.",
        "Saab logo or specific airline livery indicative of Saab 340 operators",
        "Two Pratt & Whitney Canada PW100 series engines with longer nacelles",
        "**Propeller Blades**: The Saab 2000 usually features 6-blade propellers, whereas the Saab 340 generally has 4-blade propellers.",
        "Smaller size compared to the BAE 146",
        "**Propellers**: The Saab 340 has two turboprop engines with large, visible propellers, while the Embraer ERJ 145 has jet engines without propellers.",
        "**Fuselage Length**: The Saab 340 has a shorter, stubbier fuselage compared to the longer, more slender fuselage of the Embraer ERJ 145.",
        "**Engine Type**: The Saab 340 typically has two turboprop engines, whereas the Saab 2000 also has turboprop engines but with different nacelle designs that may appear more streamlined.",
        "**Landing Gear**: The landing gear of the Saab 340 is typically more prominent and may be more visible in photos compared to the sleeker design of the landing gear of the Embraer ERJ 145.",
        "**Wing Position**: The wing of the Saab 2000 is somewhat redesigned for better performance and can look slightly different in mounting and design compared to the Saab 340.",
        "T-tail configuration",
        "**Tail Design**: The Saab 340 has a T-tail design, where the horizontal stabilizer is mounted on top of the vertical stabilizer. The Embraer ERJ 145 has a conventional tail design with the horizontal stabilizer located at the base of the vertical stabilizer.",
        "T-tail design",
        "smaller size"
    ],
    "Spitfire": [
        "WWII-era military markings and camouflage",
        "piston engine exhaust stacks",
        "Canopy with a more classic, rounded design",
        "Classic tailplane (Spitfire) vs. swept-back tailplane (Hawk T1)",
        "Single-engine piston aircraft",
        "Tailwheel landing gear",
        "tailwheel landing gear",
        "Lack of turboprop engines",
        "Tailwheel undercarriage",
        "Shorter fuselage",
        "RAF (Royal Air Force) roundels and markings",
        "Rounded tail fin and horizontal stabilizer",
        "Exhaust stacks on the sides of the nose",
        "WWII-era design",
        "Propeller blades (typically three-bladed for early models)"
    ],
    "Tornado": [
        "Camouflage or gray paint scheme (typical of military aircraft)",
        "smaller, more compact airframe",
        "absence of solid structure and wings typical of aircraft",
        "single or tandem cockpit configuration",
        "absence of wings or fuselage",
        "Compact and aerodynamic airframe",
        "Twin-engine configuration",
        "twin-engine configuration",
        "swept wings with variable geometry (adjustable sweep angle)",
        "Canopy for pilot and co-pilot",
        "twin-engine design with afterburners",
        "no visible cockpit or engines",
        "Camouflage paint scheme",
        "sleek, aerodynamic fuselage",
        "Swept wings"
    ],
    "Tu-134": [
        "Landing gear located in pods on rear fuselage (Tu-134)",
        "Windows arrangement: The Tu-134 might have a different alignment and number of passenger windows compared to the Boeing 727.",
        "Length and fuselage: The Tu-134 is generally shorter in length compared to the Boeing 727.",
        "Fuselage Length: The Tu-134 has a shorter fuselage in comparison to the longer Tu-154.",
        "Wing placement: Both have low-mounted wings, but the details in wing design differ.",
        "narrower fuselage (Tu-134)",
        "Fewer windows along the fuselage",
        "Distinctive nose shape with radar dome (in Tu-134)",
        "3-wheeled main landing gear (Tu-134)",
        "Distinctive glass navigator's nose",
        "Glass nose or radar dome at the front (depending on the variant)",
        "Smaller size compared to the DC-8 ",
        "More compact fuselage",
        "Lower passenger capacity",
        "Landing Gear: The landing gear of the Tu-134 typically retracts into pods on the wings, while the Tu-154’s gear retracts into the fuselage."
    ],
    "Tu-154": [
        "Landing gear configuration (Tu-154 has a different setup compared to the Boeing 707)",
        "Narrow-body: The Tu-154 is a narrow-body jet, whereas the A340 is a wide-body jet.",
        "Wing sweepback angle is more pronounced",
        "A sleeker, more modern appearance with less sweep on the wings",
        "Longer fuselage in comparison to the DC-9",
        "Number and spacing of cabin windows: The Tu-154 often has less spacing between windows compared to the Boeing 727.",
        "Swept-back wings with pronounced anhedral (downward angle)",
        "Shorter, more rounded nose compared to the DC-8",
        "National or airline markings typical of Russian or Eastern Bloc aviation during its era",
        "Main landing gear in the wings and tail region",
        "Narrow fuselage compared to the Boeing 707",
        "Landing gear: Tu-154 has 12 main tires in a six-wheel main landing gear truck on each side vs. the DC-9's main landing gear setup",
        "A narrower fuselage relative to the Tu-154",
        "Cockpit window shape: The cockpit windows on the Tu-154 might have different shapes and arrangements compared to the 727.",
        "A more elongated fuselage compared to the BAE-125"
    ],
    "Yak-42": [
        "Landing gear (Yak-42's landing gear configuration differs from that of Saab 340's)",
        "No propellers (Saab 2000 is a turboprop aircraft, while Yak-42 is a jet)",
        "lack of visible propellers (ATR-72 has two propellers)",
        "Number of engines (Yak-42 has three jet engines, Saab 340 has two propeller engines)",
        "Tail design (Yak-42 has a T-tail, Saab 340 has a conventional tail)",
        "Wing placement (Yak-42 has low-wing configuration, Saab 340 has high-wing configuration)",
        "Engine type (Yak-42 has jet engines, Saab 340 has turboprop engines)",
        "Wing-mounted air brakes (Yak-42 has these, while the Tu-134 does not)",
        "Designated winglets or different wing shapes",
        "More bulbous nose shape (Yak-42 nose is less pointed than Tu-134's)",
        "Yak-42 generally has fewer windows along the fuselage than the Tu-154",
        "Smaller overall size and wingspan compared to the Boeing 717",
        "No external propellers: The Yak-42 is a jet and lacks the large, visible propellers seen on the An-12.",
        "three jet engines (one on the tail, two on the wings)",
        "Presence of winglets on later models"
    ]
}