{
    "A300": [
        "Airbus logo or livery markings",
        "Airbus logo or markings on the aircraft",
        "Airbus logo or markings",
        "A300 typically does not feature a T-tail (MD-90 has a T-tail configuration)",
        "Airbus A300 logo or markings if visible",
        "Lack of wingtip fences or sharklets (classic A300s)",
        "Tail design (differences in vertical stabilizer and rudder)",
        "Winglets (depending on the model/version of A300)",
        "Signature Airbus \"bulbous\" nose shape",
        "Positioned lower, closer to the ground when on the ground (due to shorter landing gear)",
        "different engine types (A300 typically has older engine models)",
        "different tail design",
        "Winglets at the wingtips (depending on the version)",
        "Slight dihedral wings (wings angled slightly upwards) ",
        "More rounded nose"
    ],
    "A310": [
        "Winglets on the wings if present (later models may have them).",
        "T-tails (tailplane)",
        "single elevator on the horizontal stabilizer",
        "A distinct vertical stabilizer and tail shape characteristic to Airbus designs.",
        "Winglets on the A310, which are usually absent on the DC-10",
        "distinctive tailcone shape (more pointed on A310)",
        "winglets on the wingtips (present on some A310 models)",
        "Single full passenger deck (no partial upper deck as in some larger aircraft)",
        "Winglets at the end of the wings (on some models)",
        "three-section windshield (A310) vs. four-section windshield (A320)",
        "The cockpit windows and nose shape distinctive to Airbus aircraft.",
        "Absence of the characteristic hump on the fuselage that the A380 has",
        "shorter fuselage",
        "Shorter fuselage",
        "Smaller size"
    ],
    "A320": [
        "Winglets with a vertical upturn instead of raked wingtips (common in some 767 models)",
        "landing gear design (A320 has a simpler main landing gear structure)",
        "Winglets: A320 typically features \"sharklet\" winglets which are taller and more curved, while older models of the Boeing 737 might have smaller, split-tip winglets.",
        "Engine shape: The engines on the A320 usually have a flatter bottom, while the engines on the Boeing 737 tend to be more circular or oval.",
        "Distinctive Airbus nose shape (more rounded compared to the 767's more pointed nose)",
        "Winglets: The A320 typically has smaller, sharklet winglets, while the A330 often features larger, more curved winglets.",
        "Airbus logo or specific airline livery known to operate A320s",
        "Sharklet winglets  ",
        "sharklets (tip extensions) on wings (A320 typically has these)",
        "Landing gear: The main landing gear of the A320 retracts outward into the wings, whereas on the Boeing 737, it retracts forward into the fuselage.",
        "T-tail design",
        "Winglets on the ends of the wings",
        "Landing gear with a more complex strut and joint structure",
        "Number of engines: Both have two engines, but the A320 engines are generally smaller.",
        "Landing gear: The A320 typically has a single-bogie main landing gear, whereas the A330 has a dual-bogie main landing gear."
    ],
    "A330": [
        "**Wingtips:** A330 typically has wingtip devices known as winglets or sharklets, while early models of the Boeing 737 have no winglets and later models may have split scimitar winglets.",
        "Winglets: The A330 often features larger, more prominent winglets compared to the A310.",
        "**Livery and Logos:** Identifiable airline branding might provide clues specific to the types of aircraft they predominantly use.",
        "Overall size: The A330 is generally larger in overall dimensions than the A310.",
        "Number of engines: A330 has two engines, while A380 has four.",
        "Typically a slightly shorter and higher tail compared to the Boeing 767",
        "Winglets with a distinctive upward curve (sharklets)",
        "Airbus branding or insignia on the fuselage",
        "Different wingtip design (depending on the variant)",
        "Wing span: The A330 has longer wings compared to the A310.",
        "Newer design with longer range and more passenger capacity",
        "Distinctive winglets",
        "Rounded, bulbous nose",
        "Winglets on the wingtips",
        "Engine size: The A330 typically has larger engines compared to the A310."
    ],
    "A340": [
        "Four engines: The A340 has four engines, while the A310 has two.",
        "Winglets: The A340 often features winglets, which are absent in the A310.",
        "Four engines (A340 has four engines, whereas Boeing 757 has two)",
        "Number of doors: The A340 typically has more passenger doors due to its longer length.",
        "Different tail configurations (the A340 often has a slightly higher vertical stabilizer)",
        "The A340 has a longer fuselage with a different window arrangement compared to the 777",
        "Four engines (A340 has four engines, while the Boeing 777 has two)",
        "Winglets shape (A340 winglets are different compared to A320)",
        "Slightly larger size and more elongated shape",
        "Wingspan (A340 has a larger wingspan than A320)",
        "Airbus logo on the tail or fuselage (if visible)",
        "Winglets (A340 often has winglets that are upward-angled)",
        "Unique landing gear arrangement (A340 has a center main gear on some models)",
        "Aircraft tail height (A340 generally taller)",
        "Longer fuselage relative to wing size (A340 tends to have a lengthier appearance)"
    ],
    "A380": [
        "Distinctive hump due to the upper deck extending towards the tail.",
        "larger, more rounded nose",
        "The Airbus logo near the front section",
        "Wingtip fences or winglets that are larger and more vertical",
        "slightly different tail design",
        "The A380 often has a more bulbous nose compared to the sleeker nose of the Boeing 757",
        "Distinctively larger and more rounded nose",
        "absence of a hump on the upper deck (Boeing 747 has a distinctive hump)",
        "Winglets at the tips of the wings",
        "Larger size and wingspan (A380)",
        "larger wingspan",
        "Larger wingspan",
        "Generally more massive and larger fuselage",
        "Larger overall size in terms of length and wingspan",
        "A distinctive hump at the front of the plane where the upper deck ends"
    ],
    "ATR-42": [
        "Shape of the nose: The ATR-42 generally has a more rounded nose.",
        "Four-bladed propellers (ATR-42 usually has four-bladed, Fokker 50 has six-bladed)",
        "Propeller engines (ATR-42 has turboprop engines, while BAE-125 has jet engines)",
        "Size: The ATR-42 is larger in size and length compared to the DHC-6.",
        "Nose shape: The ATR-42 has a more rounded nose, whereas the DHC-6 has a more angular shape.",
        "Different engine nacelle shapes (ATR-42 has more teardrop-shaped nacelles)",
        "No T-tail, as the horizontal stabilizer is at the base of the vertical stabilizer",
        "Twin-engine configuration (the An-12 has four engines)",
        "Twin turboprop engines",
        "Shorter landing gear",
        "Engine nacelles: ATR-42 has distinct circular engine nacelles compared to the longer, more streamlined nacelles on the Dash 8.",
        "More modern, sleeker appearance",
        "Single overwing emergency exit on each side",
        "Rounded, shorter nose",
        "Single vertical stabilizer"
    ],
    "ATR-72": [
        "A noticeably T-shaped tail with a horizontal stabilizer set atop the vertical stabilizer.",
        "Four jet engines mounted on pylons under the wings.",
        "Sharper, more angular tail: The ATR-72 features a prominent, angular vertical stabilizer.",
        "Four-blade propellers (as opposed to six-blade for Fokker 50)",
        "High-wing configuration as well but with jet engines.",
        "A more compact, rounded fuselage.",
        "High-wing configuration: The ATR-72 has wings mounted high on the fuselage.",
        "Airline livery or logos (if present)",
        "Swept-back vertical stabilizer",
        "Longer, narrower fuselage: The ATR-72 has a sleeker, elongated fuselage compared to the stubbier appearance of the BAE 146.",
        "Four-blade propellers",
        "Number of engines (both have two, but different types)",
        "Landing gear configuration: The main landing gear of the ATR-72 might be positioned slightly differently or have more prominent fairings.",
        "Longer fuselage: The ATR-72 has a longer fuselage compared to the ATR-42.",
        "Absence of jet engines mounted at the rear of the fuselage"
    ],
    "An-12": [
        "Cargo door: The An-12 usually has a large rear cargo door, whereas the DHC-6 tends to have smaller side doors for passengers.",
        "Four engines: The An-12 typically has four turboprop engines, whereas the DHC-6 (commonly known as the Twin Otter) has two.",
        "Propellers: The An-12 has four turboprop engines with visible propellers, while the A300 has two jet engines.",
        "Four turboprop engines",
        "Landing gear (An-12 has retractable landing gear, PA-28 usually has fixed gear)",
        "Four turboprop engines mounted on the wings, versus the two turbofan engines of an A320",
        "Fuselage shape: The An-12 has a distinct, more robust cargo fuselage design, while the DHC-6 has a smaller, more streamlined appearance.",
        "Four turboprop engines versus one piston engine",
        "Number of propeller blades (An-12 typically has four-blade propellers)",
        "Shorter fuselage than MD-11",
        "Four engines compared to one (An-12 typically has four turboprop engines, while DHC-1 has one piston engine)",
        "Size: The An-12 is considerably larger than the DHC-6.",
        "Ramp/cargo door on An-12",
        "Landing gear configuration (An-12 has retractable landing gear, while DHC-1 has fixed gear)",
        "High-wing design, as opposed to the low-wing design of an A320"
    ],
    "BAE 146": [
        "fewer propellers (since Saab 340 is a turboprop aircraft)",
        "Steeper landing gear",
        "Landing gear: multiple wheels on main gear (BAE 146) vs simpler landing gear (BAE-125)",
        "Steep landing and takeoff capabilities",
        "Longer main landing gear legs and slightly shorter aircraft length compared to a DC-9",
        "**Landing Gear Configuration:** The main landing gear on the BAE 146 retracts into fairings on the wings, while the Embraer ERJ 145’s retracts into the fuselage.",
        "four engines (two on each wing)",
        "Landing gear configuration (BAE 146 has landing gear that retracts into pods on the fuselage; Dash 8 has landing gear that retracts into the engine nacelles)",
        "Distinctive airbrake on the tail (sometimes deployed)",
        "Stubbier, more rounded nose",
        "Steeper nose profile",
        "Four jet engines mounted under the wings",
        "T-tail configuration",
        "T-tail (BAE 146 features a T-tail, while Dash 8 has a conventional tail)",
        "Four engines mounted under the wings"
    ],
    "BAE-125": [
        "small, twin-engine business jet",
        "Fewer windows, typically associated with business jets",
        "Jet engines instead of turboprops",
        "winglets at the tips",
        "Brand logos and registration markings: Look for specific airline logos, registration numbers, or other identifiers that might be visible on the aircraft.",
        "Propeller engines",
        "Straight wings with winglets or no winglets at all",
        "lacks propellers (as ATR-72 is a turboprop)",
        "Swept-back wings with winglets",
        "Distinctive larger and more prominent winglets (on some models)",
        "Wing-mounted engines (turboprop in most cases)",
        "**Branding and Markings**: The BAE-125 often has corporate or private livery, whereas the DC-8 typically features commercial airline branding.",
        "Engine placement: The BAE-125 has engines mounted on the rear fuselage, while the ERJ 145 also has rear-fuselage-mounted engines but can be identified by their specific placement and size.",
        "Smaller overall size compared to the DC-9",
        "**Number of Engines**: The BAE-125 usually has two engines, whereas the DC-8 has four."
    ],
    "Beechcraft 1900": [
        "Fixed landing gear visible when the aircraft is in the air",
        "Smaller size with a length of approximately 57 feet",
        "T-tail structure",
        "T-tail configuration",
        "Beechcraft logo or specific airline markings (if visible)",
        "Twin turboprop engines (as opposed to jet engines on the Legacy 600)",
        "Landing gear configuration",
        "Single crew door on the left side of the fuselage",
        "Straight wings rather than swept wings",
        "A high T-tail design",
        "Smaller size with a capacity of around 19 passengers",
        "Twin propellers instead of jet engines",
        "T-tail design",
        "Retractable landing gear",
        "Narrower fuselage"
    ],
    "Boeing 707": [
        "Swept-back tail fin",
        "Rounded nose (the 707 has a more rounded nose compared to the 737)",
        "Larger fuselage",
        "Wings: The Boeing 707's wings are higher and more swept than the 727's.",
        "Smaller fuselage diameter in Boeing 707",
        "Fuselage length: The Boeing 707 typically has a longer fuselage than the Boeing 727.",
        "T-tail tailplane",
        "Four engines suspended on pylons under the wings (position and shape can be a clue)",
        "Larger and more pronounced tail fin",
        "Older liveries often found on 707 models compared to newer liveries on 717 models",
        "T-tail design (707’s tail design is slightly different)",
        "Four engines under the wings",
        "Engine pylon design: The engine pylons on the Boeing 707 may differ in shape and attachment from those on the DC-8.",
        "Four engines under the wings (Boeing 707 has four; 737 typically has two)",
        "Single-deck fuselage"
    ],
    "Boeing 717": [
        "Length: The Boeing 717 is longer compared to many variants of the DC-9.",
        "Winglets (if present, though some 717s may not have winglets)",
        "Modern livery: Boeing 717 typically has more modern airline liveries compared to the older liveries commonly found on DC-9 aircraft.",
        "Smaller winglets or none, compared to MD-80 variations",
        "Winglets at the wingtips (optional on Boeing 717 but not available on Fokker 100)",
        "Winglets (optional but more common in retrofitted 717s)",
        "Distinctive Boeing 717 branding and livery (depending on airline)",
        "Nose landing gear doors: The Boeing 717 often has larger and differently shaped nose landing gear doors compared to the DC-9.",
        "Longer forward fuselage compared to the Fokker 100",
        "Absence of a third engine in the tail section",
        "Lack of winglets",
        "Winglets: Boeing 717 often has small winglets at the tips of the wings, while earlier DC-9 models typically do not.",
        "Newer design and more modern appearance",
        "Different emergency exit layout: the Boeing 717 typically has four door exits (two on each side) while the Fokker 100 has five (two forward, two over-wing, and one rear left side).",
        "Nose shape (more pointed on the Boeing 717)"
    ],
    "Boeing 727": [
        "Longer, more slender fuselage",
        "Shorter fuselage compared to the 757",
        "Narrow body",
        "Boeing 727 often has a more pointed nose",
        "A slightly longer fuselage",
        "Winglets (in some models, but not all)",
        "Slimmer fuselage",
        "Slightly swept wings with fewer pylons for engines",
        "Longer fuselage compared to Boeing 717",
        "Wide body",
        "Smaller and shorter landing gear compared to the 737",
        "Three engines (two mounted on the rear fuselage and one at the base of the tail)",
        "Smaller winglets or sometimes none at all",
        "Typically older and having a more retro design style",
        "Conventional low tail"
    ],
    "Boeing 737": [
        "Winglets: Check the winglets if present. The Boeing 737 may have blended winglets or split scimitar winglets, while the Boeing 757 often has winglets with a steeper angle.",
        "Specific registration and airline liveries, often related to the aircraft model",
        "Wingtip design, such as split scimitar winglets (737) versus sharklets (A320)",
        "Length of the fuselage (737 tends to be longer than 717)",
        "Winglets: Boeing 737 often has distinctive upward-curved winglets, whereas most DC-8s do not.",
        "Tail design: The vertical stabilizer (tail fin) on the Boeing 737 is generally broader at the base compared to the DC-8.",
        "Winglets on the wingtips (depending on the model and generation)",
        "pointed nose design",
        "Presence of winglets (some modern 737s have winglets; 727s typically do not)",
        "distinct split scimitar winglets",
        "Distinctive pointed nose shape",
        "Aircraft nose shape (Boeing 737 generally has a more rounded nose)",
        "Tail fin design",
        "Distinctive wing-mounted engines (closer to the wings)",
        "Shorter fuselage"
    ],
    "Boeing 747": [
        "Shorter and more robust fuselage compared to the more elongated fuselage of the 757",
        "Shorter and less pronounced landing gear (767)",
        "Winglets at the ends of the wings (depending on specific 747 model)",
        "Swept-back wings with a larger span",
        "Single-deck fuselage without a hump (767)",
        "Boeing branding or airline livery associated with 747s",
        "pronounced wing sweep",
        "Longer fuselage compared to the height of the tail (747)",
        "Winglets on the ends of the wings (in newer models)",
        "Distinctive nose shape, flatter and broader compared to the A340",
        "More prominent and taller vertical stabilizer",
        "More pointed nose shape",
        "Distinctive hump-like upper deck that extends only partway along the fuselage",
        "The A330 typically has two engines",
        "larger, bulkier fuselage"
    ],
    "Boeing 757": [
        "T-tail absent",
        "**Wingspan**: The Boeing 777 has a larger wingspan than the 757.",
        "Wing span: The 757 has a narrower wingspan compared to the 767.",
        "winglets at the wingtips (on most 757 models)",
        "Tail design (Boeing 757 vertical stabilizer is more angular)",
        "Nose shape (Boeing 757 has a more pointed nose)",
        "Shorter landing gear and tail height",
        "No winglets",
        "Length of fuselage (Boeing 757 is longer)",
        "Typically fewer and smaller doors on the fuselage compared to A330",
        "No hump on the upper deck area (747 has a distinct hump)",
        "Tail (vertical stabilizer) typically higher and more swept-back",
        "Shorter landing gear",
        "more slender and pointed nose",
        "Landing gear: The Boeing 757 has a noticeable difference in the landing gear configuration compared to the Boeing 767."
    ],
    "Boeing 767": [
        "Length: The Boeing 767 is usually longer than the A320.",
        "Winglets on the tips of the wings (in some models)",
        "Tail Height: Boeing 767 has a shorter tail height compared to the Boeing 777.",
        "The shape of the nose (the 767 has a more pointed nose compared to the 747)",
        "Lack of a noticeable hump on the upper fuselage",
        "Winglets at the tips of the wings (in newer models)",
        "Winglets that are typically larger on the 757 (if both are equipped with winglets)",
        "Taller landing gear (767 has a higher stance)",
        "A wider fuselage (767 is a wide-body aircraft)",
        "winglets",
        "Differences in engine shape and mounting depending on specific engine models used",
        "Wingspan: Boeing 767 has a shorter wingspan compared to the Boeing 777.",
        "Winglets: Boeing 767 generally has raked wingtips, while the A320 has winglets or sharklets.",
        "Bigger engines, often with a more elongated, oval shape",
        "Larger, more rounded nose shape"
    ],
    "Boeing 777": [
        "**Wingspan**: The Boeing 777 has a larger wingspan.",
        "**Fuselage Shape**: The Boeing 777 has a wider fuselage.",
        "Engine count: Boeing 777 has two engines, while the Airbus A340 has four engines.",
        "Engine: Boeing 777 has larger, twin engines under the wings.",
        "Fuselage: Boeing 777 has a longer, wider fuselage.",
        "Winglets: Boeing 777 typically does not have winglets, while the A340 often features winglets.",
        "Fuselage shape: The Boeing 777 has a wider, more rounded fuselage in contrast to the narrower fuselage of the Boeing 737.",
        "Modern, more streamlined design (Boeing 777)",
        "Generally longer overall length",
        "larger, more rounded nose",
        "Wider fuselage for greater passenger capacity (Boeing 777)",
        "Larger physical size (Boeing 777)",
        "more modern, elongated fuselage shape",
        "Raked wingtips (A330 has winglets)",
        "Distinctive rounded nose shape"
    ],
    "C-130": [
        "Shorter, stockier landing gear suited for rough airstrips",
        "Two piston engines",
        "Tailwheel landing gear configuration",
        "Short, robust landing gear",
        "Four turboprop engines",
        "Wider and more robust landing gear",
        "Shorter landing gear",
        "Sleek, modern appearance suitable for commercial aviation",
        "No rear loading ramp, designed for passenger or freight transport",
        "The landing gear configuration: The C-130 typically has a set of two main landing gears with two wheels each on each side, while the An-12 has two pairs of tandem main landing gear.",
        "Two turbofan engines",
        "Smaller and narrower fuselage",
        "Bulky and rugged appearance for tactical airlift operations",
        "High-wing configuration (wings mounted on top of the fuselage)",
        "Squared-off fuselage rear for loading and unloading cargo"
    ],
    "C-47": [
        "Two engines: The C-47 has two engines, whereas the DC-6 has four.",
        "Tailwheel (C-47 has a tailwheel landing gear, A310 has a nosewheel landing gear)",
        "Shorter fuselage: The C-47 has a shorter fuselage than the DC-6.",
        "Tailwheel landing gear",
        "Landing gear: The C-47 features a tailwheel landing gear configuration, while the DC-6 typically has a tricycle landing gear system.",
        "Landing gear with tailwheel configuration",
        "Tail wheel landing gear",
        "Tailwheel landing gear configuration",
        "retractable landing gear",
        "Absence of modern jet engines",
        "Straight, non-swept wings",
        "larger wingspan relative to fuselage",
        "Trijet configuration (three engines)",
        "twin engines mounted on the wings",
        "No rear loading ramp"
    ],
    "CRJ-200": [
        "T-tail configuration but with more pronounced tail structure",
        "Size and Length: The CRJ-200 is smaller and shorter than the MD-90.",
        "A single propeller engine mounted at the front",
        "Larger size, typically used for regional airline services",
        "Wings: The wings of the CRJ-200 are mounted lower on the body compared to the MD-90.",
        "T-tail configuration",
        "T-tail configuration ",
        "different tail height",
        "single overwing emergency exit on each side",
        "Absence of winglets (on most CRJ-200 models)",
        "Winglets on the tips of the wings",
        "T-tail with smaller horizontal stabilizers",
        "T-tail design",
        "No winglets on many models",
        "T-tail configuration with a high horizontal stabilizer"
    ],
    "CRJ-700": [
        "Winglets at the tips of the wings (though some CRJ-200 models can also have them, they are more common on the CRJ-700)",
        "Larger, more pronounced winglets",
        "Winglets on the tips of the wings",
        "Tail Design: The CRJ-700 typically features a T-tail design, while the MD-80 often has a low tailplane or horizontal stabilizer.",
        "Number of Engines: Both aircraft have two engines, but the CRJ-700 engines are smaller and more integrated with the fuselage.",
        "Distinctive winglets at the tips of the wings",
        "Generally absence of winglets",
        "Winglets or small vertical extensions at the wingtips",
        "T-tail structure with slight differences in size and angle",
        "Winglets on the wingtips",
        "More complex landing gear structure",
        "T-tail design as well, but a more robust fuselage",
        "Classic, older aircraft design features",
        "Shorter and more pointed nose",
        "T-tail configuration"
    ],
    "Cessna 172": [
        "Fixed landing gear (compared to the often retractable gear on the DHC-1)",
        "Fixed landing gear",
        "fixed landing gear",
        "Traditional ‘tail-dragger’ or tricycle gear setup",
        "Generally found in a lighter, simpler paint scheme",
        "Tricycle landing gear (nose wheel included)",
        "Fixed, non-retractable landing gear",
        "Smaller size and more compact",
        "Tailwheel or tricycle landing gear configuration",
        "Taildragger landing gear (main two wheels in front, small third wheel at the tail)",
        "Smaller size and simpler design",
        "Tricycle landing gear with a single nose wheel",
        "More simplistic design and fewer windows compared to the jet",
        "Single exhaust",
        "Lack of jet engines "
    ],
    "Cessna 208": [
        "Single-engine propeller (Cessna 208) vs. twin-engine turboprop (Dash 8)",
        "High-wing design (Cessna 208) vs. low-wing design (Dash 8)",
        "Fixed landing gear (Cessna 208) vs. retractable landing gear (Dash 8)",
        "Engine nacelles: The DHC-6's engine nacelles on the wings may help identify it, whereas the Cessna 208 lacks these due to its single-engine configuration.",
        "Propeller size and placement: The single propeller on the Cessna 208 may differ in size and placement from the twin propellers on the DHC-6.",
        "Shorter fuselage compared to Beechcraft 1900",
        "Window placement: The arrangement and number of windows along the fuselage might vary between the Cessna 208 and the DHC-6.",
        "fixed landing gear",
        "Fixed landing gear",
        "Fixed landing gear (non-retractable)",
        "Turboprop engine rather than jet engines",
        "Tail design (Cessna 208 has a single vertical stabilizer and a simpler tail)",
        "Visible cargo pod under the fuselage (often on a Cessna 208, may vary)",
        "sleeker, more compact fuselage",
        "Twin-engine turboprop"
    ],
    "Cessna Citation": [
        "**Tail design:** Cessna Citations usually have a T-tail design.",
        "**Size:** Cessna Citations are generally smaller.",
        "**Distinctive Features:** Check for any model-specific features or markings.",
        "**Number of engines:** Cessna Citations typically have two engines.",
        "winglets on some models",
        "**Nose Shape:** Cessna Citations often have a more pointed nose. ",
        "Winglets on the wingtips (on some models)",
        "Distinctive winglets (depending on specific Cessna Citation model)",
        "Less pronounced nose shape compared to Embraer Legacy 600",
        "**Shape of fuselage:** Cessna Citations have a more compact fuselage.",
        "Swept wings",
        "swept wings",
        "landing gear configuration",
        "**Engine position**: Cessna Citation typically has engines mounted on the rear fuselage, while Beechcraft 1900 has engines mounted on the wings.",
        "**Tail design**: The Cessna Citation often features a T-tail configuration, whereas the Beechcraft 1900 has a conventional tail design."
    ],
    "Challenger 600": [
        "Winglets may or may not be present (as opposed to the CRJ-700 which consistently has winglets)",
        "Winglets that are less pronounced or sometimes absent",
        "Twin jet engines (mounted on the rear fuselage) ",
        "Swept-back wings",
        "T-tail configuration on Challenger 600",
        "Distinctive, shorter landing gear",
        "Fuselage mounted engines (closer to the tail)",
        "T-tail configuration",
        "Generally smaller overall size compared to the CRJ-700",
        "Rear-mounted engines",
        "More spacious, shorter landing gear",
        "low-wing configuration",
        "Larger, tail-mounted engines",
        "Distinctive T-tail configuration",
        "Wing placement (Challenger 600 has wings attached low on the fuselage)"
    ],
    "DC-10": [
        "Less pronounced curve or angle in the nose section compared to the MD-11",
        "Tail design: The DC-10 has a T-tail design, while the DC-8 has a more traditional tailplane.",
        "landing gear (DC-10 has retractable tricycle landing gear, DC-3 has fixed landing gear)",
        "Larger wingspan and overall size.",
        "More rounded nose compared to the more pointed nose of the DC-9",
        "T-tail configuration.",
        "Three engines: one under each wing and one at the base of the vertical stabilizer.",
        "Wider fuselage.",
        "fuselage shape (DC-10 has a wider, more modern fuselage)",
        "Lack of winglets on the wingtips",
        "Wing-mounted engines: Both aircraft have two wing-mounted engines, but the overall design of the tail and center engine can still help in identification.",
        "Three engines (one on each wing and one at the base of the vertical stabilizer)",
        "Three engines (one in each wing and one at the base of the vertical stabilizer)",
        "Three engines: one on each wing and a third in the tail (distinctive for the DC-10)",
        "Tail engine intake: The DC-10's tail-mounted engine has a prominent S-duct intake design."
    ],
    "DC-3": [
        "Single vertical stabilizer with rudder",
        "Tailwheel landing gear (DC-3) instead of tricycle landing gear (DHC-6)",
        "Tailwheel (as opposed to nosewheel)",
        "Tandem main gear and single tail wheel configuration",
        "tailwheel landing gear (taildragger)",
        "absence of a cargo door",
        "Tailwheel landing gear",
        "Distinctive un-swept, straight wings",
        "Number of engines (DC-3 has 2 engines, DC-9 typically has 2 engines located at the rear)",
        "Low-wing monoplane design",
        "Smaller size and fuselage",
        "Smaller size and shorter fuselage",
        "Larger wingspan (DC-3) relative to its size",
        "Tail configuration (DC-3 has a conventional tailplane, DC-9 has a T-tail)",
        "shorter fuselage"
    ],
    "DC-6": [
        "Tailwheel landing gear (in some variants)",
        "Four propeller engines (DC-6) compared to jet engines (DC-10)",
        "Four engines: The DC-6 has four engines, while the DC-3 has two.",
        "Propeller engines (DC-6 has four propeller engines while the Boeing 757 has jet engines)",
        "Propeller engines (DC-6) instead of jet engines (DC-9)",
        "Landing gear with smaller, less robust wheels",
        "Tail-wheel landing gear",
        "Four engines (DC-6) as opposed to two (DC-9)",
        "Tail-dragger type landing gear",
        "Swept wings",
        "Four propeller engines",
        "Larger wingspan: The DC-6 has a larger wingspan relative to the DC-3.",
        "Lower ground clearance",
        "Propeller engines",
        "Propeller engines "
    ],
    "DC-8": [
        "Number of engines: The DC-8 typically has four engines, while the DC-10 has three engines.",
        "Single story cabin (compared to the 747's distinctive hump for the upper deck)",
        "Swept-back wings (DC-8)",
        "Older, more tapered wing design",
        "Longer, more slender fuselage in the DC-8",
        "Four engines mounted under the wings (compared to the A320's two engines)",
        "Turbojet engines (DC-8)",
        "Four engines mounted under the wings (both have this, but different configurations)",
        "Lack of T-tail (DC-8 has a conventional tail, whereas DC-9 has a T-tail)",
        "Lack of modern winglets found on many newer planes, such as those on the A320",
        "Straight wing design (Boeing 747 has a more swept-wing design)",
        "Narrower fuselage",
        "Narrower fuselage compared to the A310",
        "Distinctive shape of the tail fin and rudder",
        "Longer fuselage with a more slender appearance"
    ],
    "DC-9": [
        "Limited number of emergency exits (typically 3 on each side)",
        "Jet engines (as opposed to propellers)",
        "Lower tail height in comparison to the MD-80",
        "T-tail design: The DC-9 has a distinctive T-tail, while the DC-6 has a conventional tail.",
        "No winglets at the wingtips (whereas many Boeing 767 models have winglets)",
        "Number of engines: The DC-9 has two engines, while the DC-6 has four engines.",
        "Sleeker, more modern fuselage",
        "Fewer sets of landing gear (typically two main landing gears compared to the 727's three)",
        "Absence of aerodynamic improvements like winglets",
        "Generally simpler, more compact appearance",
        "Distinctive engine nacelles closer to the tail",
        "Landing gear with a simpler, single-bogey main gear setup",
        "Shorter fuselage compared to the Boeing 727",
        "T-tail configuration",
        "Absence of an engine on the vertical stabilizer (tail)"
    ],
    "DH-82": [
        "Fixed tailwheel landing gear",
        "Tailwheel landing gear configuration",
        "Fixed landing gear with a tailwheel",
        "fixed landing gear with tailwheel",
        "Fixed landing gear with tailwheel",
        "Fixed, non-retractable landing gear with a tailwheel",
        "radial engine (often visible)",
        "Historic look, often associated with vintage aircraft from the 1930s",
        "Often painted in bright, eye-catching colors",
        "fixed landing gear",
        "Radial engine mounted at the front",
        "biplane design",
        "Biplane design (two sets of wings)",
        "Smaller size and lighter weight",
        "simpler, vintage design (typically from the 1930s)"
    ],
    "DHC-1": [
        "Radial engine cowling (distinctive engine shape)",
        "Tailwheel undercarriage",
        "Tailwheel landing gear",
        "Conventional tailwheel (tail-dragger) landing gear",
        "Smaller size and light aircraft build",
        "Taildragger configuration (main landing gear under the wings, with a small tailwheel)",
        "Number of engines: The DHC-1 has one engine, whereas the A310 has two jet engines.",
        "Single-wing (monoplane) design (DHC-1) vs. dual-wing (biplane) design (DH-82)",
        "Fixed landing gear",
        "Landing gear (Conventional gear on DHC-1, Tricycle gear on Hawk T1)",
        "Vintage, military trainer appearance",
        "Tricycle landing gear in some models (DHC-1) vs. taildragger landing gear (DH-82)",
        "More streamlined and modern design (DHC-1) vs. more vintage, biplane design (DH-82)",
        "Different placement and design of exhausts and air intakes",
        "Relatively smaller and lighter frame"
    ],
    "DHC-6": [
        "Sturdy, rugged appearance suitable for STOL (Short Takeoff and Landing) operations",
        "Designed for STOL (Short Takeoff and Landing) capabilities",
        "Short takeoff and landing (STOL) design features",
        "Squared-off tail fin (DHC-6 has a distinct, squared-off vertical stabilizer)",
        "Engine type (DHC-6 has turboprop engines, DC-8 has jet engines)",
        "Longer fuselage designed for carrying more passengers or cargo",
        "Fixed landing gear (non-retractable)",
        "Dual tail fins in the horizontal stabilizer configuration",
        "Number of engines (DHC-6 has 2 engines, DC-8 has 4 engines)",
        "T-tail (horizontal stabilizer mounted on the top of the vertical stabilizer) ",
        "Twin-engine turboprop (DHC-6)",
        "Landing gear (DHC-6 often has fixed landing gear, DC-8 has retractable landing gear)",
        "Twin-engine piston or turboprop engines",
        "Fixed, non-retractable landing gear (DHC-6)",
        "Twin-engine setup"
    ],
    "DR-400": [
        "**Bubble canopy**: The DR-400 usually has a clear bubble canopy that provides a panoramic view for the occupants.",
        "retractable gear (in some DR-400 models)",
        "**Wooden construction**: The DR-400 often features a distinctive wooden airframe, giving it a different texture and appearance.",
        "**Straight leading edge of the wings**: The DR-400 wings have a simpler, straight design compared to the swept design of the SR-20.",
        "different door placement (PA-28 has doors on the side, DR-400 tends to be more centralized access)",
        "wide chord wings (thicker and more rounded than the PA-28)",
        "**Fixed landing gear**: The DR-400 typically has non-retractable landing gear.",
        "Tricycle landing gear with the nose wheel set further back",
        "Fixed tricycle landing gear",
        "Traditional cockpit with mostly analog instruments",
        "Canopy opens sideways for pilot and passenger access",
        "Size: The DR-400 is much smaller compared to the A300.",
        "Usage: The DR-400 is used for general aviation, while the A300 is designed for commercial airline service.",
        "Positioned for general aviation or private flying",
        "Retractable tricycle landing gear"
    ],
    "Dash 8": [
        "Propellers (Dash 8 has turboprop engines, whereas the DC-8 has jet engines)",
        "Protruding landing gear (due to high wings)",
        "Landing gear (Dash 8 has larger, more robust landing gear suitable for rugged runways)",
        "Fixed landing gear (in some models)",
        "Distinctive engine nacelles (engine housings on wings) ",
        "Presence of nacelles for turboprop engines near the wings",
        "Propeller engines (Dash 8 typically has two propeller engines, BAE-125 has jet engines)",
        "Slightly different nose shape (Dash 8 has a more angular nose)",
        "Four-bladed propellers (depending on the specific Dash 8 model)",
        "Propeller engines (Dash 8 typically has turboprop engines while BAE 146 has jet engines)",
        "Retractable landing gear",
        "Longer fuselage compared to the Dornier 328",
        "Swept, straight wings",
        "Four-bladed propellers",
        "Landing gear housed within the engine nacelles"
    ],
    "Dornier 328": [
        "twin turboprop engines (usually visible on the wings)",
        "Turboprop engines (as opposed to jet engines)",
        "Rounded, bulbous nose",
        "T-tail design on the Dornier 328 vs. conventional tail on the Beechcraft 1900",
        "More compact and shorter fuselage on the Dornier 328 compared to the BAE 146",
        "propeller engines",
        "Distinctive propeller shape (often 4-blade on Dornier 328, versus 6-blade on ATR-72)",
        "High wing design on the Dornier 328 versus the low wing on the BAE 146",
        "sleeker and more streamlined fuselage",
        "Two propeller blades on each engine",
        "Engine placement (Dornier 328 has engines mounted on pylons beneath the wings)",
        "Four propeller blades on each engine",
        "often used for regional and short-haul flights",
        "Nose shape (more rounded and shorter on the Dornier 328)",
        "Distinctive nose shape"
    ],
    "EMB-120": [
        "Propellers: The EMB-120 has visible propellers on its engines, while the MD-90 does not.",
        "Turboprop engines (propellers) instead of jet engines",
        "Logo or airline markings (often seen on regional jets like EMB-120)",
        "twin turboprop engines (visible propellers)",
        "turboprop engines",
        "Turboprop engines",
        "Size and Body Shape: The EMB-120 is a smaller, turboprop aircraft, while the MD-90 is a larger, twin-jet commercial airliner.",
        "twin turboprop engines",
        "Larger passenger capacity (typically for regional flights)",
        "Twin-engine turboprop with engines mounted on the wings",
        "Twin turboprop engines mounted on the wings",
        "Twin-turboprop engines mounted on the wings",
        "Engines: The EMB-120 has two turboprop engines mounted on the wings, whereas the MD-90 has two jet engines mounted at the rear of the fuselage.",
        "Presence of winglets on the wingtips",
        "Airline Livery: Many MD-90s are painted with commercial airline liveries, while EMB-120s can also be found in regional airline or corporate liveries."
    ],
    "Embraer E-Jet": [
        "Winglets: Embraer E-Jets typically have winglets, while Fokker 100s do not.",
        "Fuselage Shape: The fuselage of the E-Jet is typically sleeker and more streamlined, while the Fokker 100 has a slightly bulkier, older design.",
        "absence of propellers (Beechcraft 1900 has twin turboprop engines)",
        "Tail Design: The E-Jets usually have a slightly more swept-back horizontal stabilizer and a different tail fin design in comparison to the Fokker 100.",
        "Less pronounced swept wings",
        "Main Landing Gear: The E-Jets have a shorter, more compact main landing gear compared to the longer and more visible landing gear of the Fokker 100.",
        "Nose Shape: The E-Jets have a more pointed, sleek nose, compared to the more rounded nose of the Fokker 100.",
        "Winglets: Most Embraer E-Jets have distinctive upward winglets, whereas the DC-9 typically does not.",
        "Fuselage Shape: The Embraer E-Jet tends to have a more modern appearance with a smoother, more streamlined fuselage compared to the older, more cylindrical shape of the DC-9.",
        "Engines: The E-Jets have engines that are mounted under the wings, whereas the Fokker 100 has rear-mounted engines.",
        "different winglet design",
        "less pronounced nose shape",
        "Distinctive \"T-tail\" configuration in some E-Jet models (e.g., E170)",
        "two or more emergency exits over the wings",
        "Distinctive T-tail design (in some models)"
    ],
    "Embraer ERJ 145": [
        "Short and thin landing gear struts",
        "Length: The ERJ 145 tends to be slightly longer than the CRJ-200.",
        "Length: The ERJ 145 is considerably longer than the Beechcraft 1900.",
        "landing gear configuration",
        "Shorter length (around 98 feet for the ERJ 145)",
        "Absence of winglets",
        "T-tail configuration",
        "T-shaped tail",
        "Distinctive pointed nose shape",
        "Winglets: The ERJ 145 often lacks the winglets found on the Legacy 600",
        "Smaller overall size compared to CRJ-700",
        "Landing gear: Differences in the landing gear configuration can help differentiate between the two aircraft.",
        "engine placement",
        "Distinctive narrower nose profile",
        "Longer, slender fuselage"
    ],
    "Embraer Legacy 600": [
        "Swept wings",
        "Landing gear configuration (Embraer has a different stance and wheel setup)",
        "Winglets: The Legacy 600 usually has a more pronounced upward curve on its winglets compared to the relatively simpler winglets on the E-Jet series.",
        "Longer landing gear",
        "Size: The Legacy 600 is generally smaller and more streamlined compared to the E-Jet, which is a regional jet with a larger capacity.",
        "Winglets on the tips of the wings",
        "More pronounced nose shape",
        "Winglets on the ends of the wings",
        "Engine Position: The engines on the Legacy 600 are mounted further back toward the tail, while the E-Jet’s engines are mounted on the wings.",
        "T-tail configuration",
        "Winglets",
        "Three engines (one on each rear side and one in the tail)",
        "Tail-mounted auxiliary power unit (APU) exhaust",
        "T-tail with smaller size stabilizers",
        "Winglets (small upward extensions at the wingtips) on the wings"
    ],
    "Eurofighter Typhoon": [
        "Presence of modern radar and sensor systems",
        "Military camouflage or jet grey coloring",
        "military-grade camouflage or gray paint scheme",
        "civilian livery and design",
        "Canards (small forewings near the front)",
        "canards (small forward wings near the nose)",
        "Presence of weapons or weapon mounts",
        "presence of underwing stores (weapons or fuel tanks)",
        "Military markings and insignia",
        "Canard foreplanes (small, wing-like structures near the nose)",
        "Delta wing shape of the Eurofighter Typhoon",
        "Absence of large commercial airline windows",
        "Presence of various weaponry or missile mounts",
        "Military insignia or camouflage",
        "Distinctive airline liveries or branding"
    ],
    "F-16": [
        "Military markings (e.g., camouflage paint, military insignia)",
        "Use and markings: F-16 is often seen with U.S. Air Force markings, while F/A-18 is commonly marked with U.S. Navy or Marine Corps insignia.",
        "Presence of weaponry or pylons for attaching bombs/missiles",
        "Military markings and camouflage (F-16) vs. commercial airline livery (A310)",
        "Compact and agile airframe",
        "Military markings and insignia",
        "Military camouflage or markings",
        "vertical stabilizer with insignia",
        "LERX (Leading Edge Root Extensions): Both aircraft have these, but their shapes differ and can be used as distinguishing characteristics.",
        "Presence of weapons and external fuel tanks (F-16)",
        "smaller size and sleeker profile",
        "Landing gear design: F-16 and F/A-18 have different landing gear configurations and wheel setups.",
        "Military markings or camouflage paint",
        "Smaller size and sharper profile (F-16)",
        "Delta-shaped wings (or with one vertical stabilizer and two horizontal stabilizers)"
    ],
    "F/A-18": [
        "Wingtip missile rails or pylons",
        "military-grade weaponry and pylons",
        "external weaponry or pylons for missiles and bombs",
        "Tactical paint schemes (often gray or camouflage) ",
        "swept-back wings with a more aggressive angle",
        "Tailhook (for carrier-based landing)",
        "Distinctive twin vertical stabilizers (tail fins)",
        "folding wingtips (for carrier storage)",
        "Twin tail fins (vertical stabilizers)",
        "Larger landing gear designed for airport runways",
        "Absence of visible weaponry or military features",
        "Twin tail fins",
        "Camouflage or military livery",
        "shorter, more robust landing gear",
        "Landing gear: The F/A-18 has landing gear designed for carrier takeoffs and landings, often appearing more rugged, while the Boeing 767 has landing gear suited for standard runway operations."
    ],
    "Falcon 2000": [
        "Twin-engine jet vs. single-engine propeller",
        "**Winglets**: Some models of the Falcon 2000 have distinct winglets, while the CRJ-200 commonly has raked wingtips or no winglets.",
        "Manufacturer logo (Dassault for Falcon 2000)",
        "Low-wing aircraft vs. low-wing (with visible struts supporting wings)",
        "**Engine Configuration**: The Falcon 2000 has two engines mounted on the fuselage near the tail, while the CRJ-200 has engines mounted on the aft fuselage, also near the tail but with a different pylon structure.",
        "Dassault Falcon logo or markings",
        "**Size and Length**: The Falcon 2000 is generally smaller than the CRJ-200.",
        "Position of engines (mounted on the fuselage for Falcon 2000, not on the wings)",
        "Swept wings with a slight upward angle",
        "Nose shape (sleeker for Falcon 2000)",
        "Two jet engines (as opposed to three in the Falcon 900)",
        "Winglets on the ends of the wings",
        "Sleeker, more modern design",
        "T-tail design: The Falcon 2000 typically has a distinctive T-tail, while the Challenger 600 has a lower-mounted tailplane.",
        "Business jet appearance rather than commercial airliner"
    ],
    "Falcon 900": [
        "Swept-back winglets on the tips of the wings",
        "number of engines (three for Falcon 900, two for ERJ 145)",
        "Signature windows characteristic of Dassault Falcon jets",
        "T-tail: The Falcon 900 features a distinctive T-tail design.",
        "Dassault Falcon logo or branding",
        "More winglets or wing components",
        "Swept wings (Falcon 900)",
        "Winglets at the end (Falcon 900)",
        "Manufacturer logos or specific livery",
        "Smaller, round windows",
        "Landing gear configuration ",
        "Smaller overall size compared to the DC-9",
        "Trijet configuration (three engines)",
        "Distinctive winglets (blended into the wing)",
        "Business jet configuration, typically fewer windows"
    ],
    "Fokker 100": [
        "Winglets: Fokker 100 often has small winglets at the tips, while the DC-9 does not.",
        "Landing gear placement and structure.",
        "Tail cone: The design of the tail cone or APU exhaust might be different.",
        "T-tail (horizontal stabilizer mounted on top of the vertical stabilizer).",
        "wing-mounted engines (Fokker 50 has none; it has turboprop engines instead)",
        "Two engines mounted on the rear of the fuselage (Fokker 100 has this configuration).",
        "Wing design: Look at the leading edges and wing shape; the Fokker 100 often has a different wing sweep and structure compared to the MD-80.",
        "Absence of a third engine in the tail (Boeing 727 has three engines)",
        "shape and size of tail section (Fokker 100's tail is larger and differently shaped)",
        "Larger size and longer fuselage.",
        "Lack of winglets on the wings (Boeing 757 often has winglets)",
        "T-tail design",
        "T-tail configuration",
        "length of the fuselage (Fokker 100 has a longer fuselage)",
        "Usually distinctive serial or model number associated with Fokker 100"
    ],
    "Fokker 50": [
        "4-bladed propellers (Fokker 50) vs. 6-bladed propellers (Dornier 328)",
        "**Propellers**: The Fokker 50 is a turboprop aircraft and has large propellers on its wings, while the Embraer ERJ 145 is a jet and has jet engines.",
        "Propeller Count: The Fokker 50 typically has twin turboprop engines, while the Saab 2000 also has twin turboprops but may show differences in blade design and count.",
        "Propellers: The Fokker 50 has two turboprop engines with visible propellers, whereas the Fokker 70 is a jet aircraft with turbofan engines and no propellers.",
        "Typically four-blade propellers on engines (ATR-42 generally has six-blade propellers)",
        "Four-bladed propellers",
        "Two turboprop engines (one on each wing)",
        "Tail Design: The Fokker 50 has a more rounded tail fin, whereas the Saab 2000's tail fin is generally more angular and upright.",
        "Landing Gear: The landing gear configuration of the Fokker 50 could differ; for instance, the number and placement of wheels may vary in comparison to the Saab 2000.",
        "Nose Shape: The Fokker 50 often has a more rounded nose, while the Saab 2000 may have a more pointed or sleek nose shape.",
        "Fokker 50 has a more pronounced upward curve at the end of the tail section",
        "Propeller engines (Fokker 50) vs. jet engines (Fokker 100)",
        "Twin-turboprop engines",
        "Propellers on the engines, indicating a turboprop aircraft",
        "Fokker 50 has a more rounded nose"
    ],
    "Fokker 70": [
        "T-tail configuration.",
        "Swept-back wings as opposed to the straighter wings of the Fokker 50.",
        "Landing gear (Fokker 70 has a simpler landing gear setup compared to the Boeing 727)",
        "Winglets: Some Boeing 737 models have winglets at the tips of the wings, which are less common on the Fokker 70.",
        "Turbojet engines mounted on the rear fuselage rather than propellers on the wings.",
        "Lack of a straightforward nose cone seen on the MD-80",
        "Sleek, rear-mounted twinjet design.",
        "Distinctive Fokker logo often found on the aircraft’s tail or fuselage",
        "Landing gear: The Fokker 70 typically has a simpler main landing gear configuration compared to the Boeing 737.",
        "Distinctive larger winglets",
        "T-tail design",
        "Size: The Fokker 70 is generally shorter and smaller than the Boeing 737.",
        "T-tail configuration",
        "Pointed nose shape",
        "Conventional tail (not T-tail)"
    ],
    "Global Express": [
        "Landing Gear: The Global Express has retractable landing gear with a different configuration compared to the CRJ-200.",
        "Landing gear configuration and design",
        "Landing gear configuration",
        "additional antenna arrays and sensors",
        "manufacturer logo (Bombardier for Global Express, Dassault for Falcon 900)",
        "distinctive landing gear configuration",
        "Window layout (Global Express might have different window spacings or shapes)",
        "Nose shape (Global Express has a more pointed nose)",
        "Fuselage Length: The Global Express has a longer fuselage compared to the CRJ-200.",
        "Engine Placement: On the Global Express, the engines are mounted closer to the fuselage compared to the more pronounced placement on the CRJ-200.",
        "Nose shape: The Global Express often has a sleeker, more pointed nose.",
        "Winglets on the tips of the wings",
        "Swept-back wings",
        "Different engine placement and nacelle design",
        "landing gear configuration (differences in the setup and design of the landing gear)"
    ],
    "Gulfstream": [
        "Trijet or twinjet configuration (if specifically the Falcon 2000, it’s a twinjet)",
        "Absence of tri-jet engine configuration (three engines on Falcon 900)",
        "Distinct Gulfstream logo/branding",
        "Winglets with a different design compared to Gulfstream",
        "landing gear configuration",
        "Signature \"G\" logo on tail (if present)",
        "Wingtip winglets (on some Gulfstream models)",
        "Larger, more luxurious-looking aircraft",
        "T-tail",
        "more modern design features",
        "T-tail configuration",
        "logo/branding",
        "typically associated with private or corporate use",
        "Distinctive winglets (on newer Gulfstream models)",
        "fewer windows"
    ],
    "Hawk T1": [
        "Red Arrows or similar military aerobatics team markings ",
        "Red, white, and blue color scheme (common for Hawk T1 in RAF service)",
        "Military markings or insignia, often used by air forces for training (Hawk T1)",
        "Longer, sleeker fuselage typical of a jet trainer",
        "Military markings and paint schemes",
        "Single jet engine exhaust at the rear (Hawk T1)",
        "Military markings",
        "Canopy designed for two tandem seats (instructor and trainee)",
        "Single jet engine",
        "military color scheme or markings",
        "short landing gear",
        "sharp, swept-back wings",
        "Military markings or colors",
        "Pointed nose",
        "Single-engine jet"
    ],
    "Il-76": [
        "Bulky landing gear located in fairings on the fuselage sides",
        "Large, robust landing gear designed for rough airstrips",
        "Three engines (two on the wings and one in the tail)",
        "Distinctive radome (dome-shaped weather radar cover) on the nose",
        "Four engines mounted under the wings",
        "Rear cargo ramp/door",
        "Tall, boxy fuselage",
        "Bulky, multi-wheel landing gear",
        "T-shaped tail (horizontal stabilizer located at the top of the vertical stabilizer)",
        "Four jet engines mounted on wings (Il-76) vs. four turboprop engines (An-12)",
        "Number of engines: The Il-76 typically has four engines mounted under its wings.",
        "Large, multi-wheel landing gear",
        "Military cargo aircraft profile, often with fewer passenger windows",
        "Nose gear located in a forward fuselage nosewheel configuration",
        "Four engines mounted on underwing pylons"
    ],
    "King Air": [
        "Propellers (King Air has turboprop engines, while Cessna Citation has jet engines)",
        "Propellers: King Air aircraft typically have propellers, while Gulfstream jets are known for their turbofan engines.",
        "Twin turboprop engines",
        "Propeller engines (King Air has twin turboprop engines, while Falcon 2000 has jet engines)",
        "Turboprop engines with prominent propeller spinners",
        "More contemporary design with modern avionics",
        "Landing gear: The landing gear design and placement might vary between the two, with King Air models often having simpler, less robust landing gear compared to the more substantial gear on Gulfstream jets.",
        "Twin jet engines",
        "Two turboprop engines mounted on the wings",
        "Retractable landing gear that is more streamlined with the wings",
        "Single piston engine",
        "Wider fuselage for passengers/comfort",
        "Landing gear (The landing gear design and configuration can differ between the two aircraft)",
        "Winglets at the tips of the wings",
        "Engine nacelle shape and location (King Air's engines are mounted under the wings, while Falcon 2000's engines are mounted at the rear of the fuselage)"
    ],
    "L-1011": [
        "Tail engine: The L-1011 has a distinct tail engine (S-duct), while the A340 does not.",
        "L-1011 often has a more rounded nose compared to the DC-9's more pointed design",
        "Third engine in the tail cone (L-1011)",
        "T-tail design on the DC-9 (L-1011 has a conventional tail)",
        "Three engines (as opposed to four on the DC-8)",
        "Number of engines: The L-1011 typically has three engines, whereas the A340 has four.",
        "Winglets or absence thereof (Boeing 757 often has winglets)",
        "More angular-wing planes at the wing root",
        "T-tail with additional ventral fin (small fin under the tail)",
        "Distinctive \"hump\" near the aft part of the fuselage",
        "Larger wing span in proportion to fuselage compared to A310",
        "Longer landing gear struts",
        "Larger, more rounded nose",
        "Longer fuselage with a sleeker nose design",
        "Tail engine (mounted in the vertical stabilizer)"
    ],
    "MD-11": [
        "Winglets on the tips of the wings (some MD-90 models may not have winglets)",
        "Length: The MD-11 is generally longer compared to the MD-80.",
        "Sharp, angled winglets (on some models)",
        "Nose shape: the MD-11 has a slightly more pointed nose compared to the A310.",
        "Winglets: the MD-11 has winglets (small vertical stabilizers) at the tips of the wings, whereas the A310 does not.",
        "T-tail configuration",
        "Different winglets or wingtip design",
        "Extended fuselage: the MD-11 typically has a longer fuselage compared to the A310.",
        "Winglets on the wingtips",
        "Trijet engine configuration (one engine on the tail and two under the wings)",
        "Tailplane with a smaller span",
        "Winglets: The MD-11 typically features winglets at the tips of its wings, which the MD-80 does not have.",
        "a more modern, aerodynamic shape",
        "Winglets that curve upwards at the wingtips",
        "Tail Structure: The MD-11 often has a more pronounced T-tail with a larger horizontal stabilizer compared to the MD-80."
    ],
    "MD-80": [
        "Landing gear configuration (MD-80 has a more robust landing gear)",
        "Distinctive nose shape (MD-80 has a more pointed nose)",
        "T-tail configuration (prominent in MD-80)",
        "T-tail configuration",
        "Shorter wingspan without winglets (MD-11 often has winglets)",
        "More modern and sleeker design overall",
        "Aircraft nose shape (MD-80 has a more rounded nose)",
        "Longer fuselage compared to CRJ-700",
        "T-tail design",
        "Older, more angular design elements",
        "More slightly swept-back wings",
        "Length of the fuselage (MD-80 is longer)",
        "Length of the aircraft (MD-80 is longer)",
        "Single overwing emergency exit (while many DC-8s have four overwing exits)",
        "tailcone design (DC-9 \"screwdriver\" tail on some MD-80 models)"
    ],
    "MD-90": [
        "absence of the third engine at the tail (MD-90).",
        "Winglets (some MD-90s have winglets while MD-80s generally do not)",
        "Nose shape: The MD-90 usually has a more pointed nose compared to the A300.",
        "T-tail: The MD-90 has a T-shaped tail configuration.",
        "T-tail design (MD-90) vs. conventional tail (DC-10).",
        "generally smaller size and narrower body of the MD-90.",
        "Winglets: The MD-11 typically has winglets at the tips of its wings, while the MD-90 does not.",
        "Fuselage length: The MD-11 has a longer fuselage compared to the MD-90.",
        "Single-aisle fuselage (MD-90) vs. wide-body fuselage (DC-10).",
        "Length of the aircraft: The MD-90 is typically longer and slimmer than the A300.",
        "Extended fuselage: The MD-90 is longer than the DC-9.",
        "T-tail configuration on the CRJ-700 (not present on the MD-90)",
        "The absence of the third window exit on both sides of the fuselage right behind the wings, which the MD-90 lacks and the DC-9 usually has.",
        "Winglets: The MD-90 may have small winglets at the tips of its wings, which the DC-9 does not generally have.",
        "Winglets (on some models)"
    ],
    "Metroliner": [
        "Fixed landing gear (in some models)",
        "Landing gear position (retractable gear in the wings for Metroliner)",
        "Twin turboprop engines (Metroliner)",
        "Number of engines (Metroliner: 2 turboprop engines; BAE 146: 4 jet engines)",
        "Smaller, regional airline markings or livery",
        "landing gear with fairings",
        "Fixed (non-retractable) landing gear on some models",
        "Turboprop engines on the wings",
        "Landing gear positioned under the wings",
        "commuter airline livery",
        "More angular and less sleek appearance compared to a Gulfstream",
        "High horizontal stabilizer (T-tail) ",
        "Propeller-driven engines ",
        "T-tail design (Metroliner)",
        "twin turboprop engines"
    ],
    "PA-28": [
        "Fixed landing gear (usually)",
        "**Distinctive Paint Schemes and Logos:** Look for any distinctive paint schemes or logos that might be characteristic of Piper and Cirrus aircraft.",
        "fixed landing gear (most models)",
        "Fixed landing gear",
        "Landing gear: The PA-28 usually has fixed tricycle landing gear with the nose wheel located under the nose, while the DR-400 also has fixed tricycle landing gear but with slight design differences.",
        "Engines: The PA-28 has a single piston engine, whereas the An-12 has four turboprop engines.",
        "**Canopy Design:** The PA-28 often has a more traditional, smaller cockpit side window design compared to the larger, single-piece bubble canopy of the SR-20.",
        "Number of engines (PA-28 typically has one propeller engine; A300 has two jet engines)",
        "Single-engine aircraft",
        "Private aircraft markings instead of commercial airline livery",
        "single-engine configuration",
        "Small, single-engine design",
        "The tail section with a more traditional, less swept-back design",
        "Single-engine design",
        "**Landing Gear:** PA-28 usually has a fixed landing gear, while the SR-20 features a retractable landing gear."
    ],
    "SR-20": [
        "Cirrus Aircraft logo",
        "Cirrus logo",
        "Generally used for personal or flight training purposes",
        "Cirrus Airframe Parachute System (CAPS) handle",
        "T-tail configuration (PA-28 has a conventional tail)",
        "Single-engine piston aircraft",
        "Larger, more rounded canopy (PA-28 has smaller, more traditional windows)",
        "Smaller, single-engine aircraft design",
        "fixed landing gear",
        "Fixed landing gear",
        "Single propeller at the front",
        "Single-engine (propeller) aircraft",
        "Fixed tricycle landing gear with a more streamlined design (PA-28 has less aerodynamic landing gear)",
        "Four-seater cockpit",
        "**Landing Gear:** The SR-20 usually has a nosewheel (tricycle) landing gear configuration, while the EMB-120 also has a tricycle landing gear but its struts are more robust to support the larger aircraft."
    ],
    "Saab 2000": [
        "Number of propellers (Saab 2000 typically has 4 or 5 blades on its propellers.)",
        "Logo and branding (Airlines operating these aircraft may have distinct liveries.)",
        "Presence of winglets at the tips of the wings (Saab 2000)",
        "Typically equipped with 5-bladed propellers (ATR-72 usually has 6-bladed propellers)",
        "Propeller engines (The Saab 2000 has turboprop engines, whereas the Fokker 100 has jet engines.)",
        "T-tail design but different in shape compared to Saab 2000",
        "Six-bladed propellers (compared to the 340's four-bladed propellers)",
        "Turboprop engines (two propellers)",
        "Swept wings",
        "Landing gear (Differences in landing gear placement and visibility can also help in distinguishing them.)",
        "Winglets on the wingtips",
        "slightly pointed nose",
        "Jet engines (no propellers)",
        "Six-bladed propellers",
        "Four-blade propellers"
    ],
    "Saab 340": [
        "**Fuselage Length**: The Saab 2000 has a longer fuselage compared to the Saab 340.",
        "**Landing Gear**: Differences in the landing gear configuration can also be observed, with the Saab 2000 typically having a more robust design owing to its higher performance characteristics.",
        "Saab logo or specific airline livery indicative of Saab 340 operators",
        "Two Pratt & Whitney Canada PW100 series engines with longer nacelles",
        "T-tail configuration",
        "**Propellers**: The Saab 340 has two turboprop engines with large, visible propellers, while the Embraer ERJ 145 has jet engines without propellers.",
        "T-tail design",
        "**Propeller Blades**: The Saab 2000 usually features 6-blade propellers, whereas the Saab 340 generally has 4-blade propellers.",
        "Lower landing gear structure",
        "**Landing Gear**: The landing gear of the Saab 340 is typically more prominent and may be more visible in photos compared to the sleeker design of the landing gear of the Embraer ERJ 145.",
        "Twin turboprop engines",
        "Four-bladed propellers",
        "**Engine Type**: The Saab 340 typically has two turboprop engines, whereas the Saab 2000 also has turboprop engines but with different nacelle designs that may appear more streamlined.",
        "Twin-turboprop engines",
        "twin-turboprop engines"
    ],
    "Spitfire": [
        "Classic tailplane (Spitfire) vs. swept-back tailplane (Hawk T1)",
        "Canopy with a more classic, rounded design",
        "WWII-era military markings and camouflage",
        "piston engine exhaust stacks",
        "Single-engine piston aircraft",
        "Lack of turboprop engines",
        "Tailwheel landing gear",
        "tailwheel landing gear",
        "Propeller blades (typically three-bladed for early models)",
        "Narrow landing gear (retractable)",
        "propeller engine",
        "WWII-era design",
        "Single-engine propeller",
        "Shorter fuselage",
        "Single propeller (three-blade or four-blade configuration)"
    ],
    "Tornado": [
        "smaller, more compact airframe",
        "single or tandem cockpit configuration",
        "absence of wings or fuselage",
        "absence of solid structure and wings typical of aircraft",
        "Compact and aerodynamic airframe",
        "Camouflage or gray paint scheme (typical of military aircraft)",
        "swept wings with variable geometry (adjustable sweep angle)",
        "twin-engine configuration",
        "Twin-engine configuration",
        "no visible cockpit or engines",
        "Canopy for pilot and co-pilot",
        "sleek, aerodynamic fuselage",
        "twin-engine design with afterburners",
        "Presence of afterburners in the exhaust",
        "Camouflage paint scheme"
    ],
    "Tu-134": [
        "Landing gear located in pods on rear fuselage (Tu-134)",
        "Wing placement: Both have low-mounted wings, but the details in wing design differ.",
        "Windows arrangement: The Tu-134 might have a different alignment and number of passenger windows compared to the Boeing 727.",
        "Distinctive nose shape with radar dome (in Tu-134)",
        "T-tail design with higher position (Yak-42)",
        "Fuselage Length: The Tu-134 has a shorter fuselage in comparison to the longer Tu-154.",
        "Landing Gear: The landing gear of the Tu-134 typically retracts into pods on the wings, while the Tu-154’s gear retracts into the fuselage.",
        "narrower fuselage (Tu-134)",
        "Landing gear design: The design and placement of the landing gear can also be a distinguishing feature.",
        "Glass nose or radar dome at the front (depending on the variant)",
        "Typically, single-aisle passenger jet",
        "Length and fuselage: The Tu-134 is generally shorter in length compared to the Boeing 727.",
        "Fewer windows along the aircraft (Tu-134 typically has fewer windows)",
        "Number of Engines: The Tu-134 has two engines mounted at the rear, while the Tu-154 has three engines, with one in the tail and two under the wings.",
        "Distinctive glass navigator's nose"
    ],
    "Tu-154": [
        "Landing gear configuration (Tu-154 has a different setup compared to the Boeing 707)",
        "Longer fuselage in comparison to the DC-9",
        "A sleeker, more modern appearance with less sweep on the wings",
        "Swept-back wings with pronounced anhedral (downward angle)",
        "Wing sweepback angle is more pronounced",
        "Narrow-body: The Tu-154 is a narrow-body jet, whereas the A340 is a wide-body jet.",
        "Shorter, more rounded nose compared to the DC-8",
        "Number and spacing of cabin windows: The Tu-154 often has less spacing between windows compared to the Boeing 727.",
        "Swept-back wings with a slight kink near the root",
        "Landing gear: Tu-154 has 12 main tires in a six-wheel main landing gear truck on each side vs. the DC-9's main landing gear setup",
        "Main landing gear in the wings and tail region",
        "Narrow fuselage compared to the Boeing 707",
        "Cockpit window shape: The cockpit windows on the Tu-154 might have different shapes and arrangements compared to the 727.",
        "National or airline markings typical of Russian or Eastern Bloc aviation during its era",
        "Swept wings positioned slightly lower on the fuselage without wing fences or winglets"
    ],
    "Yak-42": [
        "Landing gear (Yak-42's landing gear configuration differs from that of Saab 340's)",
        "No propellers (Saab 2000 is a turboprop aircraft, while Yak-42 is a jet)",
        "Tail design (Yak-42 has a T-tail, Saab 340 has a conventional tail)",
        "lack of visible propellers (ATR-72 has two propellers)",
        "Number of engines (Yak-42 has three jet engines, Saab 340 has two propeller engines)",
        "Engine type (Yak-42 has jet engines, Saab 340 has turboprop engines)",
        "Wing placement (Yak-42 has low-wing configuration, Saab 340 has high-wing configuration)",
        "Wing-mounted air brakes (Yak-42 has these, while the Tu-134 does not)",
        "Smaller overall size and wingspan compared to the Boeing 717",
        "Designated winglets or different wing shapes",
        "No external propellers: The Yak-42 is a jet and lacks the large, visible propellers seen on the An-12.",
        "Presence of winglets on later models",
        "Yak-42 generally has fewer windows along the fuselage than the Tu-154",
        "More bulbous nose shape (Yak-42 nose is less pointed than Tu-134's)",
        "single-aft entry door vs. multiple side entry doors on the ATR-72"
    ]
}